{
    "status": "OK",
    "request_id": "5af5a5db-4daa-45c9-81fd-d455e3e85786",
    "parameters": {
        "query": "intern jobs canada",
        "page": 1,
        "num_pages": 3,
        "date_posted": "today",
        "country": "ca",
        "language": "en"
    },
    "data": [
        {
            "job_id": "EeGx34XxxUOSFuOfAAAAAA==",
            "job_title": "FT Intern",
            "employer_name": "Southwire Canada",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRUJRqdMPp0Bd-WeSwtj4GNvbup5GHT2o6Q3QET&s=0",
            "employer_website": "https://www.southwire.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/ft-intern-at-southwire-canada-4089595100?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/ft-intern-at-southwire-canada-4089595100?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=2bac9423d1921d9b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/ft-intern-southwire-company-llc-JV_IC2280741_KO0,9_KE10,31.htm?jl=1009549712969&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://fr.simplyhired.ca/job/sLdcz0rOlXpKtsEmfkYiMwdj7JgVZbJfNy_LG83zGVFGBp6ueZsVNA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Are you ready to join the People Behind the Power™ of our Canadian organization, which has consistently achieved a Great Place to Work (GPTW) certification in recent years? If so, we invite you to apply for this exciting job opportunity.\n\nIf you are looking to grow your career by digging your hands into various aspects of wire and cable manufacturing in a fun, innovative and diverse culture, then this is the job for you!\n\nA leader in technology and innovation, Southwire Company, LLC is one of North America’s largest wire and cable producers. Southwire and its subsidiaries manufacture building wire and cable, utility products, metal-clad cable, portable and electronic cord products, OEM wire products and engineered products. In addition, Southwire supplies assembled products, contractor equipment, electrical components, hand tools and jobsite power and lighting solutions. The company also offers digital solutions including contractor planning and utility grid resiliency as well as field services including cable testing, rejuvenation and replacement to support our customers as a value-add partner. We are proud to offer competitive compensation, employee benefits, tuition reimbursement and unlimited growth opportunities. Our more than seven decades of progressive growth can be attributed to our determination to developing innovative systems and solutions, exercising environmental stewardship and enhancing the well-being of the communities in which we work and live. How will you power what’s possible?\n\nLocation: Mississauga, ON\n\nRole Type: Remote/Hybrid\n\nTravel Requirements: In this position, you must be able to travel throughout Canada, the United States, and Mexico as may be required from time to time.\n\nJob Description\n\nAs a member of the Southwire team, you’d be working with the best of best in the industry. The technical expertise and knowledge that resides under our roofs is unparalleled, couple that with high energy, great camaraderie, and a desire to dominate the market – and you’ve got an A+ team.\n\nCareer Growth\n\nSouthwire has an unmatched eye for talent, and the tenacity to mentor and develop from within. The experience and learning opportunities provided to you by your peers and management team will equip you to excel at meaningful work, each and every day. This is a special and unique opportunity to join one of our booming divisions – you’ll learn our entire business cycle, financial reporting and strategy to point you in upward career trajectory at Southwire.\n\nThe Intern position provides support for Shared Inside Sales Services, led by the Inside Sales Supervisor. The interns serve as departmental liaisons with internal and external customers and contribute to the shared department responsibility of daily managing general mailboxes, and Orders, and assisting in any special projects as they arise.\n• Provides daily internal and external customer support via phone and email.\n• Updates department members with daily process reporting and analytics of department workflow\n• Using critical thinking skills and full engagement, provides process improvement feedback to management on an ongoing basis\n• Participates in departmental Huddle meetings\n• Other duties/projects as assigned\n\nMinimum Education Level : High School Diploma\n\nSpecialized degree: Business Administration, Commerce, Marketing or Engineering\n\nYears of experience : 0-1 years\n\nTravel - 0%\n\nWorkplace Setting: Hybrid\n\nOther Preferred Skills\n• University or college student in Business Administration, Commerce, Marketing or Engineering.\n• Must possess strong verbal and written communication skills, strong interpersonal capabilities and possess an attention to detail\n• Ability to develop and maintain strong relationships with internal stakeholders within Southwire\n• Ability to multi-task and effectively time manage – with a variety of projects ongoing at once\n• Strong PC skills, including a very good knowledge of Microsoft Office, Excel, Word, and PowerPoint; SAP system.\n• Quick learner and adaptable to change\n• Well organized and capable of effective multi-tasking\n• Energetic and passionate with a flexible spirit\n• Family and Individual Insurance Packages (Health, Life, Dental, and Vision)\n• Paid Time Off & Paid Holidays\n• Pension Plan\n• One-on-one financial coaching with an independent Certified Financial Planner\n• Personal Days\n• Long & Short-Term Disability\n• Employee Assistance Program\n• Employee Referral Program\n• Tuition Reimbursement Programs\n• Advancement & Professional Growth opportunities\n• Parental Leave Top Up\n• & More",
            "job_is_remote": false,
            "job_posted_at": "18 hours ago",
            "job_posted_at_timestamp": 1733173200,
            "job_posted_at_datetime_utc": "2024-12-02T21:00:00.000Z",
            "job_location": "Mississauga, ON",
            "job_city": "Mississauga",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.5852972,
            "job_longitude": -79.64498379999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DEeGx34XxxUOSFuOfAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "55301800",
            "job_onet_job_zone": null
        },
        {
            "job_id": "B5t3ZvZ9sf4LXQl7AAAAAA==",
            "job_title": "Business Development Intern",
            "employer_name": "GAOTek",
            "employer_logo": null,
            "employer_website": "https://gaotek.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/business-development-intern-at-gaotek-4068505825?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/business-development-intern-at-gaotek-4068505825?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "CAYOP",
                    "apply_link": "https://www.cayop.ca/jobs/74384078-business-development-intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "GrabJobs",
                    "apply_link": "https://grabjobs.co/canada/job/event-gig/others/remote-business-development-intern-137124217?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "Jooble",
                    "apply_link": "https://ca.jooble.org/jdp/-9139049927914313824?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Trabajo.org",
                    "apply_link": "https://ca.trabajo.org/job-2891-d1816edb2427e74259fafce9c5fcb421?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Heyo Jobs",
                    "apply_link": "https://jobs.heyo.at/jobs/second-bind-business-development-intern-ecuu?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Sercanto",
                    "apply_link": "https://ca.sercanto.com/detail/a/business-development-intern_north-york_63335581?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Overview:\n\nAs a Business Development Intern, you will learn about the crucial role of driving company's growth and expansion efforts. This hands-on role will provide you with valuable experience in identifying new business opportunities, building strategic partnerships, and contributing to the overall success of our organization.\n\nResponsibilities:\n\n• Market Research: Conduct market research to identify potential growth opportunities, market trends, and competitive\nanalysis.\n\n• Lead Generation: Identify and research potential clients, partners, and business opportunities to build a strong prospect list.\n\n• Prospecting: Initiate outreach to leads through email, and social media to generate interest and schedule meetings.\n\n• Data Analysis: Analyze data and metrics to evaluate the effectiveness of business development strategies and make recommendations for improvements.\n\n• Team Collaboration: Collaborate with cross-functional teams within the organization, including marketing and product development, to ensure a coordinated approach to business development.\n\n• Reporting: Prepare regular reports and updates on business development activities and progress to the management team.\n\nPreferences:\n\n• Currently pursuing a bachelor's or master's degree in business, marketing, tech or a related field (or recent graduate).\n\n• Strong written and verbal communication skills (English).\n\n• Excellent research and analytical skills.\n\n• Self-motivated and eager to learn.\n\n• Team player with a positive attitude.\n\n• Proficiency in Microsoft Office Suite.\n\n• Availability to work 20 hours per week during the internship period.",
            "job_is_remote": false,
            "job_posted_at": "18 hours ago",
            "job_posted_at_timestamp": 1733173200,
            "job_posted_at_datetime_utc": "2024-12-02T21:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DB5t3ZvZ9sf4LXQl7AAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13116100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "_yoMtRB2TMbiSz-KAAAAAA==",
            "job_title": "ML Data Engineering and Data Science Intern - Summer 2025 (Remote, US, CAN)",
            "employer_name": "CrowdStrike",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcToMDKk653AUdUaupOSmOqmZXM3QiptKM9jfptc&s=0",
            "employer_website": "http://www.crowdstrike.com/",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/ml-data-engineering-and-data-science-intern-summer-2025-remote-us-can-at-crowdstrike-4087621287?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/ml-data-engineering-and-data-science-intern-summer-2025-remote-us-can-at-crowdstrike-4087621287?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Built In Toronto",
                    "apply_link": "https://builtintoronto.com/job/ml-data-engineering-and-data-science-intern-summer-2025-remote-us-can/3642866?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Built In",
                    "apply_link": "https://builtin.com/job/ml-data-engineering-and-data-science-intern-summer-2025-remote-us-can/3642866?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Vancouver Tech & Startups",
                    "apply_link": "https://builtinvancouver.org/job/ml-data-engineering-and-data-science-intern-summer-2025-remote-us-can/3642866?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Built In Calgary",
                    "apply_link": "https://builtincalgary.org/job/ml-data-engineering-and-data-science-intern-summer-2025-remote-us-can/3642866?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "CrowdStrike is a global leader in cybersecurity. Our University Program is dedicated to attracting and cultivating the next generation of talent in virtually every field. Our program offers paid positions that allow students and recent graduates to gain real-world experience and develop essential skills while they learn from the best and brightest working professionals. We offer our interns a structured program and supportive environment where they can ignite their passion for the future. Our University Program is designed to provide participants exposure to meaningful work that supports our mission to make the digital world a safer place to live and work. CrowdStrike is where your talent meets cutting-edge tech. Ready to start building a career you can be proud of? Join us!\n\nAbout The Role\n\nCrowdStrike’s CTO Labs team works at the exciting intersection of Artificial Intelligence and Machine Learning, Big Data, and Security. We are looking for Data Science and Data Engineering Interns to work within our diverse and multidisciplinary Data Science team, and you’ll have the chance to broaden your horizons by working jointly with a team of Engineering, Big Data, Machine Learning, and Security domain experts on hard and impactful problems. You will gain valuable experience in a fast-paced, high-growth environment.\n\nThis Internship is fully remote and requires no travel. Your work location is the city/town/province you will be working from remotely. For our 12-week internship program, interns are allowed to work remotely from an alternative location for up to 2 weeks. Interns are also invited to work out of the CrowdStrike office located closest to their remote location.\n\nWhat You'll Do\n• As a Data Engineer intern you will:\n• Learn about containerization, microservices, and distributed architecture and understand, provision and maintain new and existing infrastructure.\n• Participate in engineering efforts to support R&D and machine learning initiatives and work with cutting edge technologies and languages across the entire development stack.\n• Our Data Engineering team is looking for candidates experienced with any high level language such as: Python, Go, JVM Technology and familiarity with Docker, Kubernetes, AWS, GCP, Kafka, ElasticSearch, Cassandra, and Spark\n\nAs a Data Science Intern You Will\n• Have the opportunity to apply your computational, coding, mathematical and scientific research skills to solve cutting problems and work directly with Sr. Data Scientists, helping to create and automate predictive machine learning models.\n• Hone your ability to balance detail-oriented research with goal-oriented business objectives, implement and experiment with new algorithms and methodologies to help improve our machine learning models and automate and visualize analyses, results and processes in our machine learning pipeline.\n• Our Data Science team is looking for candidates experienced in writing python code to pre-process and analyze data to generate actionable insights and is analytically minded with completed coursework in linear algebra and data science or an equivalent knowledge of applied mathematics.\n\nWhat You’ll Need\n• A rising junior, senior, or graduate-level Computer Science, Data Science, Machine Learning student, graduating between December 2025 to August 2026\n• Experience with Language Models, Data Science, and Data Engineering\n• Hands on in your approach to understanding data and learning about new fields\n• Thirsty for knowledge and do not hesitate to step outside of your comfort zone to learn new technologies, algorithms and concepts\n• Comfortable with either Linux, Windows or Mac\n• Knowledge of appropriate algorithms to solve complex technical problems\n\nBonus Points\n• Coursework in data science, linear algebra, or distributed systems\n• Familiar with software vulnerabilities and secure programming\n• Familiar with cloud computing platform(s) AWS/GCP/Azure\n• Experience with AWS, Kafka, Chef, Docker, Kubernetes, Jenkins\n• Data storage and caching technologies: RDBMS, NoSQL, PostgreSQL, Cassandra, Redis, Memcached\n• Computer and/or network security experience/understanding\n• Contributions to the open source community (GitHub, Stack Overflow, blogging)\n\nWhat You Can Expect\n• Executive Speaker Series & Tech Talks\n• Fun socials and give-back events (e.g. virtual trivia, escape rooms, etc.)\n• Development workshops to grow your soft and hard skills\n• Networking opportunities with fellow interns and CrowdStrikers\n• Owning impactful projects that move the company forward\n• Working alongside a diverse and global team\n• Assigned mentor and continuous feedback\n• Participation in our Employee Resource Groups (ERGs)\n• Access to our FalconFit Wellness Program and Employee Assistance Program\n• Fun Slack channels (e.g. food, gaming, sports, pets, etc.)\n• Paid holidays and 401k matching\n• Remote-first culture\n• Market leader in compensation\n\nCrowdStrike is proud to be an equal opportunity and affirmative action employer. We are committed to fostering a culture of belonging where everyone is valued for who they are and empowered to succeed. Our approach to cultivating a diverse, equitable, and inclusive culture is rooted in listening, learning and collective action. By embracing the diversity of our people, we achieve our best work and fuel innovation - generating the best possible outcomes for our customers and the communities they serve.\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran. If you need assistance accessing or reviewing the information on this website or need help submitting an application for employment or requesting an accommodation, please contact us at recruiting@crowdstrike.com for further assistance.\n\nFind out more about your rights as an applicant.\n\nCrowdStrike participates in the E-Verify program.\n\nNotice of E-Verify Participation\n\nRight to Work\n\nCrowdStrike, Inc. is committed to fair and equitable compensation practices. The hourly rate for this position is $38 - $55\n\nExpected Close Date of Job Posting is:01-25-2025",
            "job_is_remote": false,
            "job_posted_at": "18 hours ago",
            "job_posted_at_timestamp": 1733173200,
            "job_posted_at_datetime_utc": "2024-12-02T21:00:00.000Z",
            "job_location": "Montreal, Quebec",
            "job_city": "Montreal",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 45.501886899999995,
            "job_longitude": -73.56739189999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D_yoMtRB2TMbiSz-KAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "BTc8SrfuHa9OYGuXAAAAAA==",
            "job_title": "Summer Research Intern",
            "employer_name": "FP Genetics",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQBmiWqQQcQXKDEtq4OpDpc2XDY6tvL42NSXWNC&s=0",
            "employer_website": "https://www.fpgenetics.ca",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/summer-research-intern-at-fp-genetics-4087411183?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/summer-research-intern-at-fp-genetics-4087411183?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Company Description\n\nFP Genetics brings innovative new genetics to Canadian farmers, supporting pedigreed seed growers and breeders to ensure success across Western Canada. As a leading Canadian agricultural brand, FP Genetics is committed to delivering the best new genetics to farmers, developers, and grain handlers, ultimately benefiting the final consumer.\n\nRole Description\n\nThis is a full-time four month on-site role for a Summer Research Intern at FP Genetics in Saskatoon, SK. The intern will be involved in day-to-day operation of the research lab and field program. They will be working and reporting to the Research Technician and/or Director of Research and Development in the analysis and data collection of field trials.\n• Updating seed inventory database\n• Seed set up for field trials\n• Collection of data on seed quality of seeding and harvest samples\n• Collection of data on research field plots\n• Compilation of field trial data\n• Operation of lab equipment\n• Managing seed shipments\n• There may be an opportunity to work part-time hours in the fall\n\nQualifications\n• Enrollment in a diploma/degree program in plant science, agronomy, horticulture or a related discipline preferred (Applicants with a farm or rural background pursuing a diploma or degree in non-agricultural field of study are encouraged to apply)\n• Experience working in a research setting with seed and/or crops is an asset\n• Valid driver’s license\n• Ability to lift and carry up to 50 lbs\n• Excellent written and spoken communication in English\n• Strong attention to detail and organizational skills\n• Ability to follow protocols\n• Ability to work independently\n• Willingness to work outside of normal working hours when required\n• Willingness to work outdoors in remote locations\n• Willingness to perform tedious and repetitive tasks\n\nPlease e-mail cover letter and resume to Anne Nerbas\n\nApplications close, Feb 2, 2025\n\n[anerbas@fpgenetics.ca]",
            "job_is_remote": false,
            "job_posted_at": "22 hours ago",
            "job_posted_at_timestamp": 1733158800,
            "job_posted_at_datetime_utc": "2024-12-02T17:00:00.000Z",
            "job_location": "Saskatoon, SK",
            "job_city": "Saskatoon",
            "job_state": "Saskatchewan",
            "job_country": "CA",
            "job_latitude": 52.157902,
            "job_longitude": -106.67015769999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DBTc8SrfuHa9OYGuXAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "19309400",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "qJ-SU0tY97vgQdmGAAAAAA==",
            "job_title": "Operational Procurement Buyer Intern",
            "employer_name": "Trench",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSGnBbb3qILS4xI3o_92kRBHhznxJ1LMNrzbve_&s=0",
            "employer_website": "https://trench-group.com",
            "job_publisher": "Indeed",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.indeed.com/viewjob?jk=b18b2f6d00a4a2ba&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=b18b2f6d00a4a2ba&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/operational-procurement-buyer-intern-at-trench-group-4089849308?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/rI7SsH2N4xED4a-vMp8syzBlEOVhCGUOfTKewG1Smdtwg49zUzisSA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Pickering, Ontario, Canada\n\n|\n\nreq1180\n\nPosted: 12/2/2024\n\nOperational Procurement Buyer Intern\n\nOn-site | Full time | Student (not yet graduated)\n\nA Snapshot of Your Day\n\nAre you eager to gain practical experience in a fully integrated and dynamic work environment? We are looking for a university student in engineering, business or supply chain management available full-time for the winter semester to join us as an Operational Procurement Buyer Intern.\n\nAbout us\n\nIn Trench Canada, we deliver state-of-the-art, safe, and reliable instrument transformers, coils, and bushings for seamless energy transmission. With a legacy of customized engineering and innovation, we enable society to harness the power of electricity with reliability and performance. But we are more than just a company. We are a force for change, committed to advancing the energy sector through cutting-edge technology and sustainable practices. We genuinely care about continuous improvement, and our dynamic workplace values attention to detail and adaptability, fostering a culture of equality, diversity, and inclusion where everyone is respected and truly valued.\n\nYour Tasks:\n• Shadowing the Procurement team to gain insight and experience.\n• Reviewing and refining operational procurement processes & procedures.\n• Coordinating with suppliers and logistics.\n• Negotiation, supplier relationship management, and collaboration with internal and external stakeholders.\n• Support the Corporate Procurement team by developing and maintaining templates and dashboards using data analysis and visualization tools such as Microsoft Excel, Power BI or others.\n• Conducting reconciliations and addressing any discrepancies in reporting.\n• Offering assistance and support to fellow Procurement team members in planning, inventory management, data mining and analysis, in addition to following up with suppliers and the receiving team.\n• Prepare weekly reports & maintain data management.\n\nRequirements:\n• A university degree or college diploma in supply chain, business, engineering or a relevant field.\n• Knowledge of SAP, MM module (Material Management).\n• Solid understanding of procurement to pay business systems, procurement principles and processes, and commercial terms.\n• Strong communication, interpersonal, and analytical skills including MS Excel: Intermediate to advanced skills with Pivot Table, Micros, IF functions, Vlook up, name ranges etc.\n• Organizational skills to manage multiple concurrent priorities.\n• Strong communication skills, verbal and written.\n• Ability to build strong working relationships with diverse suppliers, service providers, and colleagues.\n• Strict attention to detail, ability to balance numerous tasks and meet tight deadlines.\n• An eagerness to learn.\n• Interest in being an integral part of the team and making meaningful contributions.\n• Flexible to a changing environment.\n• Ability to effectively diagnose and troubleshoot problems that may arise.\n• Ability to collect and analyze qualitative data.\n\nWe offer:\n• The opportunity to be a part of a supportive and collaborative team.\n• Develop broad operational experience while collaborating with suppliers and internal teams.\n• Gain experience in a first-class manufacturing environment.\n\nOur Commitment\nTrench invites applications from all qualified individuals and is committed to fostering workplace diversity. We provide accommodations to applicants with disabilities throughout our hiring process. If you require this information in an alternate format, need communication support, or need accommodation in applying for a posting and/or are selected for an interview, don't hesitate to reach out to us. Trench utilizes artificial intelligence in its job scanning and recruitment process to effectively find the candidate most suitable for each position.\n\nHAVE WE PIUED YOUR INTEREST? We are looking forward to receiving your application - just click on the \"\" button and send us your application.",
            "job_is_remote": false,
            "job_posted_at": "15 hours ago",
            "job_posted_at_timestamp": 1733184000,
            "job_posted_at_datetime_utc": "2024-12-03T00:00:00.000Z",
            "job_location": "Pickering, ON",
            "job_city": "Pickering",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.838411699999995,
            "job_longitude": -79.0867579,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DqJ-SU0tY97vgQdmGAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "43306100",
            "job_onet_job_zone": "3"
        },
        {
            "job_id": "v1UoShkYaEFeUH-tAAAAAA==",
            "job_title": "Workforce Insights Analyst Intern",
            "employer_name": "Equinix",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQhgiYFhQHT7Gqqs1c_xfV10uQbl-vfVRPgHCnU&s=0",
            "employer_website": "http://www.equinix.com/",
            "job_publisher": "Equinix Careers",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://careers.equinix.com/jobs/workforce-insights-analyst-intern-toronto-ontario-canada?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Equinix Careers",
                    "apply_link": "https://careers.equinix.com/jobs/workforce-insights-analyst-intern-toronto-ontario-canada?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/workforce-insights-analyst-intern-equinix-JV_IC2281069_KO0,33_KE34,41.htm?jl=1009550142259&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=bce442d745cc275d&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/workforce-insights-analyst-intern-at-equinix-4087639823?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Talentify",
                    "apply_link": "https://www.talentify.io/job/workforce-insights-analyst-intern-toronto-ontario-ca-equinix-jr-147881?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://fr.simplyhired.ca/job/geSSHTbUMiRIH45CYC48jv2od4tzGhXIkmBZ0IHnMO_ztPrWgS61Zg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Who are we?\n\nEquinix is the world’s digital infrastructure company®, operating over 260 data centers across the globe. Digital leaders harness Equinix's trusted platform to bring together and interconnect foundational infrastructure at software speed. Equinix enables organizations to access all the right places, partners and possibilities to scale with agility, speed the launch of digital services, deliver world-class experiences and multiply their value, while supporting their sustainability goals.\n\nA career at Equinix means you will collaborate on work that impacts the world and be surrounded by endless opportunities to learn new skills and grow in varied directions. We embrace diversity in thought and contribution and are committed to providing an equitable work environment that is foundational to our core values as a company and is vital to our success. \n\nWorkforce Insights Analyst Intern\n\nWhy Join Equinix?\n\nWe pride ourselves on our Global Program being an immersive and impactful experience designed to kick start your corporate career and set you up for future success.\n• Work on real business challenges: You will be assigned with a project and work directly with teams to gain real-work experience, contribute to the business, and impact the digital world.\n• Be supported throughout your journey: You will be mentored and coached by numerous colleagues, including your managers, subject experts, an assigned buddy and a formal mentor.\n• Participate in a curated program of workshops and events: Learn from our leaders through our Executive Speaker Series, continue to grow through our workshops and build meaningful worldwide connections through our networking events.\n• Gain global recognition: We celebrate your time with Equinix and the work you have completed through our Global Ideas Competition “Shark Tank.” This competition provides you with the recognition you deserve and lets you share your work with the global community of Equinix.\n\nJoining our internship program means you will have a chance to secure a future role at Equinix when you graduate!\n\nOverview of Team, Department, and Role:\n\nThe Workforce Insights team conducts advanced analytics using HR and employee data. They measure, report, analyze, and predict business outcomes to provide actionable insights that drive HR policy and decision-making. As a Workforce Insights Analyst Intern, you can expect to:\n• Assist in conducting key driver analysis by gathering, cleaning, transforming, and analyzing org data to identify factors influencing a critical talent outcome, aligned with strategic HR objectives (HR Big Bets).\n• Perform statistical analyses, such as regression or SEM and build predictive model POC, to quantify relationships and generate actionable insights using R/Python.\n• Create compelling visualizations in Tableau to effectively communicate findings.\n• Collaborate with cross-functional teams to validate data and results, prioritize impactful drivers, and co-develop recommendations for targeted interventions.\n• Who You Are (Requirements and Qualifications):\n• Must be currently enrolled in an accredited university/college, in your penultimate year of your bachelor’s or master’s degree studies (Graduation between December 2025-September 2026) \n• Available to work full-time for the entire duration of the Summer Internship Program (between  May to September, depending on your school system)  \n• Proficiency in R, Python, Excel, and SQL\n• Proficiency in either Tableau or PowerBI\n• Ability to multi-task and work collaboratively and effectively in a fast-paced environment  \n• Excellent written and verbal communication skills, able to tell a story using data\n• Ability to create accurate and punctual reports, deliver presentations, and share information and ideas with others \n• Analytically driven and detail-oriented, with working knowledge of Microsoft Office Package and aptitude to learn new software \n\nHow to Apply\n\nPlease submit your application by providing the following.\n• Up to date resume that includes your availability (start and end date) and expected graduation\n• Please apply to this job posting only if you are available full time for an internship during the stated period.\n\nWhat’s next\n\nThe Equinix New to Career team will be reviewing applicants on a rolling basis throughout October and November and will reach out to applicants accordingly. We appreciate your patience while we consider your application.  If you would like to learn about other career opportunities, we have to offer check out our careers page!  \n• Learn more about the program and what former interns have to say about their experience - https://careers.equinix.com/students-recent-grads\n• Watch this video to learn more on how Equinix is powering the worlds digital infrastructure. https://youtu.be/aTTIbsfP8j0\n\nEquinix is committed to ensuring that our employment process is open to all individuals, including those with a disability. If you need assistance in applying for an open position, you may send an email to Staffing@equinix.com. Please provide your contact information and let us know how we can assist you.\n\nEquinix is committed to ensuring that our employment process is open to all individuals, including those with a disability. If you are a qualified candidate and need assistance or an accommodation, please let us know by completing this form.\n\nEquinix is an Equal Employment Opportunity and, in the U.S., an Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to unlawful consideration of race, color, religion, creed, national or ethnic origin, ancestry, place of birth, citizenship, sex, pregnancy / childbirth or related medical conditions, sexual orientation, gender identity or expression, marital or domestic partnership status, age, veteran or military status, physical or mental disability, medical condition, genetic information, political / organizational affiliation, status as a victim or family member of a victim of crime or abuse, or any other status protected by applicable law.",
            "job_is_remote": false,
            "job_posted_at": "18 hours ago",
            "job_posted_at_timestamp": 1733173200,
            "job_posted_at_datetime_utc": "2024-12-02T21:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dv1UoShkYaEFeUH-tAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "43911100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "g5Bt5MFO4GLGp8vRAAAAAA==",
            "job_title": "Full-Stack B2B Marketing Intern",
            "employer_name": "Crewscope",
            "employer_logo": null,
            "employer_website": "https://crewscope.com",
            "job_publisher": "Monster.ca",
            "job_employment_type": "Full-time and Internship",
            "job_employment_types": [
                "FULLTIME",
                "INTERN"
            ],
            "job_apply_link": "https://www.monster.ca/job-openings/full-stack-b2b-marketing-intern-toronto-on--d615ed8d-5c4b-4567-a3fe-4faa3ddbadf8?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Monster.ca",
                    "apply_link": "https://www.monster.ca/job-openings/full-stack-b2b-marketing-intern-toronto-on--d615ed8d-5c4b-4567-a3fe-4faa3ddbadf8?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "About Us\n\nCrewscope is on a mission to solve the labor shortage by improving the connection between workers and work to improve workers' productivity and retention. We provide a software platform to motivate and incentivize field workers in construction and industrial settings. This is done by setting common shared goals, communicating the necessary information, and implementing an objective performance incentive to align motivations. Our solution improves productivity by 10+%, improves forecast accuracy, and improves employee satisfaction and retention. All of that results in a significant increase in profitability and capability to grow for our customers. We are also adding AI-enabled communication and forecasting tools to Crewscope in the upcoming months.\n\nWe are looking for an enthusiastic and energetic marketing student intern to join our team and help us build our brand, create value for our prospects and customers, and implement our marketing strategy.\n\nWhat You'll Do\n• Go-to-market Support: Support demand generation, prospecting, and sales in a B2B Enterprise outbound sales capacity.\n• Social Media: Take ownership of our official LinkedIn (and other potential social media), and support founders with their LinkedIn content\n• Content Development & Thought Leadership: Content creation by interviewing founders and SMEs, converting content to various formats for media channels, and managing content pipeline.\n• Communication: Assist customer success with customer communications and nurture to support successful rollout and expansion.\n• Digital Brand: Own website maintenance and update, SEO, and digital brand presence.\n• Press: Write press releases, compile media lists, and pitch stories to journalists.\n• Implement a thought leadership program leveraging tactics like articles, videos, speaking opportunities, and awards.\n• Events: Help plan, prepare, execute, and follow up on professional events such as conferences and customer/prospect networking events.\n\nAbout You – You will be successful when:\n• You have a propensity to action and excel in a fast-paced startup environment, adeptly handling multiple tasks and projects.\n• You bring a high level of personal task management to the table! You can stay on top of your TODOs and timelines in a chaotic and busy startup environment.\n• You are proficient in or eager to learn startup tools like HubSpot, Apollo, Asana, WordPress, Google Analytics, and Canva.\n• You have a keen eye for detail and ensure all projects meet the highest standards of quality.\n• You are a content creator at heart, with experience in producing various types of content and working with agencies or internal teams.\n• You are a final-year student or recent graduate (within the past two years) of an undergraduate or post-graduate diploma program from an accredited university or college in Ontario, Canada, and eligible to work in Canada.\n\nWhat We Offer\n• This is a paid internship, with a minimum wage of $17.20 CAD/hr (can be slightly higher depending on the candidate's qualifications).\n• The position is full-time (37.5 hrs/week), but we are flexible if the candidate prefers (4 days/week, i.e. 30 hrs/week). Minimum total is 510 hrs.\n• The internship is for a minimum of 4 months (1 semester), but we are open to longer internships (2 or 3 semesters).\n• This is a unique opportunity to have an early seat at the table of a growing startup as we scale.\n• We will work collaboratively to build and improve our brand in the market using the latest marketing technologies.\n• We will provide fractional marketing leadership (fractional CMO) support to help guide and support you in your individual development and learning, as well as your role and duties.\n• We provide flexible remote working accommodation while striving to get together at least once a week to build a strong connection.\n\nRemote\n\nAbout the Company:\nCrewscope",
            "job_is_remote": false,
            "job_posted_at": "15 hours ago",
            "job_posted_at_timestamp": 1733184000,
            "job_posted_at_datetime_utc": "2024-12-03T00:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dg5Bt5MFO4GLGp8vRAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13116100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "49ELPz5sEp8kfKpoAAAAAA==",
            "job_title": "Industrial Designer (Paid Internship)",
            "employer_name": "KAVEBROS",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRx9R_YhWo018GQ_SgAThIvqY2MGI3rR1PiQLDz&s=0",
            "employer_website": null,
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/industrial-designer-paid-internship-at-kavebros-4087421579?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/industrial-designer-paid-internship-at-kavebros-4087421579?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Monster.ca",
                    "apply_link": "https://www.monster.ca/job-openings/industrial-designer-paid-internship-calgary-ab--8f34736b-6e7b-4350-b938-7c5dbb5f8b13?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                }
            ],
            "job_description": "Company Description\n\nKave Inc. is a cutting-edge sleep technology company based in Calgary, Alberta, focused on transforming the way humans rest with their innovative Hibernation Sleep Mask, and many planned tech-enabled SKU's after the initial crowdfunding campaign. Their commitment to tech-driven solutions, user-centric design, and sustainability sets them apart in the sleep tech industry. This is a rare chance to get in on the ground floor of an amazing Canadian startup.\n\nRole Description\n\nThis is a full-time role for an Industrial Designer (Paid Internship) at KAVEBROS. The Industrial Designer will be responsible for tasks such as industrial design, product design, prototyping, design thinking, research in the sleep mask/accessory industry and product development.\n\nQualifications\n• Industrial Design, Product Design, and Prototyping skills\n• Experience in Design Thinking and Product Development\n• Proficiency in CAD software and prototyping tools\n• Strong problem-solving and creative thinking abilities\n• Excellent communication and collaboration skills\n• Ability to work independently and in a team\n• Knowledge of materials and manufacturing processes\n• Bachelor's degree in Industrial Design or related field\n\nRequirement\n• The candidate must be based out of Calgary, or relocate to Calgary.",
            "job_is_remote": false,
            "job_posted_at": "21 hours ago",
            "job_posted_at_timestamp": 1733162400,
            "job_posted_at_datetime_utc": "2024-12-02T18:00:00.000Z",
            "job_location": "Calgary, AB",
            "job_city": "Calgary",
            "job_state": "Alberta",
            "job_country": "CA",
            "job_latitude": 51.044733099999995,
            "job_longitude": -114.0718831,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D49ELPz5sEp8kfKpoAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "27102100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "e6t5mbzKhqfcw_QTAAAAAA==",
            "job_title": "UX Designer Intern",
            "employer_name": "Canada Workday ULC",
            "employer_logo": null,
            "employer_website": "https://www.workday.com",
            "job_publisher": "ZipRecruiter",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://www.ziprecruiter.com/c/Canada-Workday-ULC/Job/UX-Designer-Intern/-in-Vancouver,BC?jid=c4aff04f3fcd66a8&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/Canada-Workday-ULC/Job/UX-Designer-Intern/-in-Vancouver,BC?jid=c4aff04f3fcd66a8&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Your work days are brighter here.\n\nAt Workday, it all began with a conversation over breakfast. When our founders met at a sunny California diner, they came up with an idea to revolutionize the enterprise software market. And when we began to rise, one thing that really set us apart was our culture. A culture which was driven by our value of putting our people first. And ever since, the happiness, development, and contribution of every Workmate is central to who we are. Our Workmates believe a healthy employee-centric, collaborative culture is the essential mix of ingredients for success in business. That's why we look after our people, communities and the planet while still being profitable. Feel encouraged to shine, however that manifests: you don't need to hide who you are. You can feel the energy and the passion, it's what makes us unique. Inspired to make a brighter work day for all and transform with us to the next stage of our growth journey? Bring your brightest version of you and have a brighter work day here.\n\nAbout the Team\nThe Workday Analytics UX team modernizes how humans and computers work together. Our analytics products help our customers make sense of complex data and guide them in making data-driven decisions. We keep our product teams focused on providing the most value possible to our customers in this space. Our team is growing, and we need individuals who can take the best of what's already there, and innovate to deliver something extraordinary.\n\nAbout the Role\n\nWe are looking for a 32-week design intern who enjoys the fun and challenge of applying their design practice to make cloud data accessible, actionable and beautiful. You will work closely with your cross-functional team to develop concepts, flows, and UI for Workday's suite of analytics products. You'll also partner with other designers to improve the quality of your designs and theirs, and continue your growth as a designer. This role involves both vision and feature work on a newer product in the suite which will allow you to spend time thinking about the bigger picture while staying engaged on the mechanics of getting it done.\n\n#LI-DNI\n\nAbout You\n• You have a strong product sense and understand how to ship a well-crafted product experience.\n• You are intellectually curious and seek to frame problems in new ways to drive your process.\n• You are eager to learn and enjoy collaborating with a world-class cross-disciplinary team of UX, engineers, and product managers, especially around accessible and inclusive design\n• You care about the way users develop and share insights and want to build the next generation of tools for understanding and managing massive quantities of data.\n\nPlease submit portfolio (link or PDF) for review with application and include password if applicable. Case studies highly preferred.\n\nBasic Qualifications:\n• Currently pursuing a Bachelor in UX Design, Interaction Design, Psychology, Cognitive Science, Human Computer Interaction, Product Design, or related field, with an anticipated graduation date no earlier than April 2026\n• Able to commit to a full-time internship program for 32-week program from May 12, 2025 to December 19th, 2025\n• You will return to university studies after the conclusion of the internship\n• A portfolio of design work or class projects demonstrating your design process\n\nOther Qualifications:\n• Basic understanding of the user-centered design process\n• Experience creating user flows, wireframes, and prototypes to communicate your design concepts\n• Familiarity with modern design and prototyping software and tools (like Figma)\n• Ability to develop positive relationships with UX peers, Product Managers, and Engineers\n• A genuine curiosity and desire to ask questions\n• Ability to communicate and collaborate across stakeholders and a variety of cross-functional partners\n• Ability to explore several design solutions, prototype and iterate based on peer feedback, customer research, and experimentation\n• Proactively seek challenges and responsibilities\n• Model a positive outlook even in challenging situations\n• Familiarity with modern design and prototyping software and tools (like Figma)\n• Understanding of design system patterns, design principles is a plus\n\nWorkday Internship Program\n\nReady for your career to shine? At Workday, we believe that the next generation of talent is essential to our success, which is why we seek hard-working students with open minds, new perspectives and bright ideas to join our Intern Program. During the 32-week in-person internship experience, you'll make an impact at Workday by engaging in meaningful work, all the while forging professional connections, and strengthening your skills in an encouraging environment. Plus, you'll be encouraged to bring your brightest self to work with coaching and mentorship, connection events and exposure to Workday's stellar culture while living our Core Values.\n\nLet's make work days brighter. Apply today to start your career as a member of the Workday Intern Program!\n\nWorkday Pay Transparency Statement\n\nThe annualized base salary ranges for the primary location and any additional locations are listed below. Workday pay ranges vary based on work location. As a part of the total compensation package, this role may be eligible for the Workday Bonus Plan or a role-specific commission/bonus, as well as annual refresh stock grants. Recruiters can share more detail during the hiring process. Each candidate's compensation offer will be based on multiple factors including, but not limited to, geography, experience, skills, job duties, and business need, among other things. For more information regarding Workday's comprehensive benefits, please click here.\n\nPrimary Location: CAN.BC.Vancouver\n\nPrimary CAN Base Pay Range: $51,300 - $111,900 CAD\n\nAdditional CAN Location(s) Base Pay Range: $51,300 - $111,900 CAD\n\nOur Approach to Flexible Work\n\nWith Flex Work, we're combining the best of both worlds: in-person time and remote. Our approach enables our teams to deepen connections, maintain a strong community, and do their best work. We know that flexibility can take shape in many ways, so rather than a number of required days in-office each week, we simply spend at least half (50%) of our time each quarter in the office or in the field with our customers, prospects, and partners (depending on role). This means you'll have the freedom to create a flexible schedule that caters to your business, team, and personal needs, while being intentional to make the most of time spent together. Those in our remote \"home office\" roles also have the opportunity to come together in our offices for important moments that matter.\n\nPursuant to applicable Fair Chance law, Workday will consider for employment qualified applicants with arrest and conviction records.\n\nWorkday is an Equal Opportunity Employer including individuals with disabilities and protected veterans.\n\nAre you being referred to one of our roles? If so, ask your connection at Workday about our Employee Referral process!",
            "job_is_remote": false,
            "job_posted_at": "18 hours ago",
            "job_posted_at_timestamp": 1733173200,
            "job_posted_at_datetime_utc": "2024-12-02T21:00:00.000Z",
            "job_location": "Vancouver, BC",
            "job_city": "Vancouver",
            "job_state": "British Columbia",
            "job_country": "CA",
            "job_latitude": 49.2827291,
            "job_longitude": -123.12073749999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3De6t5mbzKhqfcw_QTAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "27102400",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "w9sl2MB27yk6dWgYAAAAAA==",
            "job_title": "Sales Internship - Summer 2024",
            "employer_name": "Vantage Marketing Canada",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRUy2nrMvcw5mOb368JlBJrr4oABTNYpHk-oJGB&s=0",
            "employer_website": "https://www.vantagemarketingcanada.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/sales-internship-summer-2024-at-vantage-marketing-canada-4089591053?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/sales-internship-summer-2024-at-vantage-marketing-canada-4089591053?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "VNTG MARKETING: SUMMER JOB OPPORTUNITY IN SALES\n\nVantage is looking for motivated interns across Canada who are ready to take on a challenge this summer for an unforgettable experience. Vantage specializes in direct B2C sales of residential services. We provide daily advanced training throughout the summer, so sales experience is not necessary—just a desire to learn and strong communication skills! In short, Vantage is a job opportunity for exceptional individuals seeking a stepping stone for their careers or future in entrepreneurship.\n\nThis opportunity is for you if...\n• You have an entrepreneurial spirit and are competitive.\n• You are available full-time during the summer.\n• You want to develop your sales skills.\n• You are disciplined and motivated.\n• You are looking for concrete “in-the-field\" work experience.\n• Sales experience NOT REQUIRED!\n\nOur Culture:\n\nSocial Aspect: Team spirit plays an important role at Vantage. Team meetings are not just about work; they also encourage mutual support, contributing to the improvement of sales skills and individual performance. Vantage also offers individuals the opportunity to meet new ambitious and motivated profiles, fostering a competitive spirit.\n\nSelf-Development: Individuals working with Vantage seek to not only develop their sales skills but also grow personally. At Vantage, we teach the science of sales as well as the art of discipline.\n\nOur Benefits:\n• Free housing provided by the company.\n• Compensation: average salary of $13,090 for rookies.\n• Comprehensive sales training: daily meetings at the office.\n• Company-organized events (office parties, beach outings, game nights, etc.)\n• All-inclusive top performers end-of-year trip.\n\nVantage Marketing only hires the most ambitious individuals!\n\nWe are accepting applications for various locations across Canada for summer 2025. If you think you have what it takes, don't wait—apply today! Our offices fill up quickly! Last year we had 400 rookie reps working with us and over 15 000 total applicants! The first step is a group information session that dives deeper into our company and the position in question. We look forward to getting to know you!\n\nTo learn more, we invite you to visit our social media:\n\nInstagram/LinkedIn: @vantagemarketingcanada",
            "job_is_remote": false,
            "job_posted_at": "19 hours ago",
            "job_posted_at_timestamp": 1733169600,
            "job_posted_at_datetime_utc": "2024-12-02T20:00:00.000Z",
            "job_location": "Montreal, Quebec",
            "job_city": "Montreal",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 45.501886899999995,
            "job_longitude": -73.56739189999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dw9sl2MB27yk6dWgYAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "55301800",
            "job_onet_job_zone": null
        },
        {
            "job_id": "3CvmFVpOjxaMHI8AAAAAAA==",
            "job_title": "Polygon Summer Internship Program",
            "employer_name": "Polygon Realty",
            "employer_logo": null,
            "employer_website": "https://polyhomes.com",
            "job_publisher": "Indeed",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://emplois.ca.indeed.com/viewjob?jk=6f1d10a63568f0aa&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://emplois.ca.indeed.com/viewjob?jk=6f1d10a63568f0aa&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/polygon-summer-internship-program-polygon-realty-JV_IC2278756_KO0,33_KE34,48.htm?jl=1009550188240&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/mvjZyb4NMAvevVUh39teIMpaW_qIX6o7kOGrrshav-Lqe_p27TJduA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "About Polygon\n\nAt Polygon, we pride ourselves on building with purpose. A true British Columbia owned and operated real estate developer since 1980, we’ve built more than 34,000 homes throughout Metro Vancouver and the Fraser Valley. From luxury high-rise towers in dynamic urban centers to complete master planned communities, we have worked hard to earn the trust of thousands of families by committing to quality design, sound construction, and exceptional customer service.\n\nWe value integrity, trust, and ‘doing the right thing’. Our team of bright, motivated, and hard-working employees is really what makes Polygon such a great place to work and we truly believe in investing in our teams and in the communities in which we build. Come join one of British Columbia’s top real estate developers!\n\nInternship overview\n\nWe are excited to offer university students with a passion for real estate an opportunity to be a ‘Polygoner’ for a 15-week (May 12 – August 22, 2025) internship/co-op. You will get to learn various aspects of our business and make strong connections within the industry. This will be an immersive experience, designed to provide you with a core focus on Development, Finance, Acquisitions, or Marketing, while also providing meaningful, integrative exposure to all of the other function groups.\n\nBased out of our Vancouver head office, you will work alongside industry leaders on exciting projects and tasks, and gain valuable work experience. Consider this your next step towards a career in real estate!\n\nWhat you can expect:\n• Interesting projects and assignments: We want your internship to be an engaging and enriching experience! Work on ongoing Polygon communities and projects and make an impact from day one.\n• “Polygon Academy”: Participate in a series of in-person sessions designed to give you an understanding of all aspects of real estate development, culminating in an integrative group case study presentation.\n• Mentoring support: Experience on-going coaching and support from senior managers to gain a deeper understanding of the industry and how it relates to your individual career path.\n• Professional development: Opportunities to participate in weekly meetings, site visits, and hosted events.\n• Networking: Build and broaden cross-functional relationships with various leaders.\n• Work culture: A welcoming work environment that values collaboration and its people.\n\nQualifications and Requirements\n• Undergraduate students who are currently completing their third year of study, with preference given to students pursuing degrees in business\n• Demonstrated interest in Real Estate through extra-curricular participation or activities, preferred\n• Ability to juggle multiple priorities and demonstrate effective organization skills to meet business objectives\n• Detail-oriented approach to carrying out responsibilities\n• Excellent interpersonal and communication skills (written & verbal)\n• Strong aptitude with Microsoft Office Suite (e.g. Outlook, Excel, PowerPoint, Word)\n\nSalary\n• Salary: $3,750/month\n\nAdditional Benefits\n• Summer Hours: Additional days off before Long Weekends and leave early every Friday\n• Accessible and transit-friendly location: close to the 99 B-line bus stop\n\nHow to apply\n\nPlease click on the ‘Apply Now’ button to apply and upload your cover letter, resume, and unofficial academic transcript. We thank all applicants for their interest and will only be in touch with shortlisted candidates.\n\nApplication deadline: January 10, 2025 at 11:59pm (PST)\n\nPlease send your resumé and cover letter to: careers@polyhomes.com",
            "job_is_remote": false,
            "job_posted_at": "14 hours ago",
            "job_posted_at_timestamp": 1733187600,
            "job_posted_at_datetime_utc": "2024-12-03T01:00:00.000Z",
            "job_location": "Vancouver, BC",
            "job_city": "Vancouver",
            "job_state": "British Columbia",
            "job_country": "CA",
            "job_latitude": 49.2827291,
            "job_longitude": -123.12073749999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D3CvmFVpOjxaMHI8AAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": "MONTH",
            "job_highlights": {},
            "job_onet_soc": "55301800",
            "job_onet_job_zone": null
        },
        {
            "job_id": "UfCJxdbYqUyKKAjkAAAAAA==",
            "job_title": "Large Commercial Canada Intern",
            "employer_name": "AXA Group",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTW9X_BwAvBsQOuwoZVPFybsunAajI2SIMe1uyp&s=0",
            "employer_website": null,
            "job_publisher": "Careers At AXA",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://careers.axa.com/global/en/job/AXGRGLOBAL11007663D20241030MYHRTALEOENEXTERNALENGLOBAL/Large-Commercial-Canada-Intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Careers At AXA",
                    "apply_link": "https://careers.axa.com/global/en/job/AXGRGLOBAL11007663D20241030MYHRTALEOENEXTERNALENGLOBAL/Large-Commercial-Canada-Intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=4c03075cd671df51&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/large-commercial-canada-intern-axa-JV_IC2281069_KO0,30_KE31,34.htm?jl=1009520474420&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/lpumenFJLovNZF4SIY3XDpFDG4W498yYFROOX3XiLMqJFikkhCRh5w?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Adzuna",
                    "apply_link": "https://www.adzuna.ca/details/4933463545?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Monster.ca",
                    "apply_link": "https://www.monster.ca/job-openings/large-commercial-canada-intern-toronto-on--766f4f97-18b0-4f19-9804-2cecfa9cefda?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/large-commercial-canada-intern-at-axa-xl-4071699779?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Levels.fyi",
                    "apply_link": "https://www.levels.fyi/jobs?jobId=137872009827623622&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "AXA XL Large Commercial Intern, Americas\n\nToronto, ON I Canada\n\nAXA XL offers property, casualty, financial lines and specialty insurance and reinsurance solutions for mid-sized companies through to large multinationals globally. We blend underwriting discipline, analytic excellence, and a compelling market focus to create excellent partnerships with clients and brokers.\n\nSharpen your skills while gaining insight into the insurance industry. During our 10-week paid internship, you’ll work on meaningful projects alongside diverse and highly skilled professionals as well as widely known leaders in a non-vertical structure that has learning and development in its DNA.\n\nDuring this program, you will join a specific team to learn about their function and the work they do. This opportunity gives you the chance to develop new skills, gain new experiences and interact with technical specialists and company management, which will be key to your future career development. You will be exposed to various areas of our business through intern events and activities.\n\nDISCOVER your opportunity\n\nWhat will your essential responsibilities include?\n\n· Gain insight into the role of insurance professionals (Underwriting, Claims, Finance, Human Resources).\n\n· Develop an understanding of AXA XL’s insurance and reinsurance business.\n\n· Complete cross-functional team project culminating in a final presentation to Senior Leadership.\n\n· Network with leaders across the enterprise\n\n· Engage in a highly collaborative, entrepreneurial work environment\n\nYou will report to Large Commercial Manager.\n\nSHARE your talent\n\nWe’re looking for someone who has these abilities and skills:\n\n· Excellent verbal and written communication and interpersonal skills.\n\n· Demonstrated leadership experience with a drive for results.\n\n· A high level of intellectual capability and curiosity.\n\n· Passion for solving problems through collaboration and innovation.\n\n· Robust sense of ethics and accountability.\n\n· Willing to take on challenges, open to feedback, and ready to act.\n\n· Legal authorization to work in the country in which the position is posted.\n\nFIND your future\n\nAXA XL, the P&C and specialty risk division of AXA, is known for solving complex risks. For mid-sized companies, multinationals and even some inspirational individuals we don’t just provide re/insurance, we reinvent it.\n\nHow? By combining a comprehensive and efficient capital platform, data-driven insights, leading technology, and the best talent in an agile and inclusive workspace, empowered to deliver top client service across all our lines of business − property, casualty, professional, financial lines and specialty.\n\nWith an innovative and flexible approach to risk solutions, we partner with those who move the world forward.\n\nLearn more at axaxl.com\n\nInclusion & Diversity\n\nAXA XL is committed to equal employment opportunity and will consider applicants regardless of gender, sexual orientation, age, ethnicity and origins, marital status, religion, disability, or any other protected characteristic.\n\nAt AXA XL, we know that an inclusive culture and a diverse workforce enable business growth and are critical to our success. That’s why we have made a strategic commitment to attract, develop, advance and retain the most diverse workforce possible, and create an inclusive culture where everyone can bring their full selves to work and can reach their highest potential. It’s about helping one another — and our business — to move forward and succeed.\n• Five Business Resource Groups focused on gender, LGBTQ+, ethnicity and origins, disability and inclusion with 20 Chapters around the globe\n• Robust support for Flexible Working Arrangements\n• Enhanced family friendly leave benefits\n• Named to the Diversity Best Practices Index\n• Signatory to the UK Women in Finance Charter\n\nLearn more at axaxl.com/about-us/inclusion-and-diversity. AXA XL is an Equal Opportunity Employer.\n\nSustainability\n\nAt AXA XL, Sustainability is integral to our business strategy. In an ever-changing world, AXA XL protects what matters most for our clients and communities. We know that sustainability is at the root of a more resilient future. Our 2023-26 Sustainability strategy, called “Roots of resilience,” focuses on protecting natural ecosystems, addressing climate change, and embedding sustainable practices across our operations.\n\nOur Pillars:\n• Valuing nature: How we impact nature affects how nature impacts us. Resilient ecosystems - the foundation of a sustainable planet and society – are essential to our future. We’re committed to protecting and restoring nature – from mangrove forests to the bees in our backyard – by increasing biodiversity awareness and inspiring clients and colleagues to put nature at the heart of their plans.\n• Addressing climate change: The effects of a changing climate are far reaching and significant. Unpredictable weather, increasing temperatures, and rising sea levels cause both social inequalities and environmental disruption. We're building a net zero strategy, developing insurance products and services, and mobilizing to advance thought leadership and investment in societal-led solutions.\n• Integrating ESG: All companies have a role to play in building a more resilient future. Incorporating ESG considerations into our internal processes and practices builds resilience from the roots of our business. We’re training our colleagues, engaging our external partners, and evolving our sustainability governance and reporting.\n• AXA Hearts in Action: We have established volunteering and charitable giving programs to help colleagues support causes that matter most to them, known as AXA XL’s “Hearts in Action” programs. These include our Matching Gifts program, Volunteering Leave, and our annual volunteering day – the Global Day of Giving.\n\nFor more information, please see Sustainability at AXA XL.\n\nThe Canada pay range for this position is 23/Hour. Actual pay will be determined based upon the individual’s skills, experience, and location. We strive for market alignment and internal equity with our colleagues’ pay.",
            "job_is_remote": false,
            "job_posted_at": "15 hours ago",
            "job_posted_at_timestamp": 1733184000,
            "job_posted_at_datetime_utc": "2024-12-03T00:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DUfCJxdbYqUyKKAjkAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "55301800",
            "job_onet_job_zone": null
        },
        {
            "job_id": "p9iy1GhpFwDN8AI7AAAAAA==",
            "job_title": "Data Scientist Intern / Remote- Part Time",
            "employer_name": "New iTalent Digital",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRWea3O1wXP4d61BIy6jIKvatHQDwwKG3O7Hb_6&s=0",
            "employer_website": null,
            "job_publisher": "Recruit.net",
            "job_employment_type": "Part-time",
            "job_employment_types": [
                "PARTTIME"
            ],
            "job_apply_link": "https://www.recruit.net/job/data-scientist-jobs/0264B846A783B590?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Recruit.net",
                    "apply_link": "https://www.recruit.net/job/data-scientist-jobs/0264B846A783B590?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobrapido.com",
                    "apply_link": "https://ca.jobrapido.com/jobpreview/7591445018842234880?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Step into the World of IT Support!\n\nA leading IT recruiting firm based in Canada, is seeking a detail-oriented and technology-savvy Data Scientist / Remote for a part-time, virtual position. This entry-level role is an excellent stepping stone into the rapidly advancing world of IT support, providing an environment to hone and expand your technical skills while working with a diverse, dynamic team.\n\nYour Role and Responsibilities\n\nPerform accurate and efficient data entry in various systems and databases.\nProofread and edit data for correctness, performing updates as necessary.\nMaintain strict confidentiality of sensitive information.\nEnsure data backups are correctly performed.\nSupport IT team with other administrative tasks as needed.\n\nIf you are keen to kick-start your career in IT support, thrive in a fast-paced environment and have a knack for details, we would love to hear from you. Apply now and join the New iTalent Digital team in empowering businesses with top-notch IT solutions!",
            "job_is_remote": false,
            "job_posted_at": "15 hours ago",
            "job_posted_at_timestamp": 1733184000,
            "job_posted_at_datetime_utc": "2024-12-03T00:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dp9iy1GhpFwDN8AI7AAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "p1daYrU6tg05w1qRAAAAAA==",
            "job_title": "Cyber Security Intern (Remote Cybersecurity Internship)",
            "employer_name": "Refonte Learning",
            "employer_logo": null,
            "employer_website": "https://www.refontelearning.com",
            "job_publisher": "Jooble",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.jooble.org/rjdp/-5564994737648799406?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Jooble",
                    "apply_link": "https://ca.jooble.org/rjdp/-5564994737648799406?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Refonte ( Refonte AI ) is a leading IT corporation globally recognized for its expertise in providing top-notch IT and Ed-tech services. Specializing in digital marketing, data science, data analytics, business analytics, cyber security, UI-UX design, web development, and app development, we are dedicated to innovation, excellence, and empowering talents worldwide. Recaste Infini experts use new technological methodologies such as SAST, DAST, IAST and OWAST.\nLearn More:\n\nJob Summary:\n\nRefonte Infini is offering a chance for eager individuals seeking to master Digital Marketing from basic to advanced levels, all while engaging in real-world projects across the globe. The RIGTIP (Refonte Global Training & Internship Program) is structured to provide a flexible work setting, allowing participants to collaborate with a diverse global team spanning Oceania, Asia, Europe, and the Americas.\n\nRoles & Responsibilities:\n• Develop, Build and Deploy DevSecOps CI/CD for Static application security testing (SAST)\n• Develop, Build and Deploy DevSecOps CI/CD for Dynamic Application Security Testing (DAST)\n• Develop, Build and Deploy DevSecOps CI/CD for Interactive Application Security Testing (IAST)\n• Apply Open Worldwide Application Security Project (OWAST) methodologies to real world project\n• Build a safe and secure system and gain knowledge of the principles of vulnerability assessment and reconnaissance to protect your infrastructure and web presence.\n• Utilize practical exploits and assess how they affect your systems.\n• Evaluate the risk assessment and perform threat modeling of a web application architecture.\n• Create a successful vulnerability management strategy.\n• Learn how to use online open-source intelligence applications for passive reconnaissance.\n• Execute footprinting and reconnaissance, a crucial pre-attack part of the ethical hacking process using the most recent methods and technologies.\n• Master multiple scanning techniques using NMAP and NPING, and conduct scanning on the target network outside of IDS and firewall.\n• Understand the workings of web applications and web servers, their vulnerabilities, and how to prevent attacks\n\nQualifications:\n• Currently pursuing any degree showcasing a strong commitment to continuous learning and professional growth.\n• Exceptional written and verbal communication skills, vital for effective collaboration and articulation of complex ideas.\n• Demonstrated ability to work both independently and as part of a cohesive team, highlighting adaptability and strong teamwork capabilities.\n\nNote:\n\nThis position is part of our unpaid “Cyber Security Training & Internship” under RIGTIP. Upon application, our team will contact you to proceed with the application details and joining process.\n\nLocation:\nRemote, Canada\n\nLearn More:\n\nThank you for considering Refonte Infini Private Limited for your professional development in the field of digital marketing. We look forward to welcoming you to our dynamic team.",
            "job_is_remote": false,
            "job_posted_at": "15 hours ago",
            "job_posted_at_timestamp": 1733184000,
            "job_posted_at_datetime_utc": "2024-12-03T00:00:00.000Z",
            "job_location": "Canada",
            "job_city": null,
            "job_state": null,
            "job_country": "CA",
            "job_latitude": 56.130365999999995,
            "job_longitude": -106.34677099999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dp1daYrU6tg05w1qRAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15112200",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "Ay_6DB54VCZBdW0EAAAAAA==",
            "job_title": "Marketing Intern",
            "employer_name": "Vovex Golf",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRDjiMqspR6NZRick5NpKUXURoTrTOLj1NXJgZ3&s=0",
            "employer_website": "https://vovexgolf.com",
            "job_publisher": "Indeed",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.indeed.com/viewjob?jk=b9864727d8ee5db9&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": true,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=b9864727d8ee5db9&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/marketing-intern-vovex-golf-JV_IC2280736_KO0,16_KE17,27.htm?jl=1009550048841&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "CAYOP",
                    "apply_link": "https://www.cayop.ca/jobs/73414665-marketing-intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Joinrs",
                    "apply_link": "https://www.joinrs.com/it/job-offers/47392/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "• Greet and welcome guests as soon as they arrive\n• Direct visitors to the appropriate place and assist them login the system\n• Answer incoming phone calls\n• Ensure reception area is tidy and presentable, with all necessary stationery and material\n• Provide basic and accurate information in-person and via phone/email\n• Order supplies and keep inventory of stock\n\nJob Type: Internship / Co-op\nContract length: 4 months\n\nBenefits:\n• Language training provided\n\nFlexible language requirement:\n• French not required\n\nSchedule:\n• 8 hour shift\n• Monday to Friday\n• Weekends as needed\n\nEducation:\n• Secondary School (preferred)\n\nWork Location: In person\n\nExpected start date: 2024-12-09",
            "job_is_remote": false,
            "job_posted_at": "16 hours ago",
            "job_posted_at_timestamp": 1733180400,
            "job_posted_at_datetime_utc": "2024-12-02T23:00:00.000Z",
            "job_location": "Markham, ON",
            "job_city": "Markham",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.8599076,
            "job_longitude": -79.3349945,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DAy_6DB54VCZBdW0EAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13116100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "r1ocrmpx39kZnkalAAAAAA==",
            "job_title": "SC Intern 1",
            "employer_name": "PepsiCo",
            "employer_logo": null,
            "employer_website": "https://www.pepsico.com",
            "job_publisher": "Pepsicojobs.com",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://www.pepsicojobs.com/main/jobs/348826?lang=fr-ca&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": true,
            "apply_options": [
                {
                    "publisher": "Pepsicojobs.com",
                    "apply_link": "https://www.pepsicojobs.com/main/jobs/348826?lang=fr-ca&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/PepsiCo/Job/SC-Intern-1/-in-Laval,QC?jid=b09bace6d23b67ba&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/sc-intern-1-pepsico-JV_IC2296205_KO0,11_KE12,19.htm?jl=1009550616714&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/sc-intern-1-at-pepsico-4087625258?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Talentify",
                    "apply_link": "https://www.talentify.io/job/sc-intern-1-laval-quebec-ca-pepsico-348826?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Adzuna",
                    "apply_link": "https://www.adzuna.ca/details/4960760162?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jooble",
                    "apply_link": "https://ca.jooble.org/jdp/-5265010894980952188?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Aperçu\n\nPourquoi choisir le programme de leadership de la chaîne d'approvisionnement chez PepsiCo?\n• Incidence positive - Nous osons apporer des changements positifs en créant une chaîne d'approvisionnement plus durable avec des produits plus sains.\n• Expérience avec de grandes marques et innovation - Nous osons appuyer les talents bourgeonnants en leur donnant le pouvoir de jouer un rôle actif dans l'avenir de nos marques emblématiques Quaker et Frito-Lay.\n• Leadership dès le départ - Nous osons donner aux leaders de tous les niveaux des formations et des occasions pertinentes pour leur perfectionnement.\n• Un endroit où vous pouvez être vous-mêmes - Nous osons accorder la priorité aux autres, exprimer notre opinion sans crainte et célébrer la perspective de tout le monde.\n\nL'entreprise\n\nPepsiCo est un endroit privilégié pour les gens curieux. Nous invitons les penseurs et penseuses, les entrepreneurs et entrepreneuses et les agents et agentes du changement à promouvoir l'innovation, à prendre des risques calculés et à remettre en question le statu quo. Des cadres aux membres d'équipes de première ligne, nous envisageons tous et toutes l'avenir avec enthousiasme. Nous prenons des risques. Ensemble, nous osons rendre le monde meilleur.\n\nNos employé-es constituent notre ingrédient magique. Chacun et chacune joue un rôle essentiel dans l'établissement de liens étroits et solides entre les gens et nos produits. Pensez à votre dernière célébration en groupe : il y a fort à parler que l'une de nos marques emblématiques y était. À PepsiCo, nous vous invitons à faire partie d'une équipe mondiale d'innovateurs et d'innovatrices qui fabriquent, transportent et vendent ces produits qui sont consommés avec plaisir par plus d'un miliard de personnes chaque jour.\n\nUne carrière à PepsiCo, c'est travailler pour une entreprise où tout le monde est bienvenu. Chez nous, vous pouvez oser être vous-même. Peu importe qui vous êtes ou d'où vous venez, vous pouvez influencer les gens qui vous entourent et le monde en général. En vous présentant, vous aurez la possibilité d'apprendre, de vous perfectionner et d'accroître les compétences dont vous aurez besoin. L'esprit d'entraide qui règne dans nos équipes vous rapprochera de vos objectifs professionnels pour que vous ayez un impact significatif sur les gens et la planète.\n\nJoignez-vous à nous. Osez le meilleur.\n\nResponsabilités\n\nÀ quoi rassemblera votre expérience de stage?\n• Vous serez affecté.e à l'une de nos usines de production de calibre mondial ou à l'un de nos nombreux centres de distribution.\n• Vous aurez des mandats qui vous demanderont de réaliser des analyses coûts-avantages et d'équilibrer nos quatre grands impératifs: le coût, la qualité, le service et les gens.\n• Vous développerez vos compétences en leadership en participant à une formation d'amélioration continue dans le but de pouvoir éventuellement diriger une équipe de première ligne.\n• Vous devrez aider votre équipe à atteindre les cibles de rendement établies et les aider à mettre en oeuvre les procédures d'amélioration du rendement.\n• Vous devrez également déterminer quelles intiatives d'optimisation de l'efficacité conviennent à votre équipe et les mettre en oeuvre (p. ex, réduction des temps d'arrêt planifiés, repérage des points de perte de matières premières, direction du personnel de première ligne, changements aux procédures et réduction des pertes liées aux produits et aux emballages).\n\nQualification\n\nQuels types de candidats et candidates recherchons-nous?\n• Baccalauréat obtenu au plus tard en decembre 2026;\n• Habiletés exceptionnelles en communication et en relations interpersonnelles;\n• Engagement avéré à collaborer avec des gens et à les diriger;\n• Aptitudes éprouvées en résolution de problèmes et habileté à gérer des priorités concurrentes;\n• Capacité à travailler efficacement en équipe et à \"se retrousser les manches.\"\n\nOverview\n\nSee French version\n\nResponsibilities\n\nSee French version\n\nResponsibilities\n\nSee French version\n\n#PFCsc",
            "job_is_remote": false,
            "job_posted_at": "21 hours ago",
            "job_posted_at_timestamp": 1733162400,
            "job_posted_at_datetime_utc": "2024-12-02T18:00:00.000Z",
            "job_location": "Laval, Quebec",
            "job_city": "Laval",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 45.6066487,
            "job_longitude": -73.712409,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dr1ocrmpx39kZnkalAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "55301800",
            "job_onet_job_zone": null
        },
        {
            "job_id": "fqnfCh8WD01cN-QYAAAAAA==",
            "job_title": "Sales Intern",
            "employer_name": "Vantage Marketing Canada",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRUy2nrMvcw5mOb368JlBJrr4oABTNYpHk-oJGB&s=0",
            "employer_website": "https://www.vantagemarketingcanada.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/sales-intern-at-vantage-marketing-canada-4087441869?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/sales-intern-at-vantage-marketing-canada-4087441869?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "VANTAGE MARKETING: SUMMER JOB OPPORTUNITY IN SALES\n\nFrench below\n\nVantage is looking for motivated interns across Canada who are ready to take on a challenge this summer for an unforgettable experience. Vantage specializes in direct B2C sales of residential services. We provide daily advanced training throughout the summer, so sales experience is not necessary—just a desire to learn and strong communication skills! In short, Vantage is a job opportunity for exceptional individuals seeking a stepping stone for their careers or future in entrepreneurship.\n\nThis opportunity is for you if...\n• You have an entrepreneurial spirit and are competitive.\n• You are available full-time during the summer.\n• You want to develop your sales skills.\n• You are disciplined and motivated.\n• You are looking for concrete “in-the-field\" work experience.\n• Sales experience NOT REQUIRED!\n\nOur Culture:\n\nSocial Aspect: Team spirit plays an important role at Vantage. Team meetings are not just about work; they also encourage mutual support, contributing to the improvement of sales skills and individual performance. Vantage also offers individuals the opportunity to meet new ambitious and motivated profiles, fostering a competitive spirit.\n\nSelf-Development: Individuals working with Vantage seek to not only develop their sales skills but also grow personally. At Vantage, we teach the science of sales as well as the art of discipline.\n\nOur Benefits:\n• Free housing provided by the company.\n• Compensation: average salary of $13,090 for rookies.\n• Comprehensive sales training: daily meetings at the office.\n• Company-organized events (office parties, beach outings, game nights, etc.)\n• All-inclusive top performers end-of-year trip.\n\nVantage Marketing only hires the most ambitious individuals!\n\nWe are accepting applications for various locations across Canada for summer 2025. If you think you have what it takes, don't wait—apply today! Our offices fill up quickly! Last year we had 400 rookie reps working with us and over 15 000 total applicants! The first step is a group information session that dives deeper into our company and the position in question. We look forward to getting to know you!\n\nTo learn more, we invite you to visit our social media:\n\nInstagram/LinkedIn: @vantagemarketingcanada\n• *\n\nVANTAGE MARKETING : EMLOI D’ÉTÉ EN VENTES\n\nVantage recrute partout au Canada des talents motivés, prêts à relever un défi durant l'été pour vivre une expérience inoubliable. Vantage est une compagnie qui se spécialise en ventes directes B2C de services résidentiels. Nous offrons une formation avancée quotidienne pendant l’été, donc l’expérience en ventes n’est pas nécessaire… seulement le désir d’apprendre et les compétences en communication nécessaires! En bref, Vantage offre une opportunité de travail pour des individus d'exception souhaitant développer leurs compétences en vente et qui cherchent à profiter d’un tremplin pour leur carrière ou leur avenir entrepreneurial.\n\nCette opportunité est pour toi si...\n• Tu possèdes l’esprit entrepreneurial\n• Tu es compétitif et persévérant\n• Tu es disponible à temps plein pendant l’été.\n• Tu veux développer tes compétences en ventes.\n• Tu es discipliné et motivé.\n• Tu recherches de l’expérience de travail concrète.\n• Expérience en ventes NON REQUISE!\n\nNotre culture :\n• Aspect social: L'esprit d'équipe joue un rôle important chez Vantage. Les réunions d'équipe ne se limitent pas au travail, elles favorisent également l'entraide, contribuant ainsi à l'amélioration des compétences en vente et des performances individuelles. Vantage offre également aux individus l'opportunité de rencontrer de nouveaux profils ambitieux et motivés, favorisant ainsi un esprit compétitif.\n• Développement de soi: Les individus qui travaillent avec Vantage cherchent à non seulement développer leurs habiletés en ventes, mais aussi à se développer en tant que personne. Chez Vantage, on apprend la science des ventes tout comme on apprend l'art de la discipline.\n\nNos bénéfices:\n• Logement gratuit offert par la compagnie.\n• Compensation: salaire moyen de 13 090$ pour les « rookies ».\n• Formation complète en ventes: rencontre quotidienne au bureau situé à St-Henri.\n• Événements organisés par la compagnie (party de bureau, sortie à la plage, « game nights », etc)\n• Voyage de fin de saison tout-inclus offert par la compagnie dans le sud (réservé aux meilleurs performeurs canadiens)\n\nVantage Marketing n’engage que les individus les plus ambitieux!\n\nNous acceptons des applications pour divers endroits à travers le Québec pour l’été 2025.\n\nSi tu penses avoir ce qu’il faut, ne tarde plus et postule aujourd’hui! Nos bureaux se remplissent rapidement ! L'année dernière, nous avons eu plus de 400 représentants travaillant avec nous et plus de 15 000 candidats au total ! La première étape est une séance d’information qui plonge plus en profondeur sur notre entreprise et le poste en question. Nous serons ravis d’apprendre à te connaître!\n\nPour en apprendre plus, nous t’invitons à visiter nos réseaux sociaux :\n\nInstagram/LinkedIn: @vantagemarketingcanada",
            "job_is_remote": false,
            "job_posted_at": "18 hours ago",
            "job_posted_at_timestamp": 1733173200,
            "job_posted_at_datetime_utc": "2024-12-02T21:00:00.000Z",
            "job_location": "Montreal, Quebec",
            "job_city": "Montreal",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 45.501886899999995,
            "job_longitude": -73.56739189999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DfqnfCh8WD01cN-QYAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": "HOUR",
            "job_highlights": {},
            "job_onet_soc": "41101200",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "C6HlPlWTQeV7X4WDAAAAAA==",
            "job_title": "Safety Intern - Eastern Canada District Summer 2025",
            "employer_name": "Kiewit Corporation",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTGm7PrwM4V_MDmO5kGzVHqpLXc7MnxNE4Uof0D&s=0",
            "employer_website": "https://www.kiewit.com",
            "job_publisher": "Indeed",
            "job_employment_type": "Full-time and Internship",
            "job_employment_types": [
                "FULLTIME",
                "INTERN"
            ],
            "job_apply_link": "https://emplois.ca.indeed.com/viewjob?jk=8f5a3b09f26ab115&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://emplois.ca.indeed.com/viewjob?jk=8f5a3b09f26ab115&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/safety-intern-eastern-canada-district-summer-2025-kiewit-corporation-JV_IC2281069_KO0,49_KE50,68.htm?jl=1009550214131&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/safety-intern-eastern-canada-district-summer-2025-at-kiewit-4090055400?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.com/job-listing/safety-intern-eastern-canada-district-summer-2025-kiewit-corporation-JV_IC2281069_KO0,49_KE50,68.htm?jl=1009550214131&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://fr.simplyhired.ca/job/bZHORWpc-ZCEPAhsGL7ty04xMywLMcrSoMPYl1VwEKPkZMPZcD7Vzg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Requisition ID: 174500\n\nJob Level: Internship\n\nHome District/Group: DHO Safety\n\nDepartment: Safety\n\nMarket: Transportation\n\nEmployment Type: Full Time Temporary\n\nPosition Overview\n\nAre you interested in a hands-on real-world learning experience directly related to the skills needed in a full-time construction career? In this internship, you will have the opportunity to develop, participate and learn key roles and functions within construction management.\n\nDistrict Overview\n\nEastern Canada District's projects include highways, bridges, mass transit, mine site development & open pit operations, hydroelectric powerhouses, wind-power plants, dams & industrial. They serve the construction and mining industries and operates in Eastern Canada.\n\nLocation\n\nEastern Canada District's projects include highways, bridges, mass transit, mine site development & open pit operations, hydroelectric powerhouses, wind-One of the many things that makes Kiewit’s culture unique is that we go where the work is, which exposes your career to abundant opportunities. We relocate our teams based on the work that is available, combined with the development plans, skill sets and career goals of each team member. This means your Kiewit adventure is custom designed to meet our shared needs.\n\nThis opportunity will support projects across the country in large cities and small towns. Job assignment location will be determined closer to your start date.\n\nResponsibilities\n• Work in the company’s health and safety programs at the project level, driving a safety-oriented approach to work\n• Compile, analyze, and interpret occupational illness and accident statistical data at the project level\n• Recommend process and product safety features that will reduce employee exposure to chemical, physical, and biological work hazards\n• Routinely monitor the workforce for unsafe behaviors and coach employees on the correct behaviors when observed\n• Develop a paperwork management system to track training records to track all safety training initiatives conducted personally or by outside consultants/vendors\n• Interpret safety regulations for the project.\n\nQualifications\n• Technical or Bachelor’s degree in Occupational Health and Safety, Environmental Safety,Health Safety, NCSO, or a related field of study\n• Familiar with construction terminology is an asset\n• Working knowledge of the Occupational Health and Safety Legislation\n• Excellent interpersonal, written, and verbal communication skills\n• Proficient in Microsoft Office, fluent in Word, Excel, and PowerPoint\n• Willingness to work in a variety of locations across Canada, isolated areas requiring travel and camp accommodations\n• Highly motivated, with a demonstrated passion for safety excellence and taking initiative\n• Demonstrated commitment to ethics and integrity\n• Team player with the ability to work independently\n• Abilities to work under pressure: respect deadlines, high expectations\n• Strong organization, time management, and attention to detail\n• Ability to travel and relocate as business requires.\n\nOther Requirements:\n• Regular, reliable attendance\n• Work productively and meet deadlines timely\n• Communicate and interact effectively and professionally with supervisors, employees, and others individually or in a team environment\n• Perform work safely and effectively. Understand and follow oral and written instructions, including warning signs, equipment use, and other policies.\n• Work during normal operating hours to organize and complete work within given deadlines. Work overtime and weekends as required.\n• May work at various different locations and conditions may vary\n\nWe offer our fulltime staff employees a comprehensive benefits package that’s among the best in our industry, including top-tier medical, dental and vision plans covering eligible employees and dependents, voluntary wellness and employee assistance programs, life insurance, disability, retirement plans with matching, and generous paid time off.\n\nWe believe in equal opportunity in employment practices without discrimination and comply with all laws regarding human rights in the provinces where we operate.",
            "job_is_remote": false,
            "job_posted_at": "13 hours ago",
            "job_posted_at_timestamp": 1733191200,
            "job_posted_at_datetime_utc": "2024-12-03T02:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DC6HlPlWTQeV7X4WDAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "11103100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "2-ktba0217miB5IGAAAAAA==",
            "job_title": "SUMMER RESEARCH INTERN - Saskatoon (4 months)",
            "employer_name": "FP Genetics",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSXFoRWBO4OGTaQyrkQul-z99RxwF0w2kjkuvY0&s=0",
            "employer_website": "https://www.fpgenetics.ca",
            "job_publisher": "Indeed",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.indeed.com/viewjob?jk=3ba89ec99ea641bd&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=3ba89ec99ea641bd&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://fr.glassdoor.ca/job-listing/summer-research-intern-saskatoon-4-months-fp-genetics-JV_IC2291672_KO0,41_KE42,53.htm?jl=1009549769699&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "AgCareers.com",
                    "apply_link": "https://www.agcareers.com/fp-genetics/summer-research-intern--saskatoon-4-months-job-968804.cfm?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://fr.simplyhired.ca/job/mTYAKglaZ-dSQNsAIDAm3VxgzasjcScZz8n-aOyj0sX4tXUs_O0Hqg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Main Responsibility: Assist with the day-to-day operations of the research lab and field program while reporting to the Research Technician and/ or Director of Research & Development.\n\nResponsibilities:\n\nAssist with:\n• updating seed inventory database\n• seed set-up for field trials\n• collection of data on seed quality of seeding and harvest samples\n• collection of data on research field plots\n• compilation of field trial data\n• operation of lab equipment\n• seed shipments\n• there may be an opportunity to work part-time hours in the fall\n\nQualifications:\n• enrollment in a diploma or degree program in plant science, agronomy, horticulture or a related discipline preferred. Applicants with a farm or rural background pursuing a diploma or degree in non-agricultural field of study are encouraged to apply.\n• experience working in a research setting with seed and/ or crops is an asset\n• attention to detail\n• ability to follow protocols\n• ability to work independently\n• willingness to work outside of normal working hours when required\n• willingness to work outdoors in remote locations\n• valid driver’s license\n• ability to lift and carry up to 50 lbs.\n• excellent written and spoken communication in English\n• willingness to perform tedious and repetitive tasks\n\nPlease e-mail cover letter and resume to Anne Nerbas, anerbas@fpgenetics.ca\n\nApplications close, Feb 2, 2025\n\nJob Type: Internship / Co-op\nContract length: 4 months\n\nPay: $15.00-$25.00 per hour\n\nExpected hours: 40 per week\n\nSchedule:\n• Monday to Friday\n\nWork Location: In person\n\nApplication deadline: 2025-02-02",
            "job_is_remote": false,
            "job_posted_at": "20 hours ago",
            "job_posted_at_timestamp": 1733166000,
            "job_posted_at_datetime_utc": "2024-12-02T19:00:00.000Z",
            "job_location": "Saskatoon, SK",
            "job_city": "Saskatoon",
            "job_state": "Saskatchewan",
            "job_country": "CA",
            "job_latitude": 52.157902,
            "job_longitude": -106.67015769999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D2-ktba0217miB5IGAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": "HOUR",
            "job_highlights": {},
            "job_onet_soc": "19309400",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "7_d61zbdowqFoOWGAAAAAA==",
            "job_title": "QA Analyst Intern",
            "employer_name": "The MRG Group",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSxRGDe0f0Vf4jt2xPERp763pmxIoKPlJSWy6S1&s=0",
            "employer_website": "http://groupmrg.com/",
            "job_publisher": "ZipRecruiter",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://www.ziprecruiter.com/c/The-MRG-Group/Job/QA-Analyst-Intern/-in-Toronto,ON?jid=abbfc60b02a40817&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": true,
            "apply_options": [
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/The-MRG-Group/Job/QA-Analyst-Intern/-in-Toronto,ON?jid=abbfc60b02a40817&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                }
            ],
            "job_description": "Salary: $17.20 /hour\n\nQA Analyst Intern\n\nThe MRG Group\n\nToronto, ON\n\nWe are seeking a motivated and enthusiastic QA Analyst Intern to join our team. Reporting directly to the lead engineers, the successful candidate will assist the team in quality assurance activities and gain hands-on experience in testing methodologies, test automation, and quality processes, with opportunities for growth and learning.\n\nABOUT OUR INTERNSHIP PROGRAM\n\nThe MRG Group Internship Program is designed to provide you with practical skills, valuable experiences, and exposure to real-world scenarios in the Experience industry.\n\nThe program is structured to ensure that 80% of your time is dedicated to performing activities specific to their role, while the remaining 20% is allocated to job shadowing, skill development, and team projects across various businesses within the MRG Group.\n\nABOUT THE MRG GROUP\n\nThe MRG Group is a leader in experience creation. In operation since 2008, The MRG Group has grown to become Canada's largest independent entertainment company, and through its ownership of 10 hospitality properties and 7 venues across Canada, the business is passionate about providing positive shareable experiences for its guests, 500+ employees, and partners.\n\nIn addition, The MRG Group owns and operates an events business, travel company, digital publication, and ticketing service Admit One. In 2021, the business expanded its presence into the US, signing its first venue deals with properties in New York and California later that year.\n\nKey Responsibilities\n• The successful candidate will assist the team in testing web, mobile applications and hardware. They will report to the lead engineers.\n• The candidate will be expected to create and execute test cases, identify and document bugs, and verify bug fixes across frontend, backend, and mobile applications. This is an internship, so perfection is not anticipated - what matters is their ability to learn and improve themselves each day.\n• Participate in test planning and strategy discussions with the development team.\n• Learn and apply various testing methodologies including functional testing, regression testing, and user acceptance testing.\n• Assist in developing and maintaining automated test scripts.\n\nKnowledge, Skills, Abilities\n• Basic understanding of software testing principles and methodologies\n• Experience with Microsoft Playwright\n• Good analytical and problem-solving skills\n• Strong attention to detail and documentation abilities\n• Basic understanding of web and mobile applications\n• Experience with (or eagerness to learn) test automation tools, bug tracking systems, and test management platforms\n• Familiarity with or interest in learning about React, Node.js, Go, MongoDB and React Native is a plus\n\nInternship Program Term\n\nStart Date: January 14, 2025\n\nEnd Date: May 30, 2025\n\nWhat's In It For You?\n• Paid Internship (Minimum Wage)\n• A fun and casual environment. You will be joining a close-knit, innovative team of creative and energetic go-getters\n• Employee Discounts to our concerts/shows and at our hospitality venues\n• A welcoming, fun and safe work environment where everyone can show up authentically to work each day and feel respected\n• Career development opportunities with a company that encourages individuals to learn and grow\n\nThank you for your interest in MRG. Given the anticipated interest in this role, only those selected for an interview will be contacted.\n\n#MRGCareers",
            "job_is_remote": false,
            "job_posted_at": "10 hours ago",
            "job_posted_at_timestamp": 1733202000,
            "job_posted_at_datetime_utc": "2024-12-03T05:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D7_d61zbdowqFoOWGAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15119900",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "rm_e9Laaz1BgOJVvAAAAAA==",
            "job_title": "Research And Development Intern",
            "employer_name": "Lallemand",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQJfTwnVlhSfOhrGNBdZrFYsLAqiVR_CWKpIfMf&s=0",
            "employer_website": "http://www.lallemand.com/",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/research-and-development-intern-at-lallemand-4089513574?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/research-and-development-intern-at-lallemand-4089513574?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "C. elegans Probiotics Research Intern @ Lallemand Health Solution, Montreal\n\nThis position provides an excellent opportunity to gain practical experience in a research laboratory, learn about C. elegans, and contribute to probiotics-related studies. As an intern, you’ll work closely with experienced scientists and contribute to ongoing research projects.\n\nResponsibilities:\n• Laboratory Assistance:\n• Assist senior researchers in preparing and maintaining cultures.\n• Perform routine tasks such as feeding, transferring, and synchronizing worm populations.\n• Prepare agar plates, media, and solutions for experiments.\n• Maintain accurate records of experimental procedures and results.\n• Collaborate with the team to design and execute experiments related to probiotic efficacy.\n• Conduct assays to assess changes in worm behavior, lifespan, and overall fitness.\n• Record observations, measurements, and experimental outcomes.\n• Use microscopy and imaging techniques to capture images of stained worms.\n• Assist in data analysis using appropriate software (e.g., ImageJ , Excel or Graph pad )\n• Restock supplies, dispose of waste properly, and follow safety protocols.\n• Participate in lab meetings and journal clubs.\n\nQualifications:\n• Possess a Bachelor’s degree or a college diploma in life science, Microbiology, Biotechnology, Biochemistry, or related field\n• Possess a minimum of 1 years of experience in a similar position\n• Familiar with molecular biology and microbiology techniques\n• Excellent oral and written communication skills, in French and English\n• Proficient computer skills (Microsoft 365, LIMS)\n• Experience in R&D is an asset\n\nDuration and Compensation:\n• The internship duration is for 8months beginning from January 2025, with possibility of extension for up to 1 year.\n\nOrganization\n\nLallemand is a privately held Canadian company founded in the late 19th century, which develops, produces, and markets microorganisms for various markets. The administrative offices of the parent company are in Montreal, Canada. Today, Lallemand employs more than 5,000 people working in more than 45 countries on 5 continents.\n\nLallemand Health Solutions specializes in the production of probiotics intended to serve the agri-food, parapharmaceutical, and pharmaceutical industries. With its manufacturing processes adhering to the highest standards of quality, the company provides probiotic strains that help millions of people improve their health and well-being.\n\nOn top of its extensive portfolio of ready-to-use probiotics (Lacidofil®, Probiokid®, Probio'Stick®, Protecflor®), the Health Solutions branch also tailor-makes unique formulas to respond to clients' unique needs. This process employs the Harmonium, Lafti®, or Rosell® strains.\n\nThe Lallemand Health Solutions team enjoys a stellar reputation, as one of the only companies that is authorized to produce the S.boulardii strain. Whether in North America, Europe, or Asia, your next pro-fessional challenge awaits you at Lallemand!",
            "job_is_remote": false,
            "job_posted_at": "22 hours ago",
            "job_posted_at_timestamp": 1733158800,
            "job_posted_at_datetime_utc": "2024-12-02T17:00:00.000Z",
            "job_location": "Montreal, Quebec",
            "job_city": "Montreal",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 45.501886899999995,
            "job_longitude": -73.56739189999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Drm_e9Laaz1BgOJVvAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "19309400",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "XaMLezj71G6zqPhEAAAAAA==",
            "job_title": "Marketing Intern - Waterdown, Ontario Canada",
            "employer_name": "Stryker",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSJRB5uQigRJAQIEtB4nUmWNHtVap42zkJ1N-Jm&s=0",
            "employer_website": "http://www.stryker.com/",
            "job_publisher": "Stryker Careers",
            "job_employment_type": "Full-time and Internship",
            "job_employment_types": [
                "FULLTIME",
                "INTERN"
            ],
            "job_apply_link": "https://careers.stryker.com/marketing-intern-waterdown-ontario-canada/job/5B06A2C74A3BC7A7998D544745068CF5?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": true,
            "apply_options": [
                {
                    "publisher": "Stryker Careers",
                    "apply_link": "https://careers.stryker.com/marketing-intern-waterdown-ontario-canada/job/5B06A2C74A3BC7A7998D544745068CF5?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/Stryker-Canada-ULC/Job/Marketing-Intern-Waterdown,-Ontario-Canada/-in-Hamilton,ON?jid=f06af83f047f1205&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Eluta.ca",
                    "apply_link": "https://www.eluta.ca/spl/marketing-intern-waterdown-ontario-canada-839c036f47d01c9e2819c2b6fffd3f26?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=a4fda4f25b1a5c49&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/Q7JzgN55b9DpKrAlF39xaJh4Uz6pnemf5FPc8YamvobIGRQf-0cERw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/marketing-intern-waterdown-ontario-canada-at-stryker-4020332577?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jooble",
                    "apply_link": "https://ca.jooble.org/jdp/-7714140381207935719?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Sercanto",
                    "apply_link": "https://fr.ca.sercanto.com/detail/a/marketing-intern-waterdown-ontario-canada_hamilton_54412655?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Who we want​\n\n​\n\nChallengers. People who seek out the hard projects and work to find just the right solutions.​\n\nTeammates. Partners who listen to ideas, share thoughts and work together to move the business forward.​\n\nCharismatic networkers. Relationship-savvy people who intentionally make connections with both internal partners and external contacts.​\n\nStrategic thinkers. Interns who propose innovative ideas and consistently exceed their performance objectives.​\n\nCustomer-oriented achievers. Individuals with an unparalleled work ethic and customer-focused attitude who bring value to their partnerships.​\n\nGame changers. Persistent interns who will stop at nothing to live out Stryker’s mission to make healthcare better. ​\n\n​\n\nWhat You Get Out of the Internship​\n\n​\n\nStryker, a global leader in medical technology takes great pride in their people, and that’s why we’re looking to expand our talent. As a result, we are looking for the best and brightest students to strengthen our team and drive our business going forward. As a Marketing intern at Stryker, you will:​\n\n​\n• Apply classroom knowledge and gain experience in a fast-paced and growing industry setting​\n• Implement new ideas, be constantly challenged, and develop your skills​\n• Network with key/high-level stakeholders and leaders of the business​\n• Be a part of an innovative team and culture​\n• Complete projects that revolve around medical education, marketing/operations, brand management, and portfolio management​\n\n​​\n\nDownstream Marketing​\n• Participate in key commercialization activities such as developing campaigns, messaging, and positioning​\n• Gain field experience with sales members and surgeons operating in the US​\n• Gather customer insights to aid in the creation and validation of various statements, campaigns and commercial models in order to help achieve results ​\n• Learn and practice the Big Picture Marketing framework in order to build structure to marketing activities into the future​\n\n​\n\nThe intern will have the ability to work collaboratively with sales and marketing teams for the development of strategic insights and data. They will champion gathering relevant market information to help drive data-based decision making. They will have full responsibility to conduct secondary market research to help form a fact-based marketing framework for the Product Management & Leadership team to leverage for future strategic planning. This individual must serve as a contributing member of the Marketing team while championing Stryker’s Mission and Values.",
            "job_is_remote": false,
            "job_posted_at": "11 hours ago",
            "job_posted_at_timestamp": 1733198400,
            "job_posted_at_datetime_utc": "2024-12-03T04:00:00.000Z",
            "job_location": "Hamilton, ON",
            "job_city": "Hamilton",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.2557206,
            "job_longitude": -79.8711024,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DXaMLezj71G6zqPhEAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13116100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "AlW97xUh_kMRHqKfAAAAAA==",
            "job_title": "Canola Breeding Summer Associate - 6 month Internship",
            "employer_name": "BASF",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTOSmSJHD2P1e_rDmwsVlc58lj-D8kwcje-TRuX&s=0",
            "employer_website": "http://www.basf.com/",
            "job_publisher": "Recruit.net",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://www.recruit.net/job/canola-breeding-summer-associate-jobs/A8811627D226E71E?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Recruit.net",
                    "apply_link": "https://www.recruit.net/job/canola-breeding-summer-associate-jobs/A8811627D226E71E?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Now hiring! Canola Breeding Summer Associate\n\nContract Duration: 6 months (Summer)\n\nYorkton/Kamsack, SK\n\nWage: $22 - $30 / hour\n\nWe are looking for a Canola Breeding Summer Associate to join our AP team in Yorkton/Kamsack, SK.\n\nCome create chemistry with us!\n\nBASF’s Agricultural Solutions division connects innovation, customers, partners and agricultural experts and integrates sustainability criteria into all business decisions. We help farmers deliver the best possible outcomes, working to achieve the balance between economic, environmental and social value creation for sustainable and efficient agriculture.\n\nAs a Canola Breeding Summer Associate, you create chemistry by...\n• Being involved in field trials for local and global breeding programs with the goal of developing hybrids that provide the highest return to growers.\n• Being involved with field activities relating to variety development and registration from seeding to harvest including seed set up, land preparation, seeding, pest control, pollination management, plot maintenance, parental development, harvesting and supervision of casual employees as required.\n• Being involved in crop health diagnosis through daily monitoring of field and research plots and data collection.\n• Working in a group setting or independently dependant on the task at hand.\n\nIf you have...\n• Breeding and Agronomic knowledge attained through pursuing your degree/diploma in Agriculture or related program/field and/or recently obtained your Degree/Diploma in Agriculture in the last 2 years.\n• Experience in the Agriculture Industry is an asset, but not a requirement.\n• Demonstrate problem solving skills.\n• Ability to be flexible and modify plans as situations arise minimizing impact on results.\n• Interest in canola development.\n• Ability to deliver results in pursuit of both individual and team goals.\n• Previous farm or machinery experience is an asset but not a requirement as it is a skill set that will be developed on the job.\n\nAbout us\n\nAs the world’s leading chemical company, we have been finding solutions for your everyday needs and addressing the most complex economic, environmental, and sustainability challenges for more than 150 years!\n\nWe constantly strive to become an even better workplace. As a result of our commitment to our employees, BASF has earned various awards, including being recognized by Mediacorp in 2024 as one of Canada's Top Employers for tenth consecutive year, one of the Greater Toronto Area's Top Employers for the eleventh year in a row, and twice being named one of Canada's Top Employers for Young People and Best Diversity Employers.\n\nWe provide a fulfilling work environment with a strong emphasis on the physical and psychological safety of our employees and the communities we operate in. We are always working to form the best team with an emphasis on diversity, equity, and inclusion and through lifelong learning and development.\n\nBelong to Something Bigger. #belongatBASF\n\nPrivacy Statement\n\nBASF takes security & data privacy very seriously. We will never request personal or financial information of any kind via either text message or direct message on any social media platform or job board. Furthermore, we will never offer a candidate a position and request a cheque for equipment or any other type of payment during the job application process. If you have experienced any of the above, please contact myhr@basf.com to report fraud.\n\nInclusion and Equal Opportunity Employment\n\nBASF is dedicated to creating a diverse and inclusive workplace where our employees can be their authentic selves. We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, age, citizenship, place of origin, ethnic origin, colour, religion/creed, sex/pregnancy, marital status, family status, disability status, sexual orientation, gender identity or expression, or any other characteristic protected by law.\n\nWe seek to make our recruitment process accessible for applicants with disabilities. If you require accommodations or support throughout the recruitment process, please contact ta-canada@basf.com with the subject line “Recruitment Accommodation Request”.",
            "job_is_remote": false,
            "job_posted_at": "15 hours ago",
            "job_posted_at_timestamp": 1733184000,
            "job_posted_at_datetime_utc": "2024-12-03T00:00:00.000Z",
            "job_location": "Prince Edward Island",
            "job_city": null,
            "job_state": "Prince Edward Island",
            "job_country": "CA",
            "job_latitude": 46.3188025,
            "job_longitude": -63.146101099999996,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DAlW97xUh_kMRHqKfAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "19309400",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "-qPrRBdC3XDseugRAAAAAA==",
            "job_title": "Software Engineer Intern (Toronto) - Summer 2025",
            "employer_name": "Snowflake",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQSpLqaY5bhser3M_0CNtOLHRqhfh6VYSZ_gF1p&s=0",
            "employer_website": "http://www.snowflake.com/",
            "job_publisher": "Snowflake Careers",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://careers.snowflake.com/us/en/job/SNCOUSD38DF19E64C1405CA3A1ADC24F5ADB9EEXTERNALENUS152B293DEC65486289577F50089728AC/Software-Engineer-Intern-Toronto-Summer-2025?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Snowflake Careers",
                    "apply_link": "https://careers.snowflake.com/us/en/job/SNCOUSD38DF19E64C1405CA3A1ADC24F5ADB9EEXTERNALENUS152B293DEC65486289577F50089728AC/Software-Engineer-Intern-Toronto-Summer-2025?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/software-engineer-intern-toronto-summer-2025-snowflake-JV_IC2281069_KO0,44_KE45,54.htm?jl=1009498546341&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=787d3f1fcf1fec99&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "The Muse",
                    "apply_link": "https://www.themuse.com/jobs/snowflake/software-engineer-intern-toronto-summer-2025-a5cda2?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/03epF4jmPwDutsVVPTSBYwvGafcV7Cp8aHW7pWqamKBwfK0orMukRw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Simplify Jobs",
                    "apply_link": "https://simplify.jobs/p/6a1f18c7-a96d-4d28-abbc-37e66769a113/Software-Engineer-Intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobs.weekday.works",
                    "apply_link": "https://jobs.weekday.works/snowflake-software-engineer-intern-(toronto)---summer-2025?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "Fairygodboss",
                    "apply_link": "https://fairygodboss.com/jobs/snowflake/software-engineer-intern-toronto-summer-2025-efdfae4289cc37b5a7956fce8a36b3a8?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Build the future of the AI Data Cloud. Join the Snowflake team.\n\nSnowflake started with a clear vision: develop a cloud data platform that is effective, affordable, and accessible to all data users. Snowflake developed an innovative new product with a built-for-the-cloud architecture that combines the power of data warehousing, the flexibility of big data platforms, and the elasticity of the cloud at a fraction of the cost of traditional solutions. We are now a global, world-class organization with offices in more than a dozen countries and serving many more.\n\nWe’re looking for dedicated students who share our passion for ground-breaking technology and want to create a lasting future for you and Snowflake.\nWHAT WE OFFER:\n• Paid, full-time internships in the heart of the software industry\n• Post-internship career opportunities (full-time and/or additional internships)\n• Exposure to a fast-paced, fun and inclusive culture\n• A chance to work with world-class experts on challenging projects\n• Opportunity to provide meaningful contributions to a real system used by customers\n• High level of access to supervisors (manager and mentor), detailed direction without micromanagement, feedback throughout your internship, and a final evaluation\n• Stuff that matters: treated as a member of the Snowflake team, included in company meetings/activities, flexible hours, casual dress code, accommodations to work from home, swag and much more\n• When return to office in effect, catered lunches, access to gaming consoles, recreational games, happy hours, company outings, and more\n\nWHAT WE EXPECT:\n• Desired class level: 3rd/4th year Undergraduates, Masters, or PhD\n• Desired majors: Computer Science, Computer Engineering, Software Engineering, or related field\n• Required coursework: algorithms, data structures, and operating systems\n• Recommended coursework: cloud computing, database systems, distributed systems, and real-time programming\n• Bonus experience: working experience, research or publications in databases or distributed systems, and contributions to open source\n• When: Summer 2025 (April - September 2025)\n• Duration: 12 week minimum, 12-16 weeks recommended\n• Excellent programming skills in C++ or Java\n• Knowledge of data structures and algorithms\n• Strong problem solving and ability to learn quickly in a dynamic environment\n• Experience with working as a part of a team\n• Dedication and passion for technology\n\nWHAT YOU WILL LEARN/GAIN:\n• How to build enterprise grade, reliable, and trustworthy software/services\n• Exposure to SQL or other database technologies\n• Understanding of database internals, large-scale data processing, transaction processing, distributed systems, and data warehouse design\n• Implementation, testing of features in query compilation, compiler design, query execution\n• Experience working with cloud infrastructure, AWS, Azure, and/or Google Cloud in particular\n• Learning about cutting edge database technology and research\n\nPOSSIBLE TEAMS/WORK FOCUS AREAS:\n• Data Applications Infrastructure, Data Marketplace, Data Privacy, Data Sharing\n• High performance large-scale data processing\n• Large-scale distributed systems\n• Software-as-a-Service platform\n• Software frameworks for stability and performance testing\n\nEvery Snowflake employee is expected to follow the company’s confidentiality and security standards for handling sensitive data. Snowflake employees must abide by the company’s data security plan as an essential part of their duties. It is every employee's duty to keep customer information secure and confidential.\n\nSnowflake is growing fast, and we’re scaling our team to help enable and accelerate our growth. We are looking for people who share our values, challenge ordinary thinking, and push the pace of innovation while building a future for themselves and Snowflake.\n\nHow do you want to make your impact?",
            "job_is_remote": false,
            "job_posted_at": "15 hours ago",
            "job_posted_at_timestamp": 1733184000,
            "job_posted_at_datetime_utc": "2024-12-03T00:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D-qPrRBdC3XDseugRAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15113100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "h0EygNOyal75w-QCAAAAAA==",
            "job_title": "Winter Internship - Cannabis Cultivation",
            "employer_name": "Hybrid Infusions",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ3W0fGI53UUHzUNenH1AiIVgeQMHctIOWe16wc&s=0",
            "employer_website": null,
            "job_publisher": "Indeed",
            "job_employment_type": "Full-time, Part-time and Internship",
            "job_employment_types": [
                "FULLTIME",
                "PARTTIME",
                "INTERN"
            ],
            "job_apply_link": "https://ca.indeed.com/viewjob?jk=65b0c7672f81492c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": true,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=65b0c7672f81492c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/winter-internship-cannabis-cultivation-hybrid-infusions-JV_IC2274961_KO0,38_KE39,55.htm?jl=1009549908763&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/IK-pa6Xwc6k-H1Ez8HAYL1haGnnIopC0NYGBWzpJWmgd6VPlbg7mwQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Are you a science or agriculture university student looking for a winter internship? If you're keen on jump-starting your career in a unique and developing industry, we have an exciting opportunity for you! We are currently offering Cannabis Cultivation Intern positions that will provide you with insights into cannabis as an agricultural product, allowing you to apply your knowledge and gain hands-on experience in this developing field.\n\nHybrid Infusions, the parent company of the premium cannabis brand, Virtue Cannabis, is a dynamic, independently owned and operated Licensed Cannabis Producer located in Edmonton, AB. As advocates of equal opportunities, we take pride in our exceptional team comprised of diverse and passionate individuals.\n\nJob Description:\n\nAs Cannabis Cultivation Intern, you'll have the chance to work closely with our experienced cultivation technicians. This hands-on experience will provide you with valuable knowledge about cannabis production, compliance with Canadian Cannabis Regulations, and the science behind successful cultivation.\n\nResponsibilities of Cannabis Growing Interns Include:\n• Dive deep into the art of cultivating cannabis, from nurturing young cuttings to fine-tuning their growth to create thriving cannabis plants.\n• Maintain a spotless grow environment, ensuring every tool and surface meets Health Canada standards.\n• Monitor and manage our cannabis plants, protecting them from pests and diseases.\n• Learn the art of precise nutrient application, using both manual and automated techniques.\n• Handle concentrated materials with care, ensuring safety and effectiveness.\n• Contribute to the life cycle of our plants, from tiny cuttings to budding plants.\n• Participate in research, expanding our knowledge of cannabis cultivation.\n• Keep meticulous records, documenting every step of the process.\n• Calibrate and maintain cultivation equipment.\n• Collaborate with the whole team (cultivation, processing and operations departments), working together to produce exceptional cannabis products.\n\nInternship Requirements:\n• Must be currently enrolled in a post-secondary institution, pursuing a degree in a related scientific field (biology, botany, chemistry, horticulture, agriculture, etc.).\n• Must be a Canadian citizen, permanent resident, or have been granted refugee status to qualify for internship funding.\n• Fully vaccinated against Covid-19, with proof of vaccination.\n• Local to the Edmonton area or possess reliable transportation for commuting.\n• Comfortable working in warm and humid cultivation spaces with bright lights, while wearing the required Personal Protective Equipment (PPE) provided.\n• Willing to wear personal protective equipment as necessary, including but not limited to sanitary clothing covers, gloves, mask, respirator, and/or eye protection.\n• Capable of performing physical activities and/or repetitive movements throughout shifts.\n• Comfortable with squatting, bending, and kneeling while utilizing tools and performing cleaning and maintenance tasks.\n• Lift and move objects weighing up to 50 lbs (22kg).\n\nJob Types: Full-time, Part-time, Internship / Co-op\nContract length: 4 months\n\nPay: From $15.50 per hour\n\nExpected hours: 16 – 40 per week\n\nBenefits:\n• Casual dress\n• Company events\n• Flexible schedule\n• On-site parking\n\nFlexible language requirement:\n• French not required\n\nSchedule:\n• 4 hour shift\n• 8 hour shift\n• Day shift\n\nApplication question(s):\n• Hybrid Infusions Ltd. requires all employees to be fully vaccinated against Covid-19 prior to entering the facility. Knowing this, would you like to proceed with this application?\n• To qualify for funding for this internship, you must currently be enrolled in a post-secondary program for winter 2025. Does this apply to you?\n• To qualify for funding for this internship you must be a Canadian citizen, permanent resident, or have been granted refugee status. Does this apply to you?\n\nWork Location: In person\n\nApplication deadline: 2024-12-20\nExpected start date: 2025-01-02",
            "job_is_remote": false,
            "job_posted_at": "18 hours ago",
            "job_posted_at_timestamp": 1733173200,
            "job_posted_at_datetime_utc": "2024-12-02T21:00:00.000Z",
            "job_location": "Edmonton, AB",
            "job_city": "Edmonton",
            "job_state": "Alberta",
            "job_country": "CA",
            "job_latitude": 53.5460983,
            "job_longitude": -113.49372659999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dh0EygNOyal75w-QCAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "27302200",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "M-WDYACgJyG0oV3vAAAAAA==",
            "job_title": "Software Developer Winter Co-op (Tech Start-up/ Social Health)",
            "employer_name": "Goodself",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSbiEeJrJsz_CK771lK_CZbYzKyfBIWxGS2rGnw&s=0",
            "employer_website": "https://www.goodself.com",
            "job_publisher": "SimplyHired",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://www.simplyhired.ca/job/WC7qI6HEXBFKA-6QkSpIDdkBEmcKm265htqVQPohi7g4jqACkuI3kA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/WC7qI6HEXBFKA-6QkSpIDdkBEmcKm265htqVQPohi7g4jqACkuI3kA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "About Us\n\nLaunched in the Fall of 2022, Goodself is on a mission to help people find and deliver relevant, trustworthy Health, Wellness, and Lifestyle information through a first-of-its-kind free social media app platform exclusively around Health, Wellness and Lifestyle. We are building an engaged community of Users that want to get better and can see others like them getting better, along with access to credible information through vetted Experts, across a variety of health topics. Please visit us at goodself.com for more information.\n\nStudent Software Developer Fall Co-op (Tech Start-up/Social Health) Job Description:\n\nWe are looking for a student currently enrolled in a STEM program to take part in a summer co-op/internship here at Goodself - a health/tech social media platform. The role would focus primarily on mobile app development using React Native, and various research responsibilities.\n\nResponsibilities would include:\n• Reviewing and understanding business requirements, functional and technical specifications, and programming accordingly.\n• Utilizing various system utilities, networking, and verification tools to diagnose and enhance system performance.\n• Ensuring all code is written, tested, and integrated with the rest of the project codebase and version control system.\n• Helping with troubleshooting operational data issues.\n• Researching industry trends and best practices and recommending which approaches will benefit the company.\n• Suggesting enhancements to software where applicable.\n• Participating in technical design discussions, demos, and daily stand-ups.\n\nPreference to candidates who are:\n• Currently enrolled in a computer science or computer engineering program.\n• Experienced with React Native mobile application development.\n• Have project experience in developing software in a team environment and strong analytical and problem-solving abilities.\n• Experience with multiple development languages is an asset.\n• Experience developing websites/mobile applications is an asset.\n\nProven ability to multi-task and work towards meeting pre-defined timelines, delivering quality work\n• Only applications through indeed will be considered.*\n\nJob Types: Full-time, Part-time, Fixed term contract\nContract length: 4 months\n\nPay: From $16.55 per hour\n\nBenefits:\n• Work from home\n\nSchedule:\n• Monday to Friday\n\nWork Location: In person",
            "job_is_remote": false,
            "job_posted_at": "9 hours ago",
            "job_posted_at_timestamp": 1733205600,
            "job_posted_at_datetime_utc": "2024-12-03T06:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DM-WDYACgJyG0oV3vAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15113400",
            "job_onet_job_zone": "3"
        },
        {
            "job_id": "fHuMv-HtV_nHKQZ0AAAAAA==",
            "job_title": "HR Strategic Projects Intern",
            "employer_name": "Equinix, Inc",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTvhR2sZBUd_JJT_m-Xf61dTZSReRZjRVcPsyiO&s=0",
            "employer_website": "http://www.equinix.com/",
            "job_publisher": "The Muse",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://www.themuse.com/jobs/equinixinc/hr-strategic-projects-intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": true,
            "apply_options": [
                {
                    "publisher": "The Muse",
                    "apply_link": "https://www.themuse.com/jobs/equinixinc/hr-strategic-projects-intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                }
            ],
            "job_description": "Who are we?\n\nEquinix is the world's digital infrastructure company®, operating over 260 data centers across the globe. Digital leaders harness Equinix's trusted platform to bring together and interconnect foundational infrastructure at software speed. Equinix enables organizations to access all the right places, partners and possibilities to scale with agility, speed the launch of digital services, deliver world-class experiences and multiply their value, while supporting their sustainability goals.\n\nA career at Equinix means you will collaborate on work that impacts the world and be surrounded by endless opportunities to learn new skills and grow in varied directions. We embrace diversity in thought and contribution and are committed to providing an equitable work environment that is foundational to our core values as a company and is vital to our success.\n\nHR Strategic Projects Intern\n\nWhy Join Equinix?\n\nWe pride ourselves on our Global Program being an immersive and impactful experience designed to kick start your corporate career and set you up for future success.\n• Work on real business challenges: You will be assigned with a project and work directly with teams to gain real-work experience, contribute to the business, and impact the digital world.\n• Be supported throughout your journey: You will be mentored and coached by numerous colleagues, including your managers, subject experts, an assigned buddy and a formal mentor.\n• Participate in a curated program of workshops and events: Learn from our leaders through our Executive Speaker Series, continue to grow through our workshops and build meaningful worldwide connections through our networking events.\n• Gain global recognition: We celebrate your time with Equinix and the work you have completed through our Global Ideas Competition \"Shark Tank.\" This competition provides you with the recognition you deserve and lets you share your work with the global community of Equinix.\n\nJoining our internship program means you will have a chance to secure a future role at Equinix when you graduate!\n\nOverview of Function, Team, and Role:\n\nTalent Consulting Services is a dynamic team of internal consultants who design and deliver strategic projects within Equinix Human Resources. Our team is comprised of specialists in Learning and Development, Change Management, Organizational Design and content creation. Working with project sponsors within HR and the business, our team designs and delivers unique solutions to ensure that key projects are successful across Equinix.\n\nThere are several ongoing priority projects that our team is supporting. The successful HR intern will be integrated into a project team and working with several of our team members as well as a project sponsor. Our ongoing projects for 2025 include the launch of a new performance management system, the delivery of a cultural transformation, and the implementation of an HR operating model.\n\nWho You Are (Requirements and Qualifications):\n• Must be currently enrolled in an accredited university/college, in your penultimate year of your bachelor's or master's degree studies (Graduation between December 2025-September 2026)\n• Available to work full-time for the entire duration of the Summer Internship Program (between May to September, depending on your school system)\n• Excellent written and verbal communication skills; experience developing and/or delivering large-scale communications is a plus\n• Ability to deliver effect presentations, and share information and ideas with others\n• Analytically driven and detail-oriented, with working knowledge of Microsoft Office Package.\n• Ability to analyze and interpret qualitative data; experience designing surveys is a plus\n• Ability to multi-task and work collaboratively and effectively in a fast-paced environment\n\nHow to Apply\n\nPlease submit your application by providing the following.\n• Up to date resume that includes your availability (start and end date) and expected graduation\n• Please apply to this job posting only if you are available full time for an internship during the stated period.\n\nWhat's next\n\nThe Equinix New to Career team will be reviewing applicants on a rolling basis throughout October and November and will reach out to applicants accordingly. We appreciate your patience while we consider your application. If you would like to learn about other career opportunities, we have to offer check out our careers page!\n• Learn more about the program and what former interns have to say about their experience - https://careers.equinix.com/students-recent-grads\n• Watch this video to learn more on how Equinix is powering the worlds digital infrastructure. https://youtu.be/aTTIbsfP8j0\n\nEquinix is committed to ensuring that our employment process is open to all individuals, including those with a disability. If you are a qualified candidate and need assistance or an accommodation, please let us know by completing this form.\n\nEquinix is an Equal Employment Opportunity and, in the U.S., an Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to unlawful consideration of race, color, religion, creed, national or ethnic origin, ancestry, place of birth, citizenship, sex, pregnancy / childbirth or related medical conditions, sexual orientation, gender identity or expression, marital or domestic partnership status, age, veteran or military status, physical or mental disability, medical condition, genetic information, political / organizational affiliation, status as a victim or family member of a victim of crime or abuse, or any other status protected by applicable law.",
            "job_is_remote": false,
            "job_posted_at": "4 hours ago",
            "job_posted_at_timestamp": 1733223600,
            "job_posted_at_datetime_utc": "2024-12-03T11:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DfHuMv-HtV_nHKQZ0AAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "11312100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "IcC1BQmRFzLni6zGAAAAAA==",
            "job_title": "Student",
            "employer_name": "Mithin Indo Foreign Group (CANADA)",
            "employer_logo": null,
            "employer_website": null,
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/student-at-mithin-indo-foreign-group-canada-3886228863?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/student-at-mithin-indo-foreign-group-canada-3886228863?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Python Jobs",
                    "apply_link": "https://pythonjob.xyz/job/2A7UOBQTrwDPZ0KJjYvIURpUDiA/Student?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Need Students for it who can Manage things. It is a Student Community and we are in need of someone who is active and can work. Must be capable to communicate easily without any barriers. Should be enough active, and it is work from home only.",
            "job_is_remote": false,
            "job_posted_at": "11 hours ago",
            "job_posted_at_timestamp": 1733198400,
            "job_posted_at_datetime_utc": "2024-12-03T04:00:00.000Z",
            "job_location": "Canada",
            "job_city": null,
            "job_state": null,
            "job_country": "CA",
            "job_latitude": 56.130365999999995,
            "job_longitude": -106.34677099999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DIcC1BQmRFzLni6zGAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "11903300",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "_eN4sbF0iYPiEsDLAAAAAA==",
            "job_title": "People Development & Employee Experience Co-op",
            "employer_name": "FortisBC",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQOqEmaJoGNWsPN_1kwfV0HZaM_vCxFJ_UyhX_Z&s=0",
            "employer_website": "http://www.fortisbc.com/",
            "job_publisher": "Indeed",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.indeed.com/viewjob?jk=2eff0c0cb29ac29e&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=2eff0c0cb29ac29e&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/FortisBC/Job/People-Development-&-Employee-Experience-Co-op/-in-Surrey,BC?jid=86770ab72c8b8b26&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/people-development-employee-experience-co-op-fortisbc-JV_IC4033126_KO0,44_KE45,53.htm?jl=1009550064601&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/people-development-employee-experience-co-op-at-fortisbc-4087453813?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://fr.simplyhired.ca/job/RZzyvaQPfvCJMYro_W0AjBh1DfjcSB_IBOC1FHZFPPJJmeCcAQkW5Q?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Branch: Gas\nAffiliation: MoveUP\nEmployment Status: Co-op Student\nSalary Min: $23.64 Hourly\nSalary Max: $28.36 Hourly\nShort-term Incentive Eligible: No\nWorkplace Flexibility: N/A – this is a unionized position\nTemp Duration: 4-8 months\nPosting End Date: Open until filled\n\nAs the province’s largest energy provider with more than 100 years of knowledge and experience, we proudly deliver renewable energy, natural gas, electricity and propane to 1.3 million customers.\n\nWe're actively seeking new talent to join our mission of transforming B.C.'s energy landscape. As one of BC's Top Employers with a diverse team of over 2,700 employees, we are committed to a safe and inclusive culture where each of us can connect, belong, and grow. Join us, and together, let's shape a brighter future for B.C.\n\nPosition Overview\n\nIf you’re looking for a co-op experience to advance your understanding of how the people development and experience team works under the human resources functionality, look no further! We have an opportunity within our People Development & Experience team to support meaningful work as we continue to cultivate talent through learning and development programming for individuals and leaders across the organization.\n\nReporting to the senior manager, people development, a co-op student is needed to join our People Development and Experience team and support our ongoing activities.\nThis opportunity is open to candidates in third year or higher of a university Program pursuing a co-op opportunity. The position headquartered in Surrey, B.C. is available to students pursuing a four- or eight-month placement. Throughout the duration of the work term, the successful candidate may be required to travel to our various worksite across the province.\n\nResponsibilities\n• Identify, curate, and recommend appropriate learning content to support individual learning plans.\n• Maintenance of LinkedIn learning license assignments and activation, as well as Franklin Covey All Access Pass license assignments.\n• Ordering and tracking program and workshop inventory, digital units, workbooks, guides and materials.\n• Review existing learning materials for updates, as part of our leadership and professional development program maintenance cycles.\n• Research future skills development related to leadership and professional development course planning.\n• Schedule stakeholder meetings as part of enterprise-wide training.\n• Pull and summarize post-course surveys.\n• Support review cycle of e-Learnings on design elements and user experience.\n• Assist with administrative tasks related to all in-person training sessions.\n• Support updates on HRIS SuccessFactors job aids.\n• Support with testing cycles on our HRIS SuccessFactors modules.\n• Pull LMS leadership and professional development training records for key reporting cycles.\n• Support with set-up and take down of workshop and classroom events.\n• Participate in team meetings, which includes facilitating a safety, wellness or learning moment.\n• Inputting new and maintaining existing course information on learning management system, team calendar and events page on intranet.\n• Assisting the team with administrative duties and support day-to-day operations.\n• Work from our corporate office in Surrey, two to three days per week.\n\nRequirements\n\nThis opportunity is best suited for an enthusiastic candidate who must be enrolled in a recognized post-secondary institution third year or higher program with a preferred course study in Human Resources, Education, or related degree, with the intent to return to school after the co-op work term. Minimum GPA of 3.0 is a must.\n\nOther Qualifications\n• Proficiency in Word, Excel, Outlook, and PowerPoint, with experience in Adobe Creative Suite required.\n• Strong writing skills is an asset.\n• Asset if has experience using software applications related to instructional design, such as Articulate Storyline, Camtasia\n• Strong initiative, organization and project management skills.\n• An ability to work independently under minimal supervision.\n• Strong interpersonal skills with the ability to interact with people throughout the company.\n• Demonstrated ability to work effectively in a team environment.\n• Strong communications, planning and organizational skills.\n• Strong research capabilities.\n• Ability to quickly learn processes, identify and organize relevant information and work independently.\n• Creative thinking with strong skills in the use of business analysis and project management.\n\nFortisBC acknowledges and respects Indigenous Peoples in Canada, on whose Traditional Territories we all live and work. FortisBC is committed to Reconciliation with Indigenous Peoples and is guided by our Statement of Indigenous Principles.",
            "job_is_remote": false,
            "job_posted_at": "16 hours ago",
            "job_posted_at_timestamp": 1733180400,
            "job_posted_at_datetime_utc": "2024-12-02T23:00:00.000Z",
            "job_location": "Surrey, BC",
            "job_city": "Surrey",
            "job_state": "British Columbia",
            "job_country": "CA",
            "job_latitude": 49.191346599999996,
            "job_longitude": -122.8490125,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D_eN4sbF0iYPiEsDLAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": "HOUR",
            "job_highlights": {},
            "job_onet_soc": "11313100",
            "job_onet_job_zone": "4"
        }
    ]
}