{
    "status": "OK",
    "request_id": "1d3c74c4-68cb-4064-95f2-94c7eef74f44",
    "parameters": {
        "query": "intern jobs canada",
        "page": 1,
        "num_pages": 3,
        "date_posted": "today",
        "country": "ca",
        "language": "en"
    },
    "data": [
        {
            "job_id": "JuLyMP6B6jt_fwh3AAAAAA==",
            "job_title": "People Operations Intern",
            "employer_name": "AppDirect",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQxd7XNp4m44BH5I9JRSr9WLc5mehfCvzWeQKf3&s=0",
            "employer_website": "https://www.appdirect.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/people-operations-intern-at-appdirect-4088323134?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/people-operations-intern-at-appdirect-4088323134?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=a61b49c85c354b5b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/s_iPBn5_5vwGIpjMYRrjcKhScPNarq-Bvi3EqeDJ2SnfYesHqLoHaQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Built In",
                    "apply_link": "https://builtin.com/job/people-operations-intern/3639239?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "About AppDirect\n\nBecome a digital, global citizen and enable the new generation of digital entrepreneurs around the world. AppDirect offers a subscription commerce platform to sell any product, through any channel, on any device - as a service. We power millions of subscriptions worldwide for organizations. We do this by our values-driven culture—one that enables you to Be Seen, Be Yourself, and Do Your Best Work.\n\nAbout You\n\nAre you passionate about human resources and eager to dive into it? We're looking for a dynamic and detail-oriented individual to join our HR Operations team as a People Operations Intern. This role is perfect for someone who is currently enrolled in a Bachelor's degree program with a specialization in Human Resources. You will get hands-on experience in the day-to-day operations of the HR department, learn from seasoned HR Operations Coordinators, and have the chance to contribute to new HR projects. If you are driven, enthusiastic, and ready to make an impact in a fast-paced, collaborative environment, we want to hear from you!\n\nPlease note that this is a full-time internship starting in January (40 hours per week).\n\nWhat you’ll do and how you’ll have an impact\n• Assist with new hire onboarding including coordinating with various departments and teams to ensure an amazing employee experience;\n• Support our global new hires in answering People team process and system related questions;\n• Assist the People Operations Coordinators by updating our HRIS and other systems with accurate and timely data;\n• Maintain employee files, ensuring they adhere to compliance standards;\n• Confirm all employee documents are completed accurately and in a timely manner (tax forms, employee handbook, confidentiality agreement, code of conduct, etc);\n• Support the People Operations Coordinators with completing employee offboarding tasks;\n• Support our HR (Jira) ticketing system by triaging incoming requests and responding to Tier 1 support tickets;\n• Assist with updating internal team documentation and processes, and maintaining HR Confluence pages;\n• Participate in learning and communications related projects and initiatives such as updating new hire resources and supporting training logistics;\n• Possibility to help with other HR functions or projects such as Benefits & Payroll.\n\nWhat We’re Looking For\n• Currently enrolled in a Business or HR related undergraduate program;\n• Must have completed at least one internship in Human Resources;\n• Ability to maintain the utmost of discretion and confidentiality with employee data and matters at all times;\n• Excellent organization & communication skills;\n• Strong attention to detail;\n• Ability to work both independently and as part of a team;\n• Willingness and flexibility to work with a global team;\n• Experience with systems and tools including G Suite (Sheets, Docs, Slides), Confluence, Atlassian Jira, HRIS (Workday).\n\nAt AppDirect, we believe that innovation thrives in an environment that houses diversity of excellence, experience and thought. We respect each AppDirector as their own fingerprint; unique with no one alike. We foster an environment of inclusion without regard to race, religion, age, sexual orientation, or gender identity enabling AppDirectors to embrace their uniqueness to do their best work. As such, we strongly encourage applications from Indigenous peoples, racialized people, people with disabilities, people from gender and sexually diverse communities, and/or people with intersectional identities.\n\nAt AppDirect we take privacy very seriously. For more information about our use and handling of personal data from job applicants, please read our Candidate Privacy Policy. For more information of our general privacy practices, please see AppDirect Privacy Notice: https://www.appdirect.com/about/privacy-notice",
            "job_is_remote": false,
            "job_posted_at": "16 hours ago",
            "job_posted_at_timestamp": 1732921200,
            "job_posted_at_datetime_utc": "2024-11-29T23:00:00.000Z",
            "job_location": "Calgary, AB",
            "job_city": "Calgary",
            "job_state": "Alberta",
            "job_country": "CA",
            "job_latitude": 51.044733099999995,
            "job_longitude": -114.0718831,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DJuLyMP6B6jt_fwh3AAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "55301800",
            "job_onet_job_zone": null
        },
        {
            "job_id": "w_u0nICK2x6m0U15AAAAAA==",
            "job_title": "DATA SCIENCE INTERN - REMOTE",
            "employer_name": "New iTalent Digital",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR4gTbewskuN0v0rCcQyLfq00jDqWv4lSSCVicA&s=0",
            "employer_website": null,
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/data-science-intern-remote-at-new-italent-digital-4085023763?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/data-science-intern-remote-at-new-italent-digital-4085023763?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "DATA SCIENCE INTERN - REMOTE\n\nThis is your chance to start a lifelong career with endless opportunity. Find the liberty you've been looking for by taking a moment to complete our online application.\n\nBenefits:\n• Excellent weekly pay\n• Safe work environment\n• Multiple shifts are readily available from morning to night and no experience is needed.\n• You will have ample opportunity for growth\n• Part-time available - select the days you want to work\n• A commitment to promote from within\n\nResponsibilities:\n• Must have the ability to perform tasks with or without sensible accommodation\n• Perform all other duties as appointed\n• Assist in developing a positive, professional and safe work environment\n\nQualifications:\n• No experience, Willing to train\n• Ability to work within recognized turnaround times\n• Must have excellent interpersonal skills and the ability to arrange simultaneous tasks\n• Ability to translate and use company policies and procedures\n• Excellent verbal and written communication skills\n• Ability to work both independently and within a team environment\n• Ability to stay organized, give attention to detail, follow guidelines and multi-task in a professional and efficient way",
            "job_is_remote": false,
            "job_posted_at": "22 hours ago",
            "job_posted_at_timestamp": 1732899600,
            "job_posted_at_datetime_utc": "2024-11-29T17:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dw_u0nICK2x6m0U15AAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "MsZb38t26bY7C2vGAAAAAA==",
            "job_title": "Calgary Internship, Management Consulting Consultant May 2025",
            "employer_name": "KPMG Canada",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR6ggQxzGsF1zU9tfOdsmR__ZbBIzezk9C-R6mk&s=0",
            "employer_website": null,
            "job_publisher": "KPMG Canada Careers",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://careers.kpmg.ca/students/jobs/26516?lang=en-us&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": true,
            "apply_options": [
                {
                    "publisher": "KPMG Canada Careers",
                    "apply_link": "https://careers.kpmg.ca/students/jobs/26516?lang=en-us&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                }
            ],
            "job_description": "Overview\n\nPlease note that you are limited to one application uring the recruitment period as we ask you to think ahead of what office and service line you are most interested in. This position is for a 4-month intern/co-op term.  \n\nAt KPMG in Canada, you’ll join a team of diverse and dedicated problem solvers, connected by a common cause: turning insight into opportunity for clients and communities around the world.  \n\nDo work that matters, supported by a community that values difference and cares about you. Gain learning that’ll last you a lifetime and be recognized for the impact you make. With a focus on encouraging employees to come as they are, KPMG provides its employees with a variety of unique tools and support systems that ensure they thrive and make their mark in their career and in their communities. \n\nThe opportunity:\n\nWe are seeking talented and energetic candidates to join our Advisory, Management Consulting team as a 4-month Consultant intern/co-op working in our Calgary practice starting in Summer (May to August) 2025. Positions are available in the following service lines:\n• People & Change\n• Finance Transformation\n• Supply Chain\n• Technology Strategy and Transformation\n• Enterprise Solutions\n\nWhat you will do\n\nPeople and Change\nPeople & Change consulting is a fast-growing business. Our people gain knowledge and experience in diverse domains of human capital, such as Workforce Transformation, Organizational Design, Learning & Development, Change Management, and others, applied in a range of workplace environments and business contexts. We advance our client’s business performance by helping to shape and navigate the important people dynamics related to the transformation of work, capabilities, and behaviours. With experience in all industries, as well as both the private and public sectors, our People and Change practice helps organizations drive value and enhance success by optimizing their talent agenda and activating their most valuable resource, their people. The culture of our team is collegial, inclusive, and supportive. We are a tight-knit group, working together across local and national lines.\n\nFinance Transformation\nKPMG’s Finance Transformation Advisory Practice helps organizations maximize efficiencies and drive business value across the enterprise. We help our clients to strengthen and transform their finance/accounting operations by improving transparency, information integrity and governance to increase profitability and drive business insights. With a global network of professionals working in KPMG member firms around the world, Finance Transformation collaborates closely with CFOs and other finance/accounting leaders and empowers them to become insightful business partners. We focus on a variety of areas surrounding our “Finance of the Future” vision to drive strategy and implementation across finance/accounting operations optimization, target operating model design, finance technology selection and technology enabled transformation, and regulatory compliance transformation. We are trusted advisors in budgeting, forecasting, period close/consolidation, project accounting, managerial accounting, reporting and analytics, and all other areas of finance transformation including ERP & EPM systems.\n\nProcurement & Supply Chain Solutions\nKPMG’s Procurement and Supply Chain Solutions understands the complexities of designing and managing supply chains, and our strategic business approach helps create and sustain bottom-line value across the extended supply chain -- from suppliers to customers. We help our clients to strengthen and transform their Procurement and Supply Chain functions by improving transparency, information integrity and governance to increase profitability and drive business insight. The Procurement and Supply Chain service includes various aspects such as S2P Strategy and Transformation, e-Procurement selection and implementation, P2P/S2C diagnostics, Supply & Demand Planning, Inventory Management Review and Design, Technology Strategy and Solution Design. We are trusted advisors in all areas of Procurement and Supply Chain design, including data analytics & visualization and technology architecture across various industries (i.e. Mining, O&G, Utilities, Retail, Construction, etc.)\n\nTechnology Strategy and Transformation\nKPMG's Technology Strategy and Transformation service is a part of their Management Consulting practice. It is designed to help businesses align their technology capabilities with their strategic and operational objectives. This service provides guidance on how to leverage technology to transform business operations, improve performance, and create value. The Technology Strategy and Transformation service includes various aspects such as IT strategy development, IT cost optimization, IT architecture and solutions design, digital and emerging technology solutions, IT service management, and IT sourcing and procurement. The goal is to help organizations make informed decisions about technology investments and deployments, and to manage the risks associated with these decisions.\n\nEnterprise Solutions \nEnterprise Solutions has many pillars such as Microsoft, Oracle, SAP, Salesforce, ServiceNow and Workday. Our practice works to bring expertise in services covering end to end system implementations and technology transformations. We recognize that the technology landscape is rapidly changing; our practice stays ahead by embracing innovation and industry guiding solutions to transform businesses. Our team is deeply experienced in the full range of technological challenges, from complex transformations to innovative technologies and architectures.\n\nWhat’s in it for you:\n\nInterns & Co-op Students\n\nOur Intern and Co-op program aims to develop the next generation of leaders through challenging and interesting work. During your term, you will gain authentic engagement experience working with client projects across our teams. Along the way, you will broaden your skill set through KPMG’s vast learning and development opportunities that you can take on to your future career.\n\nThe national Power Up programming will also provide you with opportunities to learn from our leaders, build a network with other student hires through social events, collaborate\n\n.\n\nWhat you bring to the role\n\nFor Consultant Level:\n• You are enrolled in a university degree program (we will be considering candidates from a spectrum of programs such as Science, Mathematics, Engineering, Computer Science, Business, Commerce, Arts, etc.) \n• You are currently in your second, or third year of study \n• You are a highly motivated individual, enthusiastic about taking on a variety of obstacles and opportunities \n• You have excellent communication skills, both written and verbal  \n• You have a strong academic record  \n• You have the ability to work independently without supervision, and to work well in a team. \n• You have strong problem solving and analytical abilities, as well as a proven track record of successfully dealing with multiple priorities and deadlines under pressure  \n• You have a strong sense of personal accountability  \n• You have an entrepreneurial drive, and are a creative problem solver\n\nHow you will succeed:\n• You build collaborative relationships: Establishes strong relationships internally and externally and builds wide and productive networks\n• You develop and motivate others: Engages others, instils confidence, and coaches people to find meaning in their work and achieve exceptional results\n• You take opportunities to learn and adapt: Uses insights and self-reflection to build capability and embrace new challenges\n• You drive quality: Delivers high-quality results and exceptional service that provide value\n• You foster innovation: Embraces a culture of innovation and experimentation to create value\n\nProviding you with the support you need to be at your best\n\nTo learn more about how you can thrive with us at the firm, explore life at KPMG in Canada!\n\nHow to apply:\n\nStart your journey and make your mark with KPMG today!\n\nPlease apply directly to KPMG at Students - KPMG Canada (home.kpmg).\n\nAll applications must be received no later than January 5th, 2025, 23:55 Mountain Time\n\nFeeling a little overwhelmed with the application process? Don’t worry – we've got you covered! Check out our resume and interview tips available over at our Application Journey page!\n\nWhat is required for this application process:\n• Please be noted that this position is located in Calgary for the duration of the internship and relocation expenses will not be reimbursed.\n• Applications can be addressed to “Hiring Manager” and should include a cover letter, resume, and a copy of your most recent unofficial transcript. If you do not have access to an electronic copy of your transcript, we ask that you attach a screenshot of your grades from your school’s website.\n• All considered applicants must have or will obtain legal authorization to work in Canada by the start date of employment.\n\nIf you experience any difficulties with the online system, please contact\nca-fmcandidateexpcoe@kpmg.ca.\n\nOur Values, The KPMG Way\n\nIntegrity, we do what is right | Excellence, we never stop learning and improving | Courage, we think and act boldly | Together, we respect each other and draw strength from our differences | For Better, we do what matters\n\nKPMG in Canada is a proud equal opportunities employer and we are committed to creating a respectful, inclusive and barrier-free workplace that allows all of our people to reach their full potential. A diverse workforce is key to our success and we believe in bringing your whole self to work. We welcome all qualified candidates to apply and hope you will choose KPMG in Canada as your employer of choice. For more information about Inclusion, Diversity & Equity in Recruitment, please click here.\n\nAdjustments and accommodations throughout the recruitment process\n\nAt KPMG, we strive for an inclusive recruitment process that allows all candidates to Come As You Are and Thrive with Us. We aim to provide a positive experience and are ready to offer adjustments or accommodations to help you perform at your best. Adjustments (an informal request), i.e. extra preparation time or the option for micro breaks during interviews, and accommodations (a formal request), i.e. accessible communication supports or technology aids are tailored to individual needs and role requirements.\n\nTo begin a confidential conversation about adjustments or accommodations at any point throughout the recruitment process, we encourage you to contact KPMG’s Employee Relations Service team for support by emailing cdnersteam@kpmg.ca or by calling 1-888-466-4778, Option 3.\n\nFor information about accessible employment at KPMG, please visit our accessibility page.",
            "job_is_remote": false,
            "job_posted_at": "14 hours ago",
            "job_posted_at_timestamp": 1732928400,
            "job_posted_at_datetime_utc": "2024-11-30T01:00:00.000Z",
            "job_location": "Calgary, AB",
            "job_city": "Calgary",
            "job_state": "Alberta",
            "job_country": "CA",
            "job_latitude": 51.044733099999995,
            "job_longitude": -114.0718831,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DMsZb38t26bY7C2vGAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "19309400",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "pSzkW7FPtnVSq_BmAAAAAA==",
            "job_title": "Stagiaire I",
            "employer_name": "TD",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTUCRQGyfQQWMklc_hp70-Qnb8wLa8RcMTHbXM4&s=0",
            "employer_website": null,
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/stagiaire-i-at-td-4085201172?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/stagiaire-i-at-td-4085201172?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Type De Rôle\n\nInternship/Co-op\n\nSession De Stage\n\nSummer/Term 3\n\nLieu De Travail\n\nStratford, Ontario, Canada\n\nHoraire\n\n37.5\n\nDétails De La Rémunération\n\n$44,000 - $61,950 CAD\n\nLa TD a à cœur d’offrir une rémunération juste et équitable à tous les collègues. Les occasions de croissance et le perfectionnement des compétences sont des caractéristiques essentielles de l’expérience collègue à la TD. Nos politiques et pratiques en matière de rémunération ont été conçues pour permettre aux collègues de progresser dans l’échelle salariale au fil du temps, à mesure qu’ils s’améliorent dans leurs fonctions. Le salaire de base offert peut varier en fonction des compétences et de l’expérience du candidat, de ses connaissances professionnelles, de son emplacement géographique et d’autres besoins particuliers du secteur et de l’entreprise.\n\nEn tant que candidat, nous vous encourageons à poser des questions sur la rémunération et à avoir une conversation franche avec votre recruteur, qui pourra vous fournir des détails plus précis sur ce poste.\n\nDescription Du Poste\n\nTD Commercial Banking provides financial solutions to North American businesses. Our broad range of products and services allows us to meet the needs of our clients in every sector, providing customized solutions to build a strategy that’s right for them now, and in the future. Our quest is to deliver a first-class business banking client experience and to be \"The Better Business Bank” in North America. At TD, better business bankers have a strong background in business and finance as well as the specific products they are responsible to sell and service. They have keen insight into all their clients – their industry, products, finances, and markets. Better business bankers demonstrate good judgment in people, businesses and markets based on education, experience, “gut instincts” and “street smarts”.\n\nAgriculture Services is seeking individuals interested in developing a career as an Associate within the agricultural business. In this unique position, you will partner with an experienced and knowledgeable Account Manager.\n\nYou will be provided with a coach and guidance as you take part in an intensive training and development program within our Agriculture Services, Business Banking.\n\nJob Requirements\n• You are working towards an undergraduate degree in Agricultural Sciences/Agriculture business or in another discipline that's combined with experience or knowledge of the agriculture business.\n• You demonstrate interest and ability in selling to and negotiating with agricultural clients.\n• You are also a motivated achiever with good analytical skills and very strong interpersonal skills and can work well independently in addition to being a strong team player.\n• You’re a well-rounded person who works well independently and as part of a team.\n• You have a strong desire to learn, grow and succeed.\n\nWhere You’re Going\n\nYour first 6-8 months will include on-site coaching in one of our commercial units, as well as a structured training program before moving up to become an Account Manager or Credit Analyst on a team with a Relationship Manager. Your future career path in TD Ag. Banking can include a variety of challenging roles in sales, relationship management, and risk management.\n\nFull mobility is required for this program.\n\nÀ propos de nous\n\nLa TD est un chef de file mondial dans le secteur des institutions financières. Elle représente la cinquième banque en Amérique du Nord de par son nombre de succursales. Chaque jour, nous offrons une expérience client légendaire à plus de 27 millions de ménages et d’entreprises au Canada, aux États-Unis et partout dans le monde. Plus de 95 000 collègues de la TD mettent en commun leurs compétences, leur talent et leur créativité au service de la Banque, des clients qu’elle sert et des économies qu’elle appuie. Nous sommes guidés par notre vision d’être une meilleure banque et par notre objectif d’enrichir la vie de nos clients, de nos collectivités et de nos collègues.\n\nLa TD est une entreprise profondément engagée à être une leader en matière d’expérience client. Voilà pourquoi nous croyons que chaque collègue, peu importe son secteur d’activité, est en contact avec la clientèle. En parallèle de l’évolution de nos activités et de notre stratégie, nous innovons afin d’améliorer l’expérience client et de créer des capacités pour façonner l’avenir des services bancaires. Que vous ayez plusieurs années d’expérience dans le secteur bancaire ou que vous commenciez tout juste votre carrière dans le domaine des services financiers, nous pouvons vous aider à réaliser votre plein potentiel. Vous pourrez compter sur nos programmes de formation et de mentorat et sur des conversations sur le perfectionnement et le leadership pour réaliser votre plein potentiel et atteindre vos objectifs. Notre croissance en tant qu’entreprise rime avec la vôtre.\n\nNotre programme de rémunération globale\n\nNotre programme de rémunération globale reflète les investissements que nous faisons pour aider nos collègues et leur famille à atteindre leurs objectifs en matière de bien-être mental, physique et financier. La rémunération globale à la TD inclut le salaire de base, la rémunération variable et bien d’autres régimes clés, comme des avantages sociaux en matière de santé et de bien-être, des régimes d’épargne et de retraite, des congés payés, des avantages bancaires et des rabais, des occasions de développement de carrière et des programmes de récompenses et reconnaissance. En savoir plus\n\nRenseignements Supplémentaires\n\nNous sommes ravis que vous envisagiez une carrière à la TD. Sachez que nous avons à cœur d’aider nos collègues à réussir dans leur vie tant personnelle que professionnelle. C’est d’ailleurs pourquoi nous leur offrons des conversations sur le perfectionnement, des programmes de formation et un régime d’avantages sociaux concurrentiel.\n\nPerfectionnement des collègues\n\nUn cheminement professionnel particulier vous intéresse ou vous cherchez à acquérir certaines compétences? Nous tenons à vous mettre sur la voie de la réussite. Vous aurez des conversations régulières sur le développement de carrière, le perfectionnement et le rendement avec votre gestionnaire. Une variété de programmes de mentorat et une plateforme d’apprentissage en ligne seront également à votre disposition pour vous aider à ouvrir de nouvelles portes. Que vous ayez à cœur d’aider les clients et souhaitiez élargir votre expérience ou que vous préfériez coacher et inspirer vos collègues, sachez que la TD propose un grand nombre de cheminements professionnels et qu’elle s’engage à vous aider à relever les occasions qui vont dans le sens de vos objectifs.\n\nFormation et intégration\n\nNous tenons à nous assurer que vous disposez des outils et ressources nécessaires pour réussir à votre nouveau poste. Dans cette optique, nous organiserons des séances d’intégration et de formation.\n\nProcessus d’entrevue\n\nNous communiquerons avec les candidats sélectionnés pour planifier une entrevue. Nous ferons notre possible pour communiquer par courriel ou par téléphone avec tous les candidats pour leur faire part de notre décision.\n\nMesures d’adaptation\n\nL’accessibilité est importante pour nous. N’hésitez pas à nous faire part de toute mesure d’adaptation (salles de réunion accessibles, sous-titres pour les entrevues virtuelles, etc.) dont vous pourriez avoir besoin pour participer sans entraves au processus d’entrevue.\n\nNous avons hâte d’avoir de vos nouvelles!\n\nExigences Linguistiques (Québec Seulement)\n\nSans Objet",
            "job_is_remote": false,
            "job_posted_at": "20 hours ago",
            "job_posted_at_timestamp": 1732906800,
            "job_posted_at_datetime_utc": "2024-11-29T19:00:00.000Z",
            "job_location": "Stratford, ON",
            "job_city": "Stratford",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.3700007,
            "job_longitude": -80.9822286,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DpSzkW7FPtnVSq_BmAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "43405100",
            "job_onet_job_zone": "2"
        },
        {
            "job_id": "QPU8vwr1AAYKWPuQAAAAAA==",
            "job_title": "Sales and Marketing Intern (Student)",
            "employer_name": "Greeny's Pest Control Inc.",
            "employer_logo": null,
            "employer_website": "https://www.greenyspestcontrol.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/sales-and-marketing-intern-student-at-greeny-s-pest-control-inc-4082675901?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/sales-and-marketing-intern-student-at-greeny-s-pest-control-inc-4082675901?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Recruit.net",
                    "apply_link": "https://www.recruit.net/job/sales-marketing-jobs/A01AD711385800AF?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "WhatJobs",
                    "apply_link": "https://en-ca.whatjobs.com/job/Bilingual-Sales-Intern/ontario/81584372?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "2025 Sales and Marketing Intern (Student)\n\nCompany Description\n\nGreeny's Pest Control aims to prevent pest issues before they start by providing effective pest control treatments for home owners and business owners alike. Our company believes that an integrated pest management program is crucial for a clean and healthy space. Servicing Southern/Central Ontario since 2021, Greeny's pest control is rapidly growing its customer base across the province. With an emphasis on eco-friendly pest control methods, we aim to eliminate pest issues while ensuring sustainability for the environment.\n\nRole Description\n\nWe are seeking a motivated individual (preferably student) to fill our Sales and marketing internship position. This role is a hybrid position with 15-20 hours of in person work per week (May-August) with sales commisions on top. The responsibilities include managing inbound sales inquiries, scheduling appointments, providing customer support for existing customers, generating reviews and testimonials, assisting with marketing activities such as neighbourhood flyer delivery etc.\n\nWhat We Offer\n• Hourly pay: $20/hour for in person marketing activities such as flyer delivery, networking events, trade shows etc.\n• Commission structure: 15% commission on inbound sales with the opportunity to earn additional marketing bonuses\n• Comprehensive training: Interns will receive ongoing sales training, one-on-one coaching, 24/7 sales support etc.\n• Earnings growth: Interns have the opportunity to benefit from our growing brand reputation and should see an increase in their earnings over time as a result. Our Interns can expect to earn anywhere from $10,000-$20,000 over the course of their first summer.\n\nWhat We're looking for\n• Self motivated and eager to learn\n• Great interpersonal skills\n• Driven by personal and professional growth\n• Positive attitude\n\nWhy Choose Greeny's for Your Sales & Marketing Internship?\n• Practical business experience: Learn the sales & marketing skills required for growing a successful business\n• Personal growth: Challenge yourself, build confidence & become a great communicator\n• Networking: Join a team of young ambitious entrepreneurs\n• Flexibility: Interns may be given the opportunity to continue the remote sales portion throughout their school semester based on performance\n\nQualifications\n• Sales/Marketing Experience Not Required But Considered a Bonus\n• Customer Service, Communication, and Customer Experience Skills\n• Customer Support skills\n• Excellent Interpersonal and Communication Skills\n• Ability to Work Independently and Within a Team Setting\n• Networking Skills",
            "job_is_remote": false,
            "job_posted_at": "21 hours ago",
            "job_posted_at_timestamp": 1732903200,
            "job_posted_at_datetime_utc": "2024-11-29T18:00:00.000Z",
            "job_location": "Ontario",
            "job_city": null,
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 51.253775,
            "job_longitude": -85.323214,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DQPU8vwr1AAYKWPuQAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13116100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "BQHUCcyzsSvADHebAAAAAA==",
            "job_title": "Environment Health & Safety Intern",
            "employer_name": "Husky Technologies",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQZxUdLVM3Y3N5nYfBZwVyfHWEODitAvylTvAkr&s=0",
            "employer_website": "https://www.husky.co",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/environment-health-safety-intern-at-husky-technologies-4088192969?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/environment-health-safety-intern-at-husky-technologies-4088192969?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Description\n\nTitle: Environment Health & Safety Intern\n\nId: 19069\n\nType: FullTime\n\nLocation: Bolton\n\nHusky TechnologiesTM a company with a strong foundation built on innovation, close customer relationships, a strong sense of community and a unique culture and values. We are looking for people with the inspiration and talent to develop with us as we pursue our ambitious growth strategy.\n\nHusky TechnologiesTM offers a wealth of opportunity for personal growth and development. Most importantly, Husky Technologies TM offers an opportunity to work with – and be challenged by – a team of great people. Our success is possible because of the creativity, intelligence and passion of our people around the world and their desire to lead change. At the same time, we are not afraid to expect a lot and strive for leadership in all of our key markets. We are a company taking on new challenges and for the right people this means exceptional career development opportunities, the chance to be part of a team that is the best in the world at what we do and the experience that comes from working in an environment that demands constant transformation and innovation.\n\nHusky TechnologiesTM Canadian manufacturing facilities and global headquarters are located in Bolton, Ontario on a large, beautiful campus located just 20 minutes north of Toronto’s Pearson International Airport. Features include a fitness and wellness center, intramural sports activities, on-site cafeteria, and clean, state-of-the-art manufacturing facilities with outstanding safety records. We offer a great work environment and competitive total compensation package, including above market retirement savings plan and market competitive group benefits.\n\nHusky TechnologiesTM is an exciting company with tremendous potential. We have a great team and great expectations. If you are attracted to bold goals, believe in uncompromising honesty, support mutual respect, care about environmental responsibility, have a passion for excellence and a desire to make a positive contribution – then we want you to join the Husky TechnologiesTM team!\n\nThe EHS Intern will support the Environmental, Health, and Safety team in promoting a safe and healthy work environment. This role involves assisting in the implementation of safety programs, conducting inspections, and helping with compliance initiatives. The intern will gain hands-on experience in various aspects of EHS management, contributing to the overall safety and environmental objectives of the organization.\n\nKey Responsibilities\n• Safety Inspections: Assist in conducting regular safety inspections of the facility to identify potential hazards and ensure compliance with safety regulations and Husky policies.\n• Data Collection and Analysis: organize, and analyze data related to chemicals and environmental impacts.\n• Training Support: Help in the development and delivery of EHS training programs for employees. Maintain records of training sessions and track employee certifications.\n• Compliance Assistance: Support the EHS team in ensuring the organization complies with local, state, and federal environmental and safety regulations. Assist with the preparation of documentation for audits and inspections.\n• Environmental Monitoring: Assist in environmental monitoring activities, such as air quality testing, waste management, and water sampling. Help in tracking and reporting environmental performance metrics.\n• Project Support: Work on special EHS projects as assigned, which may include developing safety communications and improving safety processes.\n• Administrative Tasks: Perform various administrative duties, including maintaining EHS records, filing reports, and organizing safety committee meetings.\n\nQualifications\n• Education: Currently pursuing a degree in Environmental Science, Occupational Health and Safety, Engineering, or a related field.\n• Knowledge: Basic understanding of EHS principles, regulations, and best practices.\n• Strong analytical and problem-solving skills.\n• Proficient in Microsoft Office Suite (Word, Excel, PowerPoint).\n• Excellent written and verbal communication skills.\n• Attention to detail and organizational skills.\n• Ability to work both independently and as part of a team.\n• Willingness to learn and take on new challenges.\n• Strong commitment to promoting a safe and healthy workplace.\n\nBenefits\n• Experience: Gain hands-on experience in EHS management in a professional setting.\n• Mentorship: Work closely with experienced EHS professionals and receive guidance throughout the internship.\n• Networking: Opportunities to connect with professionals in the EHS field.\n\nHusky TechnologiesTM offers a competitive compensation and benefits package and excellent opportunities for growth and advancement. We are committed to equal employment opportunity and respect, value and welcome diversity in our workplace. Husky Technologies TM also values being a great place to work and strives to maintain a safe workplace. Accordingly, Husky TechnologiesTM conditions all offers of employment on satisfactory completion of background checks.\n\nHusky TechnologiesTM is committed to developing inclusive, barrier-free selection processes and work environments. If contacted in relation to a job opportunity or testing, you should advise the member of the Talent Acquisition team in a timely fashion of any disabilities that requires accommodation measures in order to enable you to be assessed in a fair and equitable manner.\n\nInformation received relating to accommodation measures will be addressed confidentially.\n\nNo agency or telephone inquiries please.",
            "job_is_remote": false,
            "job_posted_at": "19 hours ago",
            "job_posted_at_timestamp": 1732910400,
            "job_posted_at_datetime_utc": "2024-11-29T20:00:00.000Z",
            "job_location": "Bolton, ON",
            "job_city": "Bolton",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.874199499999996,
            "job_longitude": -79.7306602,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DBQHUCcyzsSvADHebAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "29901100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "E5MzbaC56PSWZG6SAAAAAA==",
            "job_title": "Marketing Specialist - Internship",
            "employer_name": "Mississauga Secondary Academy",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSdKHy_FbCC4p8k5zW-jAOwGQuplo1Gl6Ehwx1A&s=0",
            "employer_website": null,
            "job_publisher": "Indeed",
            "job_employment_type": "Full-time and Part-time",
            "job_employment_types": [
                "FULLTIME",
                "PARTTIME"
            ],
            "job_apply_link": "https://ca.indeed.com/viewjob?jk=3aa4a9b57853066a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": true,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=3aa4a9b57853066a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/marketing-specialist-internship-mississauga-secondary-academy-JV_IC2280741_KO0,31_KE32,61.htm?jl=1009546063369&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.com/job-listing/marketing-specialist-internship-mississauga-secondary-academy-JV_IC2280741_KO0,31_KE32,61.htm?jl=1009546063369&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://fr.simplyhired.ca/job/QyzMB4qmM9Wm_SwR0UC_n3l9PE54BXE-EQb3qhBkTkeZTk9Hmb3ECQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Responsibilities: As a representative of our school, you will act as an external agent, presenting the school to potential students and parents to drive inquiries and enrollments. Your role will involve creating methods to attract prospective students, answering their queries, and assisting them with the registration process.\n\nKey Responsibilities:\n• Promote MSA's business through advertising efforts, including posting posters.\n• Develop flyers and social media content for the school.\n• Utilize email and mobile marketing to follow up with prospective students.\n• Coordinate the graphics and content needed for proposals, social media, and external promotions.\n• Manage and optimize digital marketing campaigns, including SEO, social media, email marketing, and content marketing.\n• Translate marketing communications into multiple languages.\n• Regularly liaise with printers and distributors to print and distribute marketing communications.\n• Oversee all design requirements for the school, including student and school brochures and photos.\n• Review the inquiry system to attract potential students and sort through inquiries to contact them.\n• Plan and coordinate events, functions, and meetings.\n• Coordinate with cross-functional teams, including admissions, and administration, to ensure consistent messaging and branding.\n• Report on weekly KPI’s.\n\nExperience:\n• Minimum of 2 years of experience in marketing, advertising, or a related field.\n• Proven track record of managing and executing successful marketing campaigns.\n\nQualifications:\n\n· Bachelor's degree in Marketing, Business, or a related field.\n\n· 2+ years of experience in a marketing role.\n\n· Proficiency in digital marketing tools and platforms\n\n· Experience with graphic design tools (Adobe Creative Suite, Canva, etc.).\n\n· Expert in business equipment and computer applications (Electronic mail, MS Excel, MS Outlook, MS Windows, MS Word, MS Office, MS PowerPoint, Social Media, Photoshop)\n\n· Strong analytical skills and the ability to interpret data to make informed decisions.\n\n· Excellent written and verbal communication skills.\n\n· Creative thinker with a passion for marketing.\n\n· Ability to work independently and as part of a team.\n\n· Strong project management skills and attention to detail.\n\n· Must be a Canadian Citizen or Permanent Resident.\n\nJob Types: Full-time, Part-time\n\nPay: From $16.55 per hour\n\nFlexible language requirement:\n• French not required\n\nSchedule:\n• Monday to Friday\n• Overtime\n• Weekends as needed\n\nEducation:\n• Bachelor's Degree (preferred)\n\nExperience:\n• Marketing: 2 years (preferred)\n\nLanguage:\n• English (preferred)\n\nWork Location: In person",
            "job_is_remote": false,
            "job_posted_at": "22 hours ago",
            "job_posted_at_timestamp": 1732899600,
            "job_posted_at_datetime_utc": "2024-11-29T17:00:00.000Z",
            "job_location": "Mississauga, ON",
            "job_city": "Mississauga",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.5852972,
            "job_longitude": -79.64498379999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DE5MzbaC56PSWZG6SAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13116100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "Z7GfS7mRLEaKnIGFAAAAAA==",
            "job_title": "Social Media Marketing Intern",
            "employer_name": "amareis inc",
            "employer_logo": null,
            "employer_website": null,
            "job_publisher": "Indeed",
            "job_employment_type": "Part-time",
            "job_employment_types": [
                "PARTTIME"
            ],
            "job_apply_link": "https://ca.indeed.com/viewjob?jk=d9dac4303eb9374c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": true,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=d9dac4303eb9374c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/OwjBEpoc9Bp4bDJVJ_hUOzTW3rna2lZaAwXAA-gzJ6jXsWpRDBUQtA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Trabajo.org",
                    "apply_link": "https://ca.trabajo.org/job-2891-3393ee2c9bc4f81ec5996546f780507c?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Summary\nWe are seeking a motivated and creative Social Media Intern to join our dynamic team. This internship offers an excellent opportunity to gain hands-on experience in social media management, content creation, and digital marketing strategies. The ideal candidate will possess a passion for social media and a desire to learn about the latest trends in online engagement.\n\nDuties\n• Assist in developing and implementing social media strategies to enhance brand awareness and engagement across various platforms.\n• Create engaging content, including graphics and written posts, using tools such as Adobe Creative Suite, particularly Adobe Illustrator.\n• Conduct research on industry trends, competitor activities, and audience preferences to inform content creation.\n• Utilize Hootsuite for scheduling posts and monitoring social media performance metrics.\n• Collaborate with the marketing team to support advertising campaigns and e-commerce initiatives.\n• Proofread content to ensure accuracy and consistency before publication.\n• Assist in graphic design projects that align with marketing goals.\n\nExperience\n• Familiarity with social media platforms (Facebook, Instagram, Twitter, LinkedIn) and their respective audiences.\n• Basic knowledge of SEO principles and best practices for online visibility.\n• Experience or coursework in advertising, digital marketing, or a related field is preferred.\n• Proficiency in Adobe Creative Suite is a plus; experience with graphic design is desirable.\n• Strong research skills with an ability to analyze data effectively.\n• Excellent written communication skills with attention to detail.\n\nThis internship is designed for individuals eager to expand their knowledge in social media marketing while contributing to our team's success. Join us in making an impact through innovative digital strategies!\n\nJob Type: Part-time\n\nPay: $20.00 per day\n\nExpected hours: 24 – 32 per week\n\nBenefits:\n• Dental care\n• Flexible schedule\n• Work from home\n\nFlexible language requirement:\n• French not required\n\nSchedule:\n• Monday to Friday\n\nExperience:\n• Marketing: 1 year (preferred)\n\nWork Location: Hybrid remote in West Vancouver, BC V7V 1H9\n\nApplication deadline: 2025-01-10\nExpected start date: 2025-01-06",
            "job_is_remote": false,
            "job_posted_at": "19 hours ago",
            "job_posted_at_timestamp": 1732910400,
            "job_posted_at_datetime_utc": "2024-11-29T20:00:00.000Z",
            "job_location": "West Vancouver, BC",
            "job_city": "West Vancouver",
            "job_state": "British Columbia",
            "job_country": "CA",
            "job_latitude": 49.3286251,
            "job_longitude": -123.1601982,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DZ7GfS7mRLEaKnIGFAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15119900",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "fFTo4U_OiujPhZKzAAAAAA==",
            "job_title": "ASIC CAD Intern",
            "employer_name": "Infinera",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTPzgGaxbEAocgYhGpzapDVPCwZg3Sk88Ci6ll6&s=0",
            "employer_website": "https://www.infinera.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/asic-cad-intern-at-infinera-4088188460?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/asic-cad-intern-at-infinera-4088188460?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/tOTnhTH6B3v7EXiu4n9f6IQs76wZTLBevW-s0EhSE09muJGPmvfBsg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Discover Technata Job Board",
                    "apply_link": "https://jobs.discovertechnata.com/companies/infinera/jobs/43160101-asic-cad-intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Ottawa, Canada\n\nResponsibilities\n\nWork as part of a world class ASIC design team, building leading edge chips for the Coherent Optics market.\n\nYour tasks would include developing ASIC flow, creating scripts for design automation, and other related design tasks as needed such as synthesis/rule checking, etc\n\nRequirements\n\nEnrolled in Electrical/Computer Engineering program at a Canadian university.\n\nStrong problem-solving skills\n\nStrong Working Knowledge/experience Of Python And/or Other Programming/scripting Language\n\nGood verbal/written communication skills and teamwork\n\nCompleted courses or previous work in ASIC design an asset\n\nKnowledge of Synopsys Electronic Design Automation (EDA) tools an asset\n\nKnowledge of Verilog or System Verilog an asset\n\nKnowledge of machine learning and/or neural networks may be an asset\n\nContractor\n\n“This position requires direct or indirect access to certain confidential information, hardware, software, technology, or technical information (referred to here as “Export-Controlled Information”) controlled under the U.S. International Traffic in Arms Regulations (ITAR) and/or the U.S. Export Administration Regulations (EAR). All personnel in this position must be eligible to or be able to obtain authorization from the appropriate agency to access applicable Export-Controlled Information. The U.S. Department of Commerce currently requires a foreign person with a most recent citizenship or permanent residency of Sudan, Ukraine, or a country currently designated in Country Group D:1, E:1 or E:2 (Supplement No. 1 to Part 740, Title 15) to have an export control license to access our Export-Controlled Information, unless they meet certain exemptions provided under U.S. export control laws and regulations. The list of applicable countries in Country Group D:1, E:1 or E:2 may be updated by the U.S. government from time to time. The current processing time for an export control license is approximately 4 to 6 months.\n\nYour employment or engagement with Infinera shall be contingent on verifying your eligibility or requirement for obtaining a necessary license and/or authorization from the appropriate agency. You will be required to provide certain information for export control compliance assessment purposes, and your information will be reviewed by Infinera's hiring and export control teams to ensure compliance with the U.S. export control laws and regulations. Infinera will collect necessary documents (such as proof of citizenship etc.) to assess license/authorization requirements if you are offered and accept the position.”\n\nInfinera is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. Infinera complies with all applicable state and local laws governing nondiscrimination in employment.",
            "job_is_remote": false,
            "job_posted_at": "20 hours ago",
            "job_posted_at_timestamp": 1732906800,
            "job_posted_at_datetime_utc": "2024-11-29T19:00:00.000Z",
            "job_location": "Ottawa, ON",
            "job_city": "Ottawa",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 45.420057199999995,
            "job_longitude": -75.7003397,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DfFTo4U_OiujPhZKzAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17301100",
            "job_onet_job_zone": "3"
        },
        {
            "job_id": "okmSxTw6_GGkn7DLAAAAAA==",
            "job_title": "Account Manager Intern/Co-op (Summer 2025)",
            "employer_name": "TD Bank",
            "employer_logo": null,
            "employer_website": null,
            "job_publisher": "TD Bank Jobs",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://tdbank.jobs/burlington-on/account-manager-internco-op-summer-2025/2FA30FD8397C4C7F923329232AC89CAB/job/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "TD Bank Jobs",
                    "apply_link": "https://tdbank.jobs/burlington-on/account-manager-internco-op-summer-2025/2FA30FD8397C4C7F923329232AC89CAB/job/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=6cd2cca6fd4d5413&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/account-manager-intern-co-op-summer-2025-at-td-4088303099?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/account-manager-intern-co-op-summer-2025-td-bank-JV_IC2284969_KO0,40_KE41,48.htm?jl=1009546036280&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Career Beacon",
                    "apply_link": "https://www.careerbeacon.com/en/job/2127172/td-bank/account-manager-intern-co-op-summer-2025/burlington-on?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://fr.simplyhired.ca/job/Rhlu87cPX6WN59cLKGpiN0fnBzVhqD3wlnfepBz5BfGuilxb8h7Byw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Role Type:\n\nInternship/Co-op\n\nWork Term:\n\nSummer/Term 3\n\nWork Location:\n\nBurlington, Ontario, Canada\n\nHours:\n\n37.5\n\nPay Details:\n\n$54,500 - $61,950 CAD\n\nTD is committed to providing fair and equitable compensation opportunities to all colleagues. Growth opportunities and skill development are defining features of the colleague experience at TD. Our compensation policies and practices have been designed to allow colleagues to progress through the salary range over time as they progress in their role. The base pay actually offered may vary based upon the candidate's skills and experience, job-related knowledge, geographic location, and other specific business and organizational needs.\n\nAs a candidate, you are encouraged to ask compensation related questions and have an open dialogue with your recruiter who can provide you more specific details for this role.\n\nJob Description:\n\nTD Commercial Banking provides financial solutions to North American businesses. Our broad range of products and services allows us to meet the needs of our clients in every sector, providing customized solutions to build a strategy that’s right for them now, and in the future. Our quest is to deliver a first class business banking client experience and to be” The Better Business Bank” in North America. At TD, better business bankers have a strong background in business and finance as well as the specific products they are responsible to sell and service. They have keen insight into all their clients – their industry, products, finances and markets. Better business bankers demonstrate good judgment in people, businesses and markets based on education, experience, “gut instincts” and “street smarts”.\n\nThe TD Equipment Finance team is a Center of excellence within Business Banking. Our mandate is to structure equipment financing (leases and loans) for business clients and prospects as an alternative to other conventional bank sources of financing.\n\nThis is an exciting introductory experience into the interesting and vital world of Equipment Financing. You will learn the fundamentals of Equipment Financing through, risk management, operation management, sales generation, and industry analysis. This role will give you the capability to work closely with a variety of mid-market businesses as they strive to successfully meet their financial goals. Your business skills will put you to the test in creating business proposals based on the Equipment Financing needs of our clients and prospects.\n\nJob Requirements\n• You’re a well-rounded person who works well independently and as part of a team.\n• This is a sales role so strong interpersonal skills are a must and strong financial acumen is considered a plus.\n• Equipment knowledge is not required prior to starting in the role.\n• You have a desire to learn, grow and succeed.\n• You are working towards completing an undergraduate degree in a business-related area of study.\n\nWho We Are\n\nTD is one of the world's leading global financial institutions and is the fifth largest bank in North America by branches/stores. Every day, we deliver legendary customer experiences to over 27 million households and businesses in Canada, the United States and around the world. More than 95,000 TD colleagues bring their skills, talent, and creativity to the Bank, those we serve, and the economies we support. We are guided by our vision to Be the Better Bank and our purpose to enrich the lives of our customers, communities and colleagues.\n\nTD is deeply committed to being a leader in customer experience, that is why we believe that all colleagues, no matter where they work, are customer facing. As we build our business and deliver on our strategy, we are innovating to enhance the customer experience and build capabilities to shape the future of banking. Whether you’ve got years of banking experience or are just starting your career in financial services, we can help you realize your potential. Through regular leadership and development conversations to mentorship and training programs, we’re here to support you towards your goals. As an organization, we keep growing – and so will you.\n\nOur Total Rewards Package\n\nOur Total Rewards package reflects the investments we make in our colleagues to help them and their families achieve their financial, physical, and mental well-being goals. Total Rewards at TD includes a base salary, variable compensation, and several other key plans such as health and well-being benefits, savings and retirement programs, paid time off, banking benefits and discounts, career development, and reward and recognition programs. Learn more (http://www.td.com/ca/en/about-td/who-we-are/benefits-of-working-at-td)\n\nAdditional Information:\n\nWe’re delighted that you’re considering building a career with TD. Through regular development conversations, training programs, and a competitive benefits plan, we’re committed to providing the support our colleagues need to thrive both at work and at home.\n\nPlease be advised that this job opportunity is subject to provincial regulation for employment purposes. It is imperative to acknowledge that each province or territory within the jurisdiction of Canada may have its own set of regulations, requirements.\n\nColleague Development\n\nIf you’re interested in a specific career path or are looking to build certain skills, we want to help you succeed. You’ll have regular career, development, and performance conversations with your manager, as well as access to an online learning platform and a variety of mentoring programs to help you unlock future opportunities. Whether you have a passion for helping customers and want to expand your experience, or you want to coach and inspire your colleagues, there are many different career paths within our organization at TD – and we’re committed to helping you identify opportunities that support your goals.\n\nTraining & Onboarding\n\nWe will provide training and onboarding sessions to ensure that you’ve got everything you need to succeed in your new role.\n\nInterview Process\n\nWe’ll reach out to candidates of interest to schedule an interview. We do our best to communicate outcomes to all applicants by email or phone call.\n\nAccommodation\n\nYour accessibility is important to us. Please let us know if you’d like accommodations (including accessible meeting rooms, captioning for virtual interviews, etc.) to help us remove barriers so that you can participate throughout the interview process.\n\nWe look forward to hearing from you!\n\nLanguage Requirement (Quebec only):\n\nSans Objet\n\nFederal law prohibits job discrimination based on race, color, sex, sexual orientation, gender identity, national origin, religion, age, equal pay, disability and genetic information.",
            "job_is_remote": false,
            "job_posted_at": "13 hours ago",
            "job_posted_at_timestamp": 1732932000,
            "job_posted_at_datetime_utc": "2024-11-30T02:00:00.000Z",
            "job_location": "Burlington, ON",
            "job_city": "Burlington",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.3255196,
            "job_longitude": -79.7990319,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DokmSxTw6_GGkn7DLAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "41401300",
            "job_onet_job_zone": null
        },
        {
            "job_id": "I7zf0K8DxoQbHWWdAAAAAA==",
            "job_title": "System Design - Co-op Student",
            "employer_name": "Elexicon Energy Inc.",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQHWJiRShU_sMYth5K95uM-tKV8sRiNhNT2T0ey&s=0",
            "employer_website": "https://elexiconenergy.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/system-design-co-op-student-at-elexicon-energy-inc-4088135726?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/system-design-co-op-student-at-elexicon-energy-inc-4088135726?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=4a09334c608fbb2e&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://fr.glassdoor.ca/job-listing/system-design-co-op-student-elexicon-energy-JV_IC2288894_KO0,27_KE28,43.htm?jl=1009546065382&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://fr.simplyhired.ca/job/gtqn_zzxp8LdyqlVI0JfIH5D95LjUMm-KtkCJGiHQsq6XMUUhvpU5g?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Salary.com",
                    "apply_link": "https://www.salary.com/ca-job/elexicon-energy-inc/system-design-co-op-student/j202411292024546870822?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Elexicon Energy is the fourth-largest municipally owned electricity distributor in Ontario. Our mission is to provide our customers with reliable, affordable energy services and to continuously improve to meet their needs, while ensuring the needs of our shareholders are met through sustainable growth.\n\nWHY JOIN OUR TEAM?\n\nAt Elexicon Energy we believe in living and leading our values through our daily actions. Our people are passionate about what they do and are engaged in day-to-day operations, projects and initiatives to support Our Why of empowering the communities we serve and helping customers create the possibilities that energize their future. This is an exciting time to join our growing team as we develop the strategies and plans to support a new brand and vision for customer centricity and operational excellence!\n\nElexicon Energy is looking for a student to join our Asset Management group to work with and learn from our Planning, Engineering GIS and Connections teams. This opportunity will allow the student to gain experience and exposure to Electrical Distribution Utility standards, specifications, codes and construction practices that would add to their personal development and advancement. The Electrical Engineering Co-op Student would join our Asset Management group based in Ajax with the placement to last up to 12-16 months.\n\nDuties And Responsibilities\n• Work within a team of engineers and design technicians on various projects to grow skills in a Municipal Electrical Distribution Utility.\n• Assist in various overhead and underground distribution design projects.\n• Assist in electrical distribution system planning and analyses.\n• Obtain exposure to Utility Industry standards, codes, and specifications.\n• Obtain exposure to electrical distribution construction and maintenance practices.\n• Obtain exposure to electrical distribution equipment and materials.\n• Prepare/modify various AutoCAD drawings, schematics, and records.\n• Other duties as required may be considered part of these responsibilities.\n\nHEALTH & SAFTEY\n• Must participate in safety training and be knowledgeable of Company safety rules and practices and must implement safe work procedures that ensure the safety of the Company employees and customers.\n\nPERSONAL ATTRIBUTES\n• Sound judgement, tact, and diplomacy\n• Positive, cooperative attitude\n• Honesty, patience, and tolerance\n• Strong initiative-taking work ethic.\n• Good people skills\n• Flexible, approachable and a resolute collaborator\n• Strong analytical and organizational skills\n\nMinimum Requirements\n• Enrolled in an Electrical Engineering Power Systems, Electrical Technology program.\n• Proficient with AutoCAD, SPIDA-Calc, PLS-CAD.\n• Proficient in Microsoft Office applications (Word, Excel, Outlook, etc.)\n• Ability to read blueprints/technical drawings.\n• Ability to work in a team environment.\n• Excellent communication, problem solving, and people skills.\n• Technical Communication and report writing.\n\nOur Commitment To Diversity, Equity, Inclusion And Belonging\n\nElexicon Energy embraces and celebrates our collective diversity. We are committed to fostering an inclusive, diverse and equitable workplace built on respect, support and collaboration.\n\nElexicon Energy is an equal opportunity employer. We value an inclusive and supportive workplace which truly reflects the diversity of the communities we serve. We welcome all individuals to apply and do not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, Indigenous/Métis status, or other legally protected status.\n\nIn accordance with the Ontario Human Rights Code and Accessibility for Ontarians with Disabilities Act, 2005, accommodation is available upon request at any point during the recruitment process. If you require accommodation please email us at HR@elexiconenergy.com and we will work to meet your needs.\n\nWe thank all applicants; however, only those to be considered will be contacted.",
            "job_is_remote": false,
            "job_posted_at": "22 hours ago",
            "job_posted_at_timestamp": 1732899600,
            "job_posted_at_datetime_utc": "2024-11-29T17:00:00.000Z",
            "job_location": "Ajax, ON",
            "job_city": "Ajax",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.8508553,
            "job_longitude": -79.0203732,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DI7zf0K8DxoQbHWWdAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17214100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "agkeuVTX5MJZJ-OaAAAAAA==",
            "job_title": "Finance Assistant - Internship",
            "employer_name": "Mississauga Secondary Academy",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSdKHy_FbCC4p8k5zW-jAOwGQuplo1Gl6Ehwx1A&s=0",
            "employer_website": null,
            "job_publisher": "Indeed",
            "job_employment_type": "Part-time",
            "job_employment_types": [
                "PARTTIME"
            ],
            "job_apply_link": "https://ca.indeed.com/viewjob?jk=de6b16b101571196&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": true,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=de6b16b101571196&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://fr.glassdoor.ca/job-listing/finance-assistant-internship-mississauga-secondary-academy-JV_IC2280741_KO0,28_KE29,58.htm?jl=1009546060968&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/6qxINuZV4st0wb3Ep4vjYnHZf6oAJzKpKVOGYQd9eb34UmEMoLZwqQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Requirements:\n\nEducation: Bachelor’s degree in Finance, Accounting, or a related field; Master’s degree preferred.\n\nTransportation/Travel: Own transportation\n\nExperience:\n• Payroll: 1 year (preferred)\n• General Accounting: 1 year (preferred)\n• Bookkeeping: 1 year (preferred)\n• Accounting: 1 year (required)\n\nNationality: Canadian Citizen\n\nSkills and Qualifications:\n• Bachelor’s degree in Finance, Accounting, or a related field; Master’s degree preferred.\n• Professional certifications such as CFA, CPA, or CMA are advantageous.\n• Strong analytical, problem-solving, and decision-making skills.\n• Proficiency in financial software and Microsoft Office Suite, Adobe Photoshop; MS Office, Teams, Quick Books; and Outlook..\n• Excellent communication and interpersonal skills.\n• Knowledge of education finance and familiarity with relevant regulations and standards.\n\nRequirements:\n\n1. Inventory management: count, maintain, organize, and report\n\n2. Tracking Sheets maintenance\n\n3. Financial Analysis, reporting and presentation\n\n4. Financial Folders management\n\n5. AR\n\n6. Website management.\n\nJob duties:\n\n· Direct administrative services related staff with daily coordination; assign work priority, and be responsible for full ownership of administrative functions to ensure work is completed accurately and within specified timeframes.\n\n· Manage the use of a document management system (digital and paper-based) to ensure efficient retrieval of admin information and maintenance safety of records.\n\n· Plan and oversee administrative assistance to the department including scheduling coordinating mailing, copying, and filing as required, purchasing appropriate supplies and services; collaborating with other departments in student services.\n\n· Manage and oversee the administrative and financial activity of the school, conduct analysis of the administration operation of the school, prepare and present report to the executive management team\n\n· Compiles and prepares statistics and data for reporting by the academic and marketing department for presentation within the school and to outside agencies (government, recruitment agency, school boards, etc.);\n\n· Processes requests for grade reports, enrolment letters, and transcripts from the Student Information System for college/university admission.\n\n· Oversee the processing of new admissions applications to completion, including setting up files, finalizing payments and reconciling transcript grades;\n\n· Analyzing financial information (e.g. revenues, expenditures, and cash management) to ensure all offices’ operations are within budget; Prepare reports on expenses and office budgets.\n\n· Maintain the school condition and arrange necessary repairs, organize the office layout and plan the maintenance and purchase of office equipment and supplies\n\n· Maintain equipment and supplies, inventory controls and adhere to budgets\n\nJob Type: Part-time\n\nPay: From $17.00 per hour\n\nFlexible language requirement:\n• French not required\n\nSchedule:\n• Monday to Friday\n• Overtime\n• Weekends as needed\n\nEducation:\n• Bachelor's Degree (preferred)\n\nExperience:\n• Accounting: 2 years (preferred)\n• Financial reporting: 1 year (preferred)\n• Bookkeeping: 1 year (preferred)\n\nWork Location: In person",
            "job_is_remote": false,
            "job_posted_at": "22 hours ago",
            "job_posted_at_timestamp": 1732899600,
            "job_posted_at_datetime_utc": "2024-11-29T17:00:00.000Z",
            "job_location": "Mississauga, ON",
            "job_city": "Mississauga",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.5852972,
            "job_longitude": -79.64498379999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DagkeuVTX5MJZJ-OaAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "11303100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "m64N-mChuksNzA29AAAAAA==",
            "job_title": "Student Intern, Test Manufacturing Engineering",
            "employer_name": "Celestica",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTbV-KLZr8P6j3oJRLsAibzowG_ai2DIwL8-uRl&s=0",
            "employer_website": "https://www.celestica.com",
            "job_publisher": "Recruit.net",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://www.recruit.net/job/student-test-manufacturing-engineering-jobs/07EE27905D576C47?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Recruit.net",
                    "apply_link": "https://www.recruit.net/job/student-test-manufacturing-engineering-jobs/07EE27905D576C47?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "​Req ID: 122848\nRemote Position: No\nRegion: Americas\nCountry: Canada\nState/Province: Ontario\nCity: Newmarket\n\n16 Month Internship\n\nCelestica (NYSE, TSX: CLS) is a US$7.9 billion global leader in design, manufacturing, hardware platform and supply chain solutions. We bring global expertise and insight at every stage of product development - from the drawing board to full-scale production and after-market services. Through our unrivalled customer-centric approach, we partner with leading companies in aerospace and defense, communications, enterprise, healthtech, industrial, capital equipment, and smart energy to deliver solutions for their most complex challenges.\n\nCelestica is a high-integrity work environment and when you join Celestica you are a part of a leading global company that enables the world’s best brands, and contributes to our innovative and collaborative solutions that help our customers unlock the potential of the future.\n\nOur global network spans 15 countries with 26,000 employees across the Americas, Europe and Asia. At our Toronto headquarters, we are focused on attracting top talent into our organization, including interns from universities and colleges.\n\nCelestica's internship program provides students with valuable development through real-life work experience, exciting projects and networking with industry professionals.\n\nBenefits for Students Include:\n• Experience working for one of the largest Canadian global technology companies\n• Possibility of a student casual contract position after completion of internship\n• Possibility of a full-time position after completion of degree\n• Access to Celestica’s development programs and projects\n• Celestica's Time Off to Volunteer program – two paid days off to volunteer per year\n• Fun intern activities including celebration events and networking\n• Internal recognition programs and rewards for stellar performance\n\nWhat’s in it for you?\n• Opportunity: Job experience at a large Canadian-based global company\n• Innovation: We look to our employees to implement new ideas and improve the way we do things\n• Collaboration: Students work as part of global teams, enabled by collaborative technology\n• Sustainability: We uphold strong ethics, reduce our impact on the environment and empower employees to give back to the community with two paid days off per year to volunteer\n• Development opportunities: including soft skills courses, innovation projects and mentorship\n• Networking: Strategically build your professional network to advance your career and deepen relationships across your peers and colleagues\n• Fun: Our interns have the opportunity to participate in fun activities including intern social events, Celestica’s charitable initiatives and our Spirit Week activities\n\nAbout this Opportunity:\n\nWe are looking for individuals who are willing to enjoy a stimulating and challenging work environment with opportunities to develop skills, while working in a highly motivated team.\n\nPreferred Skills:\n• Team player who possesses good communication skills (written and verbal)\n• Basic manufacturing system knowledge\n• MS Office (Excel)\n• Knowledge of web-based coding\n• Ability to work within a fast-paced environment\n• Ability to learn quickly and adapt to situations\n• Takes initiative, create opportunities for themselves\n• Organized, ability to deliver on commitments\n• Excellent problem solving skills\n\nActivities:\n• Project coordination and customer interfacing\n• Design of experiments, tools, and fixtures\n• Support the development and updating of assembly work instructions\n• Improving quality and efficiency of the manufacturing process; process optimization\n• Engineering Support of Shop Floor Control Tool\n• Manufacturing technical support for new and existing products\n• Flexibility to work overtime and on weekends as required\n\nPhysical Demands, duties of this position are varied and will include:\n• Duties of this position are performed in a normal office with exposure to manufacturing environments.\n• Duties may require extended periods of sitting and sustained visual concentration on a computer monitor or on numbers and other detailed data\n• Repetitive manual movements are frequently required (e.g. data entry, using a computer mouse, using a calculator, etc.)\n\nAdditional Details:\n\nArea: Test Engineering\n\nStart Date: May 2025\n\nLocation: 213 Harry Walker Pkwy S, Newmarket, ON\n\nVacancies: 1\n\nExperience: No formal experience is required\n\nEducation: Currently enrolled in a University internship program and have completed their 3rd year of studies. This role is ideal for students who enrolled in an Electrical Engineering program.\n• As this position involves work that is subject to the Canadian Government's Controlled Goods Program (CGP), your employment offer is conditional upon the successful completion of a security assessment by Celestica and/or its authorized agents, per the Controlled Goods Regulations.\n\nPlease provide a copy of your transcript with your application. Please include your student email address in your application.\n\nCelestica is an equal opportunity employer. All qualified applicants will receive consideration for employment and will not be discriminated against on any protected status (including race, religion, national origin, gender, sexual orientation, age, marital status, veteran or disability status or other characteristics protected by law).\nAt Celestica we are committed to fostering an inclusive, accessible environment, where all employees and customers feel valued, respected and supported. Accommodations are available upon request for candidates throughout the hiring process. If you require an accommodation, we will work with you to meet your needs.\n\nThis position involves technologies regulated by the Canadian government's Controlled Goods Program (CGP). Candidates must be Canadian citizens or permanent residents of Canada and meet all other requirements under CGP. Job offers will be conditional upon candidates undergoing a successful security screening per the Controlled Goods Regulations.\n\nCelestica would like to thank all applicants, however, only qualified applicants will be contacted.\nCelestica does not accept unsolicited resumes from recruitment agencies or fee based recruitment services.",
            "job_is_remote": false,
            "job_posted_at": "16 hours ago",
            "job_posted_at_timestamp": 1732921200,
            "job_posted_at_datetime_utc": "2024-11-29T23:00:00.000Z",
            "job_location": "Northwest Territories",
            "job_city": null,
            "job_state": "Northwest Territories",
            "job_country": "CA",
            "job_latitude": 63.588753,
            "job_longitude": -115.5069381,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dm64N-mChuksNzA29AAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17302900",
            "job_onet_job_zone": "3"
        },
        {
            "job_id": "TXciXPwl79eelZecAAAAAA==",
            "job_title": "IT Coop Student – Communications Technology",
            "employer_name": "dynaCERT Inc.",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTlYaugKguAuSGRVNoVppBvIRQvzce6MFxDskM-&s=0",
            "employer_website": "https://dynacert.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/it-coop-student-%E2%80%93-communications-technology-at-dynacert-inc-4084212434?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/it-coop-student-%E2%80%93-communications-technology-at-dynacert-inc-4084212434?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "SUMMARY\n\nWe are seeking an enthusiastic and detail-oriented Internet Communications Technology Co-op student to join our team. The ideal candidate will gain hands-on experience in internet engineering, WiFi systems, Voice over IP, and network cabling, contributing to real-world projects while developing their technical skills.\n\nPRIMARY RESPONSIBILITIES\n\n● Assist in the design, implementation, and testing of network protocols and routing configurations to optimize network performance.\n\n● Support the deployment and security of WiFi networks, including power measurement and system design to ensure reliable connectivity.\n\n● Participate in the design, building, and testing of VoIP systems, including configuration and troubleshooting of hardware and software components.\n\n● Assist in the installation, testing, and documentation of network cabling, ensuring compliance with industry standards and best practices.\n\n● Create and maintain detailed technical documentation for network configurations, design specifications, and project processes.\n\nTRAINING, EDUCATION & SKILLS REQUIREMENTS\n\n● Currently enrolled in a co-op program in Internet Communications Technology, Network Engineering, or a related field.\n\n● Strong understanding of internet protocols (TCP/IP, DNS) and routing concepts.\n\n● Knowledge of WiFi design principles, power measurement techniques, and security protocols.\n\n● Familiarity with Voice over IP technologies, including SIP and RTP protocols.\n\n● Basic knowledge of network cabling standards (e.g., Cat 5e, Cat 6) and installation practices.\n\n● Excellent communication skills, both verbal and written, with the ability to collaborate effectively in a team environment.\n\nNICE TO HAVE\n\n· Previous experience with network configuration tools and diagnostic equipment.\n\n· Understanding of project management methodologies related to technology projects.\n\n· Any relevant certifications (e.g., CompTIA Network+, Cisco CCNA) are a plus.\n\nNOTE: This is not a complete job description. The Employee may perform other related duties as needed to meet the ongoing needs of the organization.",
            "job_is_remote": false,
            "job_posted_at": "21 hours ago",
            "job_posted_at_timestamp": 1732903200,
            "job_posted_at_datetime_utc": "2024-11-29T18:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DTXciXPwl79eelZecAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17214100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "0PKHsLGGs2zQcpiKAAAAAA==",
            "job_title": "Designer Intern (May 2025 - 16 months)",
            "employer_name": "IBM",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQZGH_qbepQIT89yLTRAtcjMvGJcAF2HbjN-Th9&s=0",
            "employer_website": null,
            "job_publisher": "Recruit.net",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://www.recruit.net/job/designer-may-months-jobs/81FB86A1F86AF9FF?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Recruit.net",
                    "apply_link": "https://www.recruit.net/job/designer-may-months-jobs/81FB86A1F86AF9FF?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Introduction\nThe IBM Canada Lab in Markham, Ontario is one of the largest R&D facilities in Canada. As a Design intern at the IBM Canada Lab, you would be part of a team that transforms our customer’s challenges into solutions.\nThe mission of IBM’s global software design organization is to empower users to do their best work through intuitive and visually engaging interfaces. As a Designer, you’ll play a crucial role in creating end-to-end customer experiences.\nYour Role and Responsibilities\nThis position resides in Markham, ON and is a 16 month work term commencing in May 2025. It is mandatory that all applicants are enrolled in full-time studies at a post-secondary institution and returning to full-time studies upon completion of the work-term.\n\nAs an IBM Z Designer, your focus will be on meeting individual and team objectives, learning your craft, contributing to the design of a product and learning about IBM and IBM Design practices. Generally, your efforts may be concentrated around one or more products in your business area, with guidance and feedback from a more senior designer or design leader. You will also contribute to the design community by supporting community activities, sharing, learning or maintaining a part of the community operation.\nAs designers, we focus on ensuring the experiences we create meet the needs of our customers and end users and strive for design excellence in our work. You will apply a user-centered perspective to your design work and advocate for the customer / end user in all interactions with your teammates and colleagues. At times you may also engage with customers or other users of the product in the design process.\n\nKey/Strategic Responsibilities\n• Grow domain knowledge by learning the value proposition of your product, its market position, the basics of its technologies and how it’s used by our customers.\n• Develop enough domain fluency to contribute ideas that differentiate the solution in the market.\n• Attend and participate in design and product-oriented activities, such as stand-ups, Town Halls, product demos or design critiques.\n• Develop the ability to find and apply relevant industry references/trends.\n• Identify improvement opportunities at the individual product level\n\nCross-Functional Responsibilities\n• Attend client / sponsor user sessions; establish your own client relationships.\n• Contribute to the design of a product by advocating for the user experience and value.\n• Learn about the org structure and key stakeholders of your PM and dev teams\n• Seek and provide feedback on outcomes to your entire team.\n• Support advocacy of design thinking across the team.\n• Communicate with other designers and your 3iab team about your project status.\n• Attend and participate in design reviews and playbacks to share experience design and related artifacts.\n• Understand how your work fits into the department mission, strategy, and vision.\n\nFunctional Responsibilities\n• Contribute towards delivery of project needs, such as research insights or user experience deliverables, in alignment with timeline and roadmap milestones.\n• Participate in concept ideation informed by an understanding of users, clients, and their desired outcomes.\n• Adapt work and processes according to guidance and direction from design leads.\n• Strengthen your craft skills in your discipline through learning, mentorship, and producing.\n• Expand competencies across t-shape to better contribute to personal and team outcomes.\n• Acquire Enterprise Design Thinking fluency and infuse practices into work.\n• Develop foundational knowledge in the technologies needed for your product/org, such as AI.\n• Develop entry-level knowledge of IBM Experience Standards.\n• Participate in internal and external design community activities.\n• Familiarity with accessibility guidelines and principles (e.g., WCAG)\n\nRequired Technical and Professional Expertise\n• UI Problem Solving: Ability to solve complex user problems through user interface design, creating mock-ups, prototypes, and documenting interaction patterns.\n• Design Tools Proficiency: Demonstrated experience with design tools such as Sketch, InVision, Adobe Creative Cloud, etc.\n• Visual Design Skills: Proficient in creating visually compelling artifacts, icons, high fidelity mock-ups, and other graphical elements for user interfaces.\n• Design Principles: Knowledge of design principles including typography, layout, imagery, colour theory, and creating efficiencies in visual design workflows.\n• Communication Skills: Proven communication skills and the ability to understand and address customer requirements effectively.\n• Dynamic Environment: Comfortable working in a dynamic, team-based environment.\n• Portfolio Presentation: Must have a portfolio showcasing previous design work.\n• Must be eligible to work 12 months starting in January\n\nPreferred Technical and Professional Expertise\n• Design Trends Awareness: Understanding of modern design thinking and design trends, including responsiveness and accessibility.\n• Attention to Detail: Appreciation for detail, ensuring every pixel and interaction is meticulously crafted.\n• Workshop Facilitation: Knowledge in planning and moderating design thinking workshops.\n• Registered in a formal co-op/internship program\n\nKey Job Details\nRole:Designer Intern (May 2025 – 16 months) Location:Markham, CA Category:Design & UX Employment Type:Full-Time Travel Required:No Travel Contract Type:Internship Company:(0026) IBM Canada Limited – IBM Canada Limitee Req ID:727075BR",
            "job_is_remote": false,
            "job_posted_at": "16 hours ago",
            "job_posted_at_timestamp": 1732921200,
            "job_posted_at_datetime_utc": "2024-11-29T23:00:00.000Z",
            "job_location": "Northwest Territories",
            "job_city": null,
            "job_state": "Northwest Territories",
            "job_country": "CA",
            "job_latitude": 63.588753,
            "job_longitude": -115.5069381,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D0PKHsLGGs2zQcpiKAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "27102400",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "lj2cpFW3URH_DRUUAAAAAA==",
            "job_title": "Electronics Design Co-op",
            "employer_name": "Blue Robotics",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRKn-m8qxioqtvi5sbNDtHujDyJJYcMMYwy7pU_&s=0",
            "employer_website": "https://bluerobotics.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/electronics-design-co-op-at-blue-robotics-4088148796?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/electronics-design-co-op-at-blue-robotics-4088148796?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Learn4Good",
                    "apply_link": "https://www.learn4good.com/jobs/victoria/canada/engineering/3724867548/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Term: Winter, Summer, and Fall 2025\n\nApprox. Start Dates:\n• Winter: January 6th, 2025\n• Summer: May 5th, 2025\n• Fall: September 2nd, 2025\n\nDeadline to apply:\n• Winter: November 29th, 2024\n• Summer: March 28th, 2025\n• Fall: July 31st, 2025\n\nHours per week: Minimum 40 hours\n\nDuration: 4 or 8 months\n\nPay rate: $25 CAD - $35 CAD per hour\n\nLocation: Victoria, BC\n\nAt Blue Robotics, we enable the field of marine robotics with affordable components and systems. What does this really mean? We design cool tech for use underwater that enables tons of people and organizations to pursue their audacious dreams of exploring and learning about our oceans and waterways. We have a small and vibrant design team in Victoria, BC with a collaborative spirit that is both humble and bold. We work together to navigate all design steps from the whiteboard to fully tested, volume-manufactured products.\n\nWe are looking for a fledgling electronics designer - someone with some PCB experience and a hunger to crank this up a few notches. If you:\n• have an innate desire to create new things with electronics,\n• noodle intently over circuit designs and PCB layouts, and\n• yearn to expand your technical depth and understanding,\n\nthen you will likely be a great fit!\n\nWill it all be whipped cream and roses? Probably not. But as a team we’ll chip away at this awesome, fun and sometimes infuriating dream that we’ve decided deserves to become a reality.\n\nQualifications:\n• Currently enrolled in an Engineering degree in a related field (EE, Eng Phys, Mechatronics, etc.)\n• Strong and growing foundation in electronic and microelectronic theory\n• Designed, built and tested a few PCBs so far\n• Deep, insatiable impulse to understand, and leverage that understanding to create new things\n• Innate desire to collaborate, learn, and adapt\n\nBenefits:\n\nPaid holidays, PTO, Educational reimbursement, Relocation reimbursement\n\nHow to Apply:\n\nPlease complete our short application and submit your materials. Resume, cover letter and portfolio are required for consideration. Project portfolios are accepted in any format (website, document, presentation, github, etc).",
            "job_is_remote": false,
            "job_posted_at": "21 hours ago",
            "job_posted_at_timestamp": 1732903200,
            "job_posted_at_datetime_utc": "2024-11-29T18:00:00.000Z",
            "job_location": "Victoria, BC",
            "job_city": "Victoria",
            "job_state": "British Columbia",
            "job_country": "CA",
            "job_latitude": 48.4284207,
            "job_longitude": -123.3656444,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dlj2cpFW3URH_DRUUAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17301200",
            "job_onet_job_zone": "3"
        },
        {
            "job_id": "qQQXALqnTtB0x4wYAAAAAA==",
            "job_title": "Student Intern - Business and Finance Assistant",
            "employer_name": "Kanas Corporation",
            "employer_logo": null,
            "employer_website": "https://www.kanas.ca",
            "job_publisher": "Indeed",
            "job_employment_type": "Part-time and Internship",
            "job_employment_types": [
                "PARTTIME",
                "INTERN"
            ],
            "job_apply_link": "https://emplois.ca.indeed.com/viewjob?jk=d557a023a73f2b01&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://emplois.ca.indeed.com/viewjob?jk=d557a023a73f2b01&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/student-intern-business-and-finance-assistant-kanas-corporation-JV_IC2275123_KO0,45_KE46,63.htm?jl=1009546320501&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/dAi74Sh65ArYosDwoekN0o9GFFBb8-pxFDVA64-Sv6-9KOw23eDtzQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Ca.bebee.com",
                    "apply_link": "https://ca.bebee.com/job/14be66de78d06e6f063bc1fc2ff5e6db?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobs Trabajo.org",
                    "apply_link": "https://ca.trabajo.org/job-3051-d063d6b66790f8789d2ce66f33a18f3a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Kanas Corporation is a vertically integrated development company. Our lines of business include development, construction and property management.\n\nWe are seeking a part time Business and Finance Assistant to become an integral part of our team.\n\nWhat you can expect to do in this role:\n\nSupport a team on a range of financial and business projects and initiatives. You may be required to work on some or all of the following tasks:\n\nJob Description:\n\nYou may be required to work on some or all of the following tasks:\n• Prepare, verify, process and reconcile financial data\n• Support staff in developing business proposals, reports, spreadsheets, and other business/financial documents\n• Conduct research and perform analysis. (i.e. quantitative, qualitative, statistical)\n• Assist with planning and execution of internal events\n• Prepare and organize correspondence, perform data entry and word processing functions, create presentations and various internal and external documents\n• Plan, organize, coordinate and manage daily assigned work\n\nExperience & Technical Skills\n• You have above average Excel, PowerPoint, Word skills\n• Experience in financial modeling and analysis related to real estate, development, or construction projects is highly desirable\n\nWho you are:\n• You have a fabulous attitude and strong EQ\n• You have exceptional oral and written communication skills\n• You have demonstrated in-depth research skills, strong detail orientation and are comfortable writing corporate documents\n• Skilled at managing multiple projects and tight deadlines effectively\n• You are motivated, focused and take pride in your work\n• A keen interest in real estate and development\n\nStudent Status:\n• You must be enrolled in a secondary or post-secondary institution\n• You must be taking a business program with a focus on accounting / finance or management operations, or real estate\n\nStart Date: Immediately\n\nWork Hours: Monday to Friday (in person)\n\nThank you for viewing our job posting. If you think this job sounds like it was designed for you, send us your resume and cover letter.\n\nJob Types: Part-time, Internship / Co-op\nContract length: 4 months\n\nPay: $22.00 per hour\n\nExpected hours: 25 per week\n\nSchedule:\n• Day shift\n• Monday to Friday\n\nApplication question(s):\n• Are you currently enrolled in a secondary or post-secondary institution?\n• Are you taking a business program with a focus on accounting / finance or management operations?\n\nWork Location: In person\n\nApplication deadline: 2024-12-06\nExpected start date: 2024-12-12",
            "job_is_remote": false,
            "job_posted_at": "17 hours ago",
            "job_posted_at_timestamp": 1732917600,
            "job_posted_at_datetime_utc": "2024-11-29T22:00:00.000Z",
            "job_location": "Calgary, AB",
            "job_city": "Calgary",
            "job_state": "Alberta",
            "job_country": "CA",
            "job_latitude": 51.044733099999995,
            "job_longitude": -114.0718831,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DqQQXALqnTtB0x4wYAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": "HOUR",
            "job_highlights": {},
            "job_onet_soc": "13205100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "13lhO12URTczRr_wAAAAAA==",
            "job_title": "Marketing Intern",
            "employer_name": "Marlin Staffing Inc",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQSgU9N1sEFJPg0QTCRa7uqAaIZceo3KGIaV9RB&s=0",
            "employer_website": "https://ca.linkedin.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/marketing-intern-at-marlin-staffing-inc-4088194050?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/marketing-intern-at-marlin-staffing-inc-4088194050?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobs Trabajo.org",
                    "apply_link": "https://ca.trabajo.org/job-2891-319423ffcab8337d3ef49b75d63a55b2?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Company Description\n\nMarlin Staffing Inc., based in Mississauga, ON, is a premier service provider in the recruitment industry with over a decade of proven expertise. Our team consists of seasoned professionals who have collaborated with high-profile clients across the manufacturing, packaging, logistics, and baking sectors. Leveraging advanced technology and innovative practices, we excel at connecting top talent with exciting career opportunities while helping employers find the right professionals to achieve their goals.\n\nRole Description\n\nWe are seeking Marketing Interns for an on-site internship at our Mississauga, ON location. In this role, you will play a key part in supporting our marketing initiatives, conducting market research, contributing to sales and marketing strategies, delivering exceptional customer service, and ensuring clear, effective communication. This internship provides valuable hands-on experience in a fast-paced, dynamic industry environment.\n\nQualifications\n• Strong communication and customer service skills\n• Proficiency in market research and marketing strategy development\n• Experience in sales or marketing (preferred but not required)\n• Ability to collaborate effectively in a team-oriented setting\n• Excellent organizational skills and attention to detail\n• Interest in the recruitment industry and talent acquisition\n• Currently pursuing a degree or diploma in Marketing, Business, or a related field\n\nJoin us at Marlin Staffing Inc. and gain meaningful, real-world experience in the recruitment industry while contributing to innovative marketing and business growth strategies!",
            "job_is_remote": false,
            "job_posted_at": "20 hours ago",
            "job_posted_at_timestamp": 1732906800,
            "job_posted_at_datetime_utc": "2024-11-29T19:00:00.000Z",
            "job_location": "Milton, ON",
            "job_city": "Milton",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.5182991,
            "job_longitude": -79.8774042,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D13lhO12URTczRr_wAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13116100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "NeR5g76wbJVIJw2DAAAAAA==",
            "job_title": "Civil Engineering Summer Student (Civil Field Inspector)",
            "employer_name": "Journey Engineering Corporation",
            "employer_logo": null,
            "employer_website": null,
            "job_publisher": "Indeed",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.indeed.com/viewjob?jk=4cf27411565d7b51&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": true,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=4cf27411565d7b51&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/civil-engineering-summer-student-civil-field-inspector-journey-engineering-corporation-JV_IC2275123_KO0,54_KE55,86.htm?jl=1009546263537&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/Whtr_cj9axzvRFcqgOdH8KmSDgsKpEFvANbNkyUJBrn7e3_KGVNM8Q?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "SUMMER STUDENT - CIVIL FIELD INSPECTOR\n\nEffective Date: April 28, 2025 – August 29, 2025 (with potential opportunity to extend)\n\nHours:Full-Time Summer Position. Field Hours Vary; Office Hours are 8:00 AM - 5:00 PM\n\nWages: $26-30/hour, depending on experience\n\nOpen Positions: 2\n\nSeeking the Next Rising-Star!\n\nYou are hard working with an unquenchable thirst for learning. You know that integrity is the only constant and that a strong team can accomplish more than a group of self-serving individuals. Most importantly, you want to build assets that work! That’s what we do and that’s what sets us apart from our competition: we partner with our clients and we build things that solve their needs. Under the mentorship of either the Civil Engineer or Manager of Infrastructure Projects, the results you will be responsible for include:\n\nProvide Construction Field Inspection\n• Provide construction QA field inspection on civil works (e.g., earthworks, soil testing, piping & geosynthetic installation)\n• Ensure construction activities meet design drawings and specifications\n• Prepare field reporting such as work activity, production and quantity tracking, and progress payment data\n• Drone flights capturing construction progress\n• Technical support and input on construction related tasks\n• Support the review of construction-related submittals (e.g., soil testing results, HDPE material specifications, etc.)\n\nProvide Project Management and Project Administration Support\n• Support the project manager in data gathering and reporting\n• Support the scheduling and forecasting process\n• Support contract administration\n• Professional and succinct client communications\n\nGain an Understanding of and Provide Project Technical Support\n• Provide the project team with research support\n• Produce quality draft reports\n• Perform calculations and compile/analyze project data\n• Simple design work, design input, and design review input\n• Procurement support including vendor and equipment research\n\nEducation/Experience:\n• Currently enrolled in a civil engineering degree program civil engineering technologist diploma program with at least one semester of education completed\n• Experience, regardless of industry, that exemplifies the Journey values and has prepared you for the responsibilities above\n• A strong desire to learn\n• Exhibit a safety mindset in a professional and personal setting\n• Experience working in a dynamic and challenging environment and adapting to changing priorities\n• Ability to accurately analyze information and deal with ambiguous situations\n• Proficient with MS Suite (Word, Excel, Outlook)\n• Valid Alberta Driver’s license or equivalent (note: Drivers Abstract will be required)\n\nPlease submit your cover letter & resume through the job posting website (Indeed).\n\nWe sincerely appreciate all responses, but only potential candidates will be contacted. Thank you!\n\nJob Types: Seasonal, Internship / Co-op\nContract length: 4 months\n\nPay: $26.00-$30.00 per hour\n\nBenefits:\n• Casual dress\n• Company events\n• On-site gym\n• Paid time off\n\nFlexible language requirement:\n• French not required\n\nSchedule:\n• 10 hour shift\n• 12 hour shift\n• Monday to Friday\n• Weekends as needed\n\nAbility to commute/relocate:\n• Calgary, AB T2P 2Y3: reliably commute or plan to relocate before starting work (preferred)\n\nApplication question(s):\n• Have you had any experience (through schoolwork or co-op term) with: field/site work; civil earthworks; surveying; soil testing; piping/geosynthetic installation; construction management; or drone piloting? Please briefly describe.\n• This is a summer student position, i.e., you MUST be a student. Please confirm that you are currently enrolled in either a civil engineering degree program or civil engineering technologist diploma program with at least one (1) semester of education completed.\n\nExperience:\n• Microsoft Suite (Word, Excel, Outlook): 1 year (preferred)\n\nLanguage:\n• English (required)\n\nLicence/Certification:\n• Alberta Driver’s license (or equivalent) & Drivers Abstract (required)\n\nWillingness to travel:\n• 75% (preferred)\n\nWork Location: In person\n\nApplication deadline: 2024-12-20\nExpected start date: 2025-04-28",
            "job_is_remote": false,
            "job_posted_at": "18 hours ago",
            "job_posted_at_timestamp": 1732914000,
            "job_posted_at_datetime_utc": "2024-11-29T21:00:00.000Z",
            "job_location": "Calgary, AB",
            "job_city": "Calgary",
            "job_state": "Alberta",
            "job_country": "CA",
            "job_latitude": 51.044733099999995,
            "job_longitude": -114.0718831,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DNeR5g76wbJVIJw2DAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": "HOUR",
            "job_highlights": {},
            "job_onet_soc": "17205100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "2aKRgMFy2dDAZDXRAAAAAA==",
            "job_title": "Software Engineer Intern (Toronto) - Spring 2025",
            "employer_name": "Snowflake",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQSpLqaY5bhser3M_0CNtOLHRqhfh6VYSZ_gF1p&s=0",
            "employer_website": "https://www.snowflake.com",
            "job_publisher": "Snowflake Careers",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://careers.snowflake.com/us/en/job/SNCOUS02F8F978CAB8445AB01A20FC582585A6EXTERNALENUSCA0CEA544C3D4F41AE88BB92E3B7FBB6/Software-Engineer-Intern-Toronto-Spring-2025?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Snowflake Careers",
                    "apply_link": "https://careers.snowflake.com/us/en/job/SNCOUS02F8F978CAB8445AB01A20FC582585A6EXTERNALENUSCA0CEA544C3D4F41AE88BB92E3B7FBB6/Software-Engineer-Intern-Toronto-Spring-2025?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Job Board",
                    "apply_link": "https://borderlessai.applytojobs.ca/engineering/30500?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/Amazon/Job/Amazon-Robotics-Software-Development-Engineer-Co-Op-and-Intern-2025-Toronto/-in-Toronto,ON?jid=2a2615390e0c7991&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://emplois.ca.indeed.com/viewjob?jk=5d884f299cc392ed&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Itjobs.ca",
                    "apply_link": "https://www.itjobs.ca/en/offer/on/toronto/amazon-robotics-software-development-engineer-co-op-and-intern-2025-toronto/c88a18e1-3490-4c8f-82af-e7875c08918d_en/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "The Muse",
                    "apply_link": "https://www.themuse.com/jobs/snowflake/software-engineer-intern-toronto-spring-2025-b4550a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/amazon-robotics-software-development-engineer-co-op-and-intern-2025-toronto-amazon-canada-fulfillment-services-ulc-JV_IC2281069_KO0,75_KE76,114.htm?jl=1009425247298&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/9fueMlFI5ny6DswCB_39uflYD9Ijtd0fr_CkxNcY_KpCA947xkHV4A?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Build the future of the AI Data Cloud. Join the Snowflake team.\n\nSnowflake started with a clear vision: develop a cloud data platform that is effective, affordable, and accessible to all data users. Snowflake developed an innovative new product with a built-for-the-cloud architecture that combines the power of data warehousing, the flexibility of big data platforms, and the elasticity of the cloud at a fraction of the cost of traditional solutions. We are now a global, world-class organization with offices in more than a dozen countries and serving many more.\n\nWe’re looking for dedicated students who share our passion for ground-breaking technology and want to create a lasting future for you and Snowflake.\nWHAT WE OFFER:\n• Paid, full-time internships in the heart of the software industry\n• Post-internship career opportunities (full-time and/or additional internships)\n• Exposure to a fast-paced, fun and inclusive culture\n• A chance to work with world-class experts on challenging projects\n• Opportunity to provide meaningful contributions to a real system used by customers\n• High level of access to supervisors (manager and mentor), detailed direction without micromanagement, feedback throughout your internship, and a final evaluation\n• Stuff that matters: treated as a member of the Snowflake team, included in company meetings/activities, flexible hours, casual dress code, accommodations to work from home, swag and much more\n• When return to office in effect, catered lunches, access to gaming consoles, recreational games, happy hours, company outings, and more\n\nWHAT WE EXPECT:\n• Desired class level: 3rd/4th year Undergraduates, Masters, or PhD\n• Desired majors: Computer Science, Computer Engineering, Software Engineering, or related field\n• Required coursework: algorithms, data structures, and operating systems\n• Recommended coursework: cloud computing, database systems, distributed systems, and real-time programming\n• Bonus experience: working experience, research or publications in databases or distributed systems, and contributions to open source\n• When: Spring 2025 (January - April 2025)\n• Duration: 12 week minimum, 12-16 weeks recommended\n• Excellent programming skills in C++ or Java\n• Knowledge of data structures and algorithms\n• Strong problem solving and ability to learn quickly in a dynamic environment\n• Experience with working as a part of a team\n• Dedication and passion for technology\n\nWHAT YOU WILL LEARN/GAIN:\n• How to build enterprise grade, reliable, and trustworthy software/services\n• Exposure to SQL or other database technologies\n• Understanding of database internals, large-scale data processing, transaction processing, distributed systems, and data warehouse design\n• Implementation, testing of features in query compilation, compiler design, query execution\n• Experience working with cloud infrastructure, AWS, Azure, and/or Google Cloud in particular\n• Learning about cutting edge database technology and research\n\nPOSSIBLE TEAMS/WORK FOCUS AREAS:\n• Data Applications Infrastructure, Data Marketplace, Data Privacy, Data Sharing\n• High performance large-scale data processing\n• Large-scale distributed systems\n• Software-as-a-Service platform\n• Software frameworks for stability and performance testing\n\nEvery Snowflake employee is expected to follow the company’s confidentiality and security standards for handling sensitive data. Snowflake employees must abide by the company’s data security plan as an essential part of their duties. It is every employee's duty to keep customer information secure and confidential.\n\nSnowflake is growing fast, and we’re scaling our team to help enable and accelerate our growth. We are looking for people who share our values, challenge ordinary thinking, and push the pace of innovation while building a future for themselves and Snowflake.\n\nHow do you want to make your impact?",
            "job_is_remote": false,
            "job_posted_at": "16 hours ago",
            "job_posted_at_timestamp": 1732921200,
            "job_posted_at_datetime_utc": "2024-11-29T23:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D2aKRgMFy2dDAZDXRAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15113200",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "fs6inOI6KYYkWGzIAAAAAA==",
            "job_title": "Content Marketing Intern",
            "employer_name": "YouLearnt",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR9G6w7SKlXKrK0TSwEFS82Wygca8ZZNnyA4cMK&s=0",
            "employer_website": "https://youlearnt.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/content-marketing-intern-at-youlearnt-4086004816?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/content-marketing-intern-at-youlearnt-4086004816?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Company Description\n\nYouLearnt aims to make learning and teaching any subject in any language accessible and convenient for everyone, anywhere, and anytime.\n\nRole Description\n\nThis is a remote internship role for a Content Marketing Intern at YouLearnt. The Content Marketing Intern will be involved in day-to-day tasks related to communication, web content writing, content strategy, writing, and content management.\n\nQualifications\n• Excellent Communication skills.\n• Web Content Writing and Writing skills.\n• Content Strategy and Content Management skills.\n• Ability to create engaging and informative content.\n• Understanding of digital marketing principles.\n• Pursuing or completed a degree in Marketing, Communications, English, or related field.",
            "job_is_remote": false,
            "job_posted_at": "3 hours ago",
            "job_posted_at_timestamp": 1732968000,
            "job_posted_at_datetime_utc": "2024-11-30T12:00:00.000Z",
            "job_location": "Canada",
            "job_city": null,
            "job_state": null,
            "job_country": "CA",
            "job_latitude": 56.130365999999995,
            "job_longitude": -106.34677099999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dfs6inOI6KYYkWGzIAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13116100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "NbERnd205y5qo4dkAAAAAA==",
            "job_title": "Product Manager Intern",
            "employer_name": "Leap Event Technology",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQNBN6zrXQNEuzqI4-lKHUen5d8H5_vMOchB2us&s=0",
            "employer_website": "http://patrontechnology.com/",
            "job_publisher": "Salary.com",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://www.salary.com/ca-job/leap-event-technology/product-manager-intern/j202411262355411645442?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Salary.com",
                    "apply_link": "https://www.salary.com/ca-job/leap-event-technology/product-manager-intern/j202411262355411645442?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "WHO WE ARE:\n\nLeap is revolutionizing the event technology industry by empowering organizers to create experiences that are more engaging, more thrilling, and more impactful than ever before. Our all-in-one suite of ticketing, mobile apps, experiential marketing, and patron management tools, combined with our expert marketing services, allows organizers to drive nonstop engagement and capture all customer data from their entire event. That’s why iconic brands like New York Comic Con, Bonnaroo, Illuminarium, and the NHL choose us to power their events.\n\nWe are a diverse and passionate team of event experts and fans who are dedicated to helping organizers transform their event experiences. Like our clients, we live and breathe events. We take our passion, knowledge, and hands-on experience and apply it to our work every single day. With offices in Dallas, Montreal, and Sydney, and an expansive remote workforce across the globe, our diverse backgrounds give us the experience needed to create incredible events for any industry, anywhere in the world.\n\nLeap Event Technology is recognized and certified as a Top Workplace and Great Place to Work Canada.\n\nABOUT OUR INTERNSHIP PROGRAM:\n\nOur 3 month program is an opportunity for students enrolled in a post-secondary education program to gain hands-on experience in the live event technology industry. This is a paid internship with a 32 hour a week schedule. Interns will work a hybrid schedule from one of our physical locations (Dallas or Montreal).\n\nThe program is set to start on\n\nJanuary 6, 2025 and end on March 28, 2025. As with all of our new hires, we look for motivated people who exemplify our core values to join our team.\n\nAs a Leap Event Technology intern, you will:\n• Take part in our mentorship program: Be paired with an experienced member of our team\n• Participate in weekly intern cohort activities and events (social, team building, training)\n• Connect with Senior Leadership: One-on-one conversation with your department head and a Q&A session with our CEO\n• Have access to Udemy Business: a world-class learning and development\n\nplatform offering over 14,000 training courses\n• Set goals: Work with your manager to determine what you want to accomplish during the program and receive feedback on your performance\n\nAS A PRODUCT MANAGER INTERN, YOU WILL:\n• Assisting in translating requests into product specifications, collaborating with Design and Engineering teams to create scalable solutions.\n• Learning to write clear product specs that outline problems, user stories, business reasons, and requirements for desired solutions.\n• Supporting the team by responding to questions about the specs and updating them as needed.\n• Helping convert product specs into JIRA tickets and tracking features through their lifecycle.\n• Writing basic documentation for features when necessary.\n• Reviewing product features against specifications and working with the team to resolve any discrepancies.\n• Measuring impact and gathering user feedback to help iterate on solutions.\n• Learning to communicate effectively with various stakeholders, including clients, sales teams, developers, and designers.\n• Collaborating with customer-facing teams and other Product Managers to understand customer needs and help shape the product roadmap.\n\nEXPERIENCE & SKILLS:\n• Currently pursuing a degree in a related field (e.g., Business, Marketing, Computer Science).\n• Interest in product management and mobile app development.\n• Strong analytical skills with a willingness to learn how to track outcomes and inform decisions.\n• Ability to work collaboratively in a team environment.\n• Good verbal and written communication skills.\n• Adaptability and a problem-solving mindset.\n• Enthusiasm for learning and growing in the field of product management.",
            "job_is_remote": false,
            "job_posted_at": "16 hours ago",
            "job_posted_at_timestamp": 1732921200,
            "job_posted_at_datetime_utc": "2024-11-29T23:00:00.000Z",
            "job_location": "Quebec",
            "job_city": "Québec City",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 46.8130816,
            "job_longitude": -71.20745959999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DNbERnd205y5qo4dkAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "11202100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "vnIJn0FIbrbyISZgAAAAAA==",
            "job_title": "Co-op Summer 2025 - Software/Systems Engineering - 8-12 Months",
            "employer_name": "General Dynamics Mission Systems - Canada",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS2wXau8MLgwoTE-Q5C7Ai7-Tf8ts4_DqKMX5rR&s=0",
            "employer_website": "http://www.gdcanada.com/",
            "job_publisher": "ZipRecruiter",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://www.ziprecruiter.com/c/General-Dynamics-Mission-Systems-Canada/Job/Co-op-Summer-2025-Software-Systems-Engineering-8-12-Months/-in-Nepean,ON?jid=f2a8a889d3b6899c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": true,
            "apply_options": [
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/General-Dynamics-Mission-Systems-Canada/Job/Co-op-Summer-2025-Software-Systems-Engineering-8-12-Months/-in-Nepean,ON?jid=f2a8a889d3b6899c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "Recruit.net",
                    "apply_link": "https://www.recruit.net/job/summer-co-op-mechanical-pdg-jobs/B192A345243D1FC3?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobilize",
                    "apply_link": "https://www.jobilize.com/job/ca-ottawa-co-op-summer-2025-software-systems-engineering-8-12-months?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Kit Job",
                    "apply_link": "https://www.kitjob.ca/job/88605771/co-op-summer-2025-software-systems-engineering-8-12-months-w008-nepean/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Company Description\n\nAt General Dynamics Mission Systems-Canada, co-op positions mean hands-on impact. Join an inclusive team that engineers high technology solutions, products, and services that have a real-world impact.\n• Realize your Impact: Our work enables customers to successfully execute missions across diverse domains of operation. Your fresh perspectives and ideas have the power to shape real solutions, influence projects and drive meaningful change.\n• Kick-start your Career: Immerse yourself in various industry facets, gaining insights that span from cutting-edge technology to project management. Elevate your resume with a distinguished company to set the stage for a rewarding career, while paving the way for future full-time opportunities within General Dynamics.\n• Grow your Network: Work side by side with seasoned professionals who are excited to share their experience and develop your skills. Have meaningful interactions, ask questions, and build relationships that can lead to lasting industry connections.\n• Balance your Life: Our flexible environment is designed for you to thrive. With options to work from home or under a compressed nine-day fortnight schedule, we champion work-life balance, ensuring you have time for personal endeavors and your professional aspirations.\n\nOur success is fueled by our people and the wide variety of backgrounds, perspectives, and skills they bring to the business - learn more about our commitment to diversity, inclusion, and belonging here. We will work with you around any workplace accommodation required during our application process. If you require accommodation or have questions, please contact Human Resources via recruitment@gd-ms.ca.\nJob Description\n\nThe Applications Contract for the Land C4ISR Program is looking for a Co-op Software Engineer to join our team. We develop and integrate various software products that enable the Canadian Army to support and accomplish their missions. Our focus is predominantly on Battle Management and Planning applications. On this team, you can expect to work in an Agile development framework on a variety of different technologies, including deploying web-based server applications, and working with messaging networks over tactical radios.\n\nIn this role, you can expect to:\n• Implement software to meet the requirements, Definition of Done and Acceptance Criteria\n• Develop and perform tests and debugging of code\n• Identify defects, resolve issues and verify changes\n• Support and perform Product level test and integration efforts\n• Participate in code reviews\n• Participate in Agile ceremonies, including PI Planning, Sprint Planning, Daily Scrum, Sprint Review, and Sprint Retrospective\n• Expand knowledge of latest technologies, products and market trends relevant to area of work\n• Performing related duties as assigned\nQualifications\n• Currently pursuing a degree in Computer, Software, or Systems Engineering, Computer Science, or other related field.\n• Strong communication skills, both verbal and written.\n• Experience in, or interest to learn C#, Java, Python.\n• Experience with the Canadian Army is an asset.\n• Experience with AI models is an asset.\n• Experience with databases is an asset.\n• Experience with distributed systems is an asset.\n• Experience with automated testing is an asset.\n\nAdditional Information\n\nSecurity Clearance\n• Must be able to obtain and maintain Canadian Security Clearance and a positive Controlled Goods Assessment. Eligibility to work in Canada either as a Canadian Citizen or Permanent Resident.\n• Applicants may be required to meet additional security requirements in order to gain access to technical data, classified areas or information that is subject to international regulations.",
            "job_is_remote": false,
            "job_posted_at": "24 hours ago",
            "job_posted_at_timestamp": 1732838400,
            "job_posted_at_datetime_utc": "2024-11-29T00:00:00.000Z",
            "job_location": "Nepean, ON",
            "job_city": "Ottawa",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 45.334904599999994,
            "job_longitude": -75.7241006,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DvnIJn0FIbrbyISZgAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17214100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "6e7M2lMRRF07uXNgAAAAAA==",
            "job_title": "Project Engineer - Hydro",
            "employer_name": "Morson Canada",
            "employer_logo": null,
            "employer_website": "https://www.morsoncanada.com",
            "job_publisher": "Morson Canada",
            "job_employment_type": "Full-time, Part-time and Internship",
            "job_employment_types": [
                "FULLTIME",
                "PARTTIME",
                "INTERN"
            ],
            "job_apply_link": "https://www.morsoncanada.com/job/project-engineer-hydro?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Morson Canada",
                    "apply_link": "https://www.morsoncanada.com/job/project-engineer-hydro?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Project Engineer- Hydro\n• Job Location- Pointe Claire, Quebec, Canada or Ontario.\n• Hybrid schedule- 2 days remote/ 3 days on site\n• Salary range - $120,000 - $140,000 per year plus benefits\n• Job type- Permanent/Full time\n\nThis is a fantastic opportunity to join a leading hydropower company in North America who are part of a global technology group offering an extensive portfolio of sustainable products and solutions. The organization is committed to contributing to a sustainable future and helping customers achieve their sustainability goals.\n\nThe successful Hydro Project Engineer will serve as a vital link between engineering and project management, overseeing all technical activities in collaboration with the Engineering, Procurement, and Installation teams. This role acts as the primary technical contact for the project team and reports to the Project Manager within the team structure.\n\nResponsibilities include:\n• Oversee costs, delivery schedules, quality, and targets for assigned systems (e.g., generators, turbines, penstocks, gates, electrical power systems, or other designated components).\n• Contribute to the development of the overall project timeline and work breakdown structure.\n• Prepare purchase requisitions and participate in supplier negotiations.\n• Manage and monitor the entire process from design conceptualization to component delivery at the site.\n• Validate and approve supplier production schedules.\n• Handle technical clarifications with customers and suppliers.\n• Plan and lead design review meetings and manufacturing kick-offs.\n• Compile, assess, and approve required documentation, ensuring compliance with cost, schedule, and quality standards.\n• Prepare and submit technical deliverables.\n• Organize and facilitate technical meetings.\n• Ensure accurate interpretation of technical specifications and contractual expectations by stakeholders.\n• Collaborate with the Project Manager and Procurement Department to define the technical strategy and supply plan.\n• Participate in the selection, negotiations, and technical discussions with key suppliers and subcontractors.\n• Ensure timely delivery of engineering outputs and supplies that meet established quality criteria.\n• Address non-conformance issues and manage change requests with customers, vendors, and engineering teams.\n• Work with the Project Manager to analyze, plan, and implement contingency measures to address issues or deviations impacting the project.\n\nThis position requires a highly motivated individual with a positive attitude and a strong commitment to teamwork. The ideal candidate thrives in a complex, fast-paced environment with evolving priorities.\n\nSuccess in this role will require a results-driven and solution-oriented mindset, along with a proven ability to follow through on ideas and commitments. Given the large scale and multi-year timelines of the projects, perseverance is a highly valued trait.\n\nSkills/experience required include:\n• Bachelor’s degree in Mechanical or Electrical Engineering (preferred)\n• At least 5 years of professional experience, including a minimum of 5 years in design related to mechanical, electrical, or hydroelectric systems, with a focus on industrial equipment, power systems, or similar large-scale infrastructure projects\n• Minimum 3 years of experience in hydroelectricity or related design and manufacturing activities\n• Proven experience in technical coordination of engineering tasks and subcontracting\n• Strong verbal and written communication skills\n• Background in manufacturing or heavy industrial design\n• Proficiency in 3D/2D CAD design",
            "job_is_remote": false,
            "job_posted_at": "16 hours ago",
            "job_posted_at_timestamp": 1732921200,
            "job_posted_at_datetime_utc": "2024-11-29T23:00:00.000Z",
            "job_location": "Québec City, Quebec",
            "job_city": "Québec City",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 46.8130816,
            "job_longitude": -71.20745959999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D6e7M2lMRRF07uXNgAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17205100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "IKBZ4sv71DyzlWFzAAAAAA==",
            "job_title": "Commercial Banking Associate Intern/Co-op",
            "employer_name": "TD Bank",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQF5Hmv_DUJZzpz58TD6dLlsP_SyfwgVXPHgq7w&s=0",
            "employer_website": "http://www.td.com/",
            "job_publisher": "Indeed",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://emplois.ca.indeed.com/viewjob?jk=6b27377f7698d60e&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://emplois.ca.indeed.com/viewjob?jk=6b27377f7698d60e&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://fr.glassdoor.ca/job-listing/commercial-banking-associate-intern-co-op-td-JV_IC2280431_KO0,41_KE42,44.htm?jl=1009546324779&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/commercial-banking-associate-intern-co-op-at-td-4088304017?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.com/job-listing/commercial-banking-associate-intern-co-op-td-JV_IC2280431_KO0,41_KE42,44.htm?jl=1009546324779&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/t62fMvq4e4WG8H8bDh-LoVgvw2OVYUxTowjICQo8LaEw_h9U8JZpHQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Salary.com",
                    "apply_link": "https://www.salary.com/ca-job/td-bank/commercial-banking-associate-intern-co-op/j202411292354199718359?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "BeBee Canada Meet Opportunities",
                    "apply_link": "https://ca.bebee.com/job/89df76a9fffbb45b0c9d3b673c66f9f7?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Role Type:\nInternship/Co-op\n\nWork Term:\nSummer/Term 3\n\nWork Location:\nStratford, Ontario, Canada\n\nHours:\n37.5\n\nPay Details:\n$44,000 - $61,950 CAD\n\nTD is committed to providing fair and equitable compensation opportunities to all colleagues. Growth opportunities and skill development are defining features of the colleague experience at TD. Our compensation policies and practices have been designed to allow colleagues to progress through the salary range over time as they progress in their role. The base pay actually offered may vary based upon the candidate's skills and experience, job-related knowledge, geographic location, and other specific business and organizational needs.\n\nAs a candidate, you are encouraged to ask compensation related questions and have an open dialogue with your recruiter who can provide you more specific details for this role.\n\nJob Description:\n\nTD Commercial Banking provides financial solutions to North American businesses. Our broad range of products and services allows us to meet the needs of our clients in every sector, providing customized solutions to build a strategy that’s right for them now, and in the future. Our quest is to deliver a first-class business banking client experience and to be \"The Better Business Bank” in North America. At TD, better business bankers have a strong background in business and finance as well as the specific products they are responsible to sell and service. They have keen insight into all their clients – their industry, products, finances, and markets. Better business bankers demonstrate good judgment in people, businesses and markets based on education, experience, “gut instincts” and “street smarts”.\n\nAgriculture Services is seeking individuals interested in developing a career as an Associate within the agricultural business. In this unique position, you will partner with an experienced and knowledgeable Account Manager.\n\nYou will be provided with a coach and guidance as you take part in an intensive training and development program within our Agriculture Services, Business Banking.\n\nJob Requirements\n• You are working towards an undergraduate degree in Agricultural Sciences/Agriculture business or in another discipline that's combined with experience or knowledge of the agriculture business.\n• You demonstrate interest and ability in selling to and negotiating with agricultural clients.\n• You are also a motivated achiever with good analytical skills and very strong interpersonal skills and can work well independently in addition to being a strong team player.\n• You’re a well-rounded person who works well independently and as part of a team.\n• You have a strong desire to learn, grow and succeed.\n\nWhere you’re going:\n\nYour first 6-8 months will include on-site coaching in one of our commercial units, as well as a structured training program before moving up to become an Account Manager or Credit Analyst on a team with a Relationship Manager. Your future career path in TD Ag. Banking can include a variety of challenging roles in sales, relationship management, and risk management.\n\nFull mobility is required for this program.\n\nWho We Are\n\nTD is one of the world's leading global financial institutions and is the fifth largest bank in North America by branches/stores. Every day, we deliver legendary customer experiences to over 27 million households and businesses in Canada, the United States and around the world. More than 95,000 TD colleagues bring their skills, talent, and creativity to the Bank, those we serve, and the economies we support. We are guided by our vision to Be the Better Bank and our purpose to enrich the lives of our customers, communities and colleagues.\n\nTD is deeply committed to being a leader in customer experience, that is why we believe that all colleagues, no matter where they work, are customer facing. As we build our business and deliver on our strategy, we are innovating to enhance the customer experience and build capabilities to shape the future of banking. Whether you’ve got years of banking experience or are just starting your career in financial services, we can help you realize your potential. Through regular leadership and development conversations to mentorship and training programs, we’re here to support you towards your goals. As an organization, we keep growing – and so will you.\n\nOur Total Rewards Package\n\nOur Total Rewards package reflects the investments we make in our colleagues to help them and their families achieve their financial, physical, and mental well-being goals. Total Rewards at TD includes a base salary, variable compensation, and several other key plans such as health and well-being benefits, savings and retirement programs, paid time off, banking benefits and discounts, career development, and reward and recognition programs. Learn more\n\nAdditional Information:\nWe’re delighted that you’re considering building a career with TD. Through regular development conversations, training programs, and a competitive benefits plan, we’re committed to providing the support our colleagues need to thrive both at work and at home.\n\nPlease be advised that this job opportunity is subject to provincial regulation for employment purposes. It is imperative to acknowledge that each province or territory within the jurisdiction of Canada may have its own set of regulations, requirements.\n\nColleague Development\nIf you’re interested in a specific career path or are looking to build certain skills, we want to help you succeed. You’ll have regular career, development, and performance conversations with your manager, as well as access to an online learning platform and a variety of mentoring programs to help you unlock future opportunities. Whether you have a passion for helping customers and want to expand your experience, or you want to coach and inspire your colleagues, there are many different career paths within our organization at TD – and we’re committed to helping you identify opportunities that support your goals.\n\nTraining & Onboarding\nWe will provide training and onboarding sessions to ensure that you’ve got everything you need to succeed in your new role.\n\nInterview Process\nWe’ll reach out to candidates of interest to schedule an interview. We do our best to communicate outcomes to all applicants by email or phone call.\n\nAccommodation\nYour accessibility is important to us. Please let us know if you’d like accommodations (including accessible meeting rooms, captioning for virtual interviews, etc.) to help us remove barriers so that you can participate throughout the interview process.\n\nWe look forward to hearing from you!\n\nLanguage Requirement (Quebec only):\nSans Objet",
            "job_is_remote": false,
            "job_posted_at": "16 hours ago",
            "job_posted_at_timestamp": 1732921200,
            "job_posted_at_datetime_utc": "2024-11-29T23:00:00.000Z",
            "job_location": "Stratford, ON",
            "job_city": "Stratford",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.3700007,
            "job_longitude": -80.9822286,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DIKBZ4sv71DyzlWFzAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": "YEAR",
            "job_highlights": {},
            "job_onet_soc": "13205100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "t9YW8yQ7kwDlqDiKAAAAAA==",
            "job_title": "Mechanical Engineer Co-op",
            "employer_name": "Blue Robotics",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRKn-m8qxioqtvi5sbNDtHujDyJJYcMMYwy7pU_&s=0",
            "employer_website": "https://bluerobotics.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/mechanical-engineer-co-op-at-blue-robotics-4088143224?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/mechanical-engineer-co-op-at-blue-robotics-4088143224?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Talent.com",
                    "apply_link": "https://ca.talent.com/view?id=35a9cc491dbd&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "BeBee Canada Meet Opportunities",
                    "apply_link": "https://ca.bebee.com/job/3eb4c0f635d3b3940311889c8289b2fa?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobs Trabajo.org",
                    "apply_link": "https://ca.trabajo.org/job-3051-f64695311d8feed64c888a5915020c42?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "JobOffer.com",
                    "apply_link": "https://joboffer.com/jobs/Mechanical-Engineer-3b4dc34491f4f36e?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Term: Winter, Summer, and Fall 2025\n\nApprox. Start Dates:\n• Winter: January 6th, 2025\n• Summer: May 5th, 2025\n• Fall: September 2nd, 2025\n\nDeadline to apply:\n• Winter: November 29th, 2024\n• Summer: March 28th, 2025\n• Fall: July 31st, 2025\n\nHours per week: Minimum 40 hours\n\nDuration: 4 or 8 months\n\nPay rate: $25 CAD - $35 CAD per hour\n\nLocation: Victoria, BC\n\nAt Blue Robotics, we enable the field of marine robotics with affordable components and systems. What does this really mean? We design cool tech for use underwater that enables tons of people and organizations to pursue their audacious dreams of exploring and learning about our oceans and waterways.\n\nWe have a small and vibrant design team in Victoria, BC with a collaborative spirit that is both humble and bold. We work together to navigate all design steps from the whiteboard to fully tested, volume-manufactured products.\n\nWe are looking for a fledgling mechanical designer - someone with some CAD experience and a hunger to crank this up a few notches. If you:\n• have an innate desire to create new things,\n• noodle intently over your projects, and\n• yearn to expand your technical depth and understanding,\n\nthen you will likely be a great fit!\n\nWill it all be whipped cream and roses? Probably not. But as a team we’ll chip away at this awesome, fun and sometimes infuriating dream that we’ve decided deserves to become a reality. And don’t worry - you won’t get stuck on a manufacturing line - you’ll design real products and you’ll be given the same responsibility as any of our full-time engineers.\n\nResponsibilities\n• Design new and complex mechanical assemblies, such as pressure-rated enclosures, brushless motors, battery modules, connectors, lights, electronics trays, cameras, and vehicle frames\n• Evaluate system failure modes, create validation plans and support the execution of these plans\n• Component and vehicle-level testing for performance, durability, reliability, and variability\n• Design new lab testing equipment and perform lab testing\n• Find, communicate with, and build relationships with new suppliers\n\nBasic Qualifications:\n• Currently enrolled in an Engineering degree in a related field (Mechanical Engineering, Eng Phys, Mechatronics, etc.)\n• Proficiency in 3D modeling and drafting of components and assemblies in at least one CAD software package (Solidworks, NX, CATIA, Inventor, Fusion, Onshape, etc)\n• Strong and growing foundation in statics, dynamics, thermodynamics, and engineering materials\n• Designed, built, and tested some interesting things so far\n• Deep, insatiable impulse to understand, and leverage that understanding to create new things\n• Innate desire to collaborate, learn, and adapt\n\nBenefits:\n• Paid holidays, 48 hours PTO, educational reimbursement, relocation reimbursement\n\nTo apply for this position, click through to complete a brief application. Please provide a project portfolio, resume, and a brief cover letter. Project portfolios are accepted in any format (website, document, presentation, github, etc) - send us your solid models and assemblies for bonus points!",
            "job_is_remote": false,
            "job_posted_at": "21 hours ago",
            "job_posted_at_timestamp": 1732903200,
            "job_posted_at_datetime_utc": "2024-11-29T18:00:00.000Z",
            "job_location": "Victoria, BC",
            "job_city": "Victoria",
            "job_state": "British Columbia",
            "job_country": "CA",
            "job_latitude": 48.4284207,
            "job_longitude": -123.3656444,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dt9YW8yQ7kwDlqDiKAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17214100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "WGeH4ClVY5eRZUsNAAAAAA==",
            "job_title": "(PTL Canada) Sales and Operations Management Trainee",
            "employer_name": "Penske",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRydqUIomYHopaCPZ48G1frzmUsnueAA02r2Gv5&s=0",
            "employer_website": "http://www.pensketruckleasing.com/",
            "job_publisher": "Recruit.net",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://www.recruit.net/job/ptl-canada-sales-operations-management-jobs/751C97776F0BCE34?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Recruit.net",
                    "apply_link": "https://www.recruit.net/job/ptl-canada-sales-operations-management-jobs/751C97776F0BCE34?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Position Summary: Take charge. Think fast. Move forward. As a Sales and Operations Management Trainee in our fast-paced environment, you will use your hard-earned degree to run a business and quickly solve problems for our customers – who will depend on you to achieve success.\nPenske will introduce you to our sales processes, leading-edge technology and winning company culture through ongoing training and mentoring to help cultivate the skills and expertise you need to succeed in all aspects of our business: sales, operations, finance, customer service, technology and more. You’ll collaborate with a high-energy, driven team as you build a solid foundation in sales and operations. You’ll enjoy flexible schedules, excellent benefits, associate incentives and discount programs. You’ll be on the fast track to furthering your management career, with advancement opportunities at hundreds of our locations nationwide.\nLocation:\n79 Enterprise Dr S, London, ON N6N 1B9\nNOC code:\n60020 – Retail and wholesale trade managers\nResponsibilities: - Develop consumer and commercial customer solutions to local and national accounts - including many of the Fortune 500. - Manage our large inventory of world class and nationally recognized vehicles, balancing fleet productivity, profitability and customer satisfaction in a fast-paced and dynamic workspace - Generate new business leads as well as foster existing customer relationships - Ensure complete customer satisfaction in a fast-paced environment. - Other projects as assigned by the supervisor.\nQualifications: - Bachelor’s degree required, preferred concentration in Business or Marketing - Effective communication skills, both written and verbal - Internship or related work experience in a customer facing or sales role preferred - Results oriented, attention to detail and good time management skills - A valid Class G/ Class 5 driver’s license is required, as is the ability and willingness to drive our Penske vehicles, including a 26’ box truck - Regular, predictable, full attendance is an essential function of the job - Willingness to travel as necessary within the district (customers yards, close geographical area and training sites), work the required schedule, work at the specific location required, complete Penske employment application, submit to a reference check.\nPhysical Requirements: -The physical and mental demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. -The associate will be required to: read; communicate verbally and/or in written form; remember and analyze certain information; and remember and understand certain instructions or guidelines. -While performing the duties of this job, the associate may be required to stand, walk, and sit. The associate is frequently required to use hands to touch, handle, and feel, and to reach with hands and arms. The associate must be able to occasionally lift and/or move up to 25lbs/12kg. -Specific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception and the ability to adjust focus.\n\nPenske is committed to the principle of equity in employment - As part of this commitment, Penske endeavors to make its recruitment process accessible to any and all users. Reasonable accommodations will be provided, upon request, to applicants with disabilities in order to facilitate equal opportunity throughout the recruitment and selection process. Please contact Sarah Karan, Recruiter at (905) 819-8001 or sarah.karan@penske.com to make a request for reasonable accommodation during any aspect of the recruitment and selection process. This contact information is for accommodation requests only; do not use this contact information to inquire about the status of applications.\nAbout Penske Truck Leasing/Transportation Solutions Penske Truck Leasing/Transportation Solutions is a premier global transportation provider that delivers essential and innovative transportation, logistics and technology services to help companies and people move forward. With headquarters in Reading, PA, Penske and its associates are driven by a dedication to excellence and a commitment to customer success. Visit Go Penske to learn more.",
            "job_is_remote": false,
            "job_posted_at": "16 hours ago",
            "job_posted_at_timestamp": 1732921200,
            "job_posted_at_datetime_utc": "2024-11-29T23:00:00.000Z",
            "job_location": "Northwest Territories",
            "job_city": null,
            "job_state": "Northwest Territories",
            "job_country": "CA",
            "job_latitude": 63.588753,
            "job_longitude": -115.5069381,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DWGeH4ClVY5eRZUsNAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "11102100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "zE6K3CPJDYHAB8GzAAAAAA==",
            "job_title": "Marketing and Program Development",
            "employer_name": "Sail Superior.com Yacht Charter Adventures",
            "employer_logo": null,
            "employer_website": null,
            "job_publisher": "Indeed",
            "job_employment_type": "Full-time and Internship",
            "job_employment_types": [
                "FULLTIME",
                "INTERN"
            ],
            "job_apply_link": "https://ca.indeed.com/viewjob?jk=e0b099171aaf42db&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": true,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=e0b099171aaf42db&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://fr.simplyhired.ca/job/ol-IJHYAmB93nYywGyg0Nl1r-lY9pKCEXanSx5wBCtE-koJdFfvTlg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Location: Thunder Bay, ON\n\nCompany Description: Sail Superior offers a range of water-based adventures on Lake Superior, from exhilarating zodiac rides to serene sailing experiences. With a fleet of four vessels we cater to everything from short harbour tours to week long charters. We are deeply engaged with the local community and committed to providing exceptional and unique outdoor adventures.\n\nJob Summary: We are looking for a Marketing and Program Developer Intern to innovate and expand our offerings. This role is ideal for someone passionate about developing engaging programs that connect people with the natural beauty of Lake Superior and enhance our brand through thoughtful marketing strategies. This is a one-year internship that may lead to permanent employment.\n\nKey Responsibilities:\n• Lead and manage all aspects of digital marketing, including SEO enhancements and web initiatives to improve online presence and interaction.\n• Drive social media strategies and manage day-to-day interactions with our audience to increase engagement and brand awareness.\n• Facilitate person-to-person communications and client relationship building to foster strong, lasting partnerships.\n• New Product Build, Testing, and Launching:\n• Lead the development process for new offerings, from conceptualization and prototype testing to final product launch.\n• Collaborate with cross-functional teams to ensure product specifications meet market needs and company standards.\n• Oversee pilot projects and beta tests to gather data, refine product designs, and prepare for comprehensive rollouts. This will include participation in day trips, or longer tours and carters as part of the product roll out.\n• New Market Initiatives:\n• Identify and analyze new market opportunities to expand the company’s reach and impact.\n• Develop and implement targeted strategies for entering new segments, including demographic studies and partnership development.\n• Monitor and report on the progress of market entry strategies, adjusting tactics as needed to achieve business objectives.\n• Customer Relations:\n• Establish and maintain positive relationships with customers through regular communication and exceptional service.\n• Address customer inquiries and issues promptly, ensuring resolution to their satisfaction.\n• Develop customer feedback loops to gather insights and improve service delivery continuously.\n• IT Maintenance and Web Programming:\n• Perform routine maintenance on IT infrastructure to ensure systems are functioning optimally.\n• Update and manage website content and architecture, implementing new features and functionalities as required.\n• Collaborate with external IT service providers to resolve complex issues and ensure data security.\n• Graphic Design:\n• Design marketing materials and digital content that align with the brand’s aesthetic and promotional goals.\n• Create visual concepts that communicate ideas that inspire, inform, and captivate customers.\n• Work closely with the marketing team to ensure that all designs meet business needs and are consistent across various media.\n• Product Delivery Logistics:\n• Coordinate logistics for product distribution, ensuring timely and cost-effective delivery to customers.\n• Manage inventory levels, storage solutions, and transportation methods to optimize supply chain processes.\n• Work with vendors and logistics partners to negotiate contracts and manage relationships to ensure smooth operations.\n• Regulatory Compliance:\n• Liaise with regulatory bodies to maintain safe and compliant products, ensuring all company offerings adhere to legal and industry standards.\n\nInternship Eligibility (in collaboration with NOHFC):\n• New entrants into the workforce, transitioning to a new career, or the unemployed or underemployed who are entering a new field.\n• Have not previously participated in a NOHFC-funded internship.\n• Are at least 18 years of age.\n• Reside, and be legally entitled to work, in Canada.\n\nBenefits:\n• Competitive salary.\n• Opportunities for professional growth and development including advancement within the company.\n• Complimentary access to our adventure tours and programs.\n\nA dynamic and supportive workplace located in one of Canada’s most beautiful natural settings.\n\nThe selected candidate will have the following attributes:\n• A love of the outdoors and a passion for adventure.\n• A customer service-oriented mindset, dedicated to creating exceptional experiences.\n• Attention to detail, ensuring every aspect of the job is handled with care.\n• A strong commitment to safety, prioritizing the well-being of clients and colleagues.\n• The ability to work both independently and as part of a collaborative team.\n• Creativity and resourcefulness, bringing fresh ideas and innovative approaches.\n• Hands-on practical skills that can translate effectively into the marine and tourism industry.\n\nIf this sounds like you, we look forward to welcoming you aboard!\n\nJob Types: Full-time, Internship / Co-op\nContract length: 12 months\n\nPay: $29.00 per hour\n\nExpected hours: 35 per week\n\nSchedule:\n• Monday to Friday\n• Weekends as needed\n\nEducation:\n• Bachelor's Degree (required)\n\nLanguage:\n• English (required)\n\nWork Location: In person\n\nApplication deadline: 2024-12-06\nExpected start date: 2024-12-16",
            "job_is_remote": false,
            "job_posted_at": "17 hours ago",
            "job_posted_at_timestamp": 1732917600,
            "job_posted_at_datetime_utc": "2024-11-29T22:00:00.000Z",
            "job_location": "Thunder Bay, ON",
            "job_city": "Thunder Bay",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 48.3808951,
            "job_longitude": -89.2476823,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DzE6K3CPJDYHAB8GzAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": "HOUR",
            "job_highlights": {},
            "job_onet_soc": "13116100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "YSzLIaTnTPLjYt9jAAAAAA==",
            "job_title": "web marketing internship",
            "employer_name": "Corporate Stays",
            "employer_logo": null,
            "employer_website": "http://www.corporatestays.com/",
            "job_publisher": "ZipRecruiter",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://www.ziprecruiter.com/c/Corporate-Stays/Job/Web-Marketing-Internship/-in-Montreal,QC?jid=1dc26f652f5b2788&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/Corporate-Stays/Job/Web-Marketing-Internship/-in-Montreal,QC?jid=1dc26f652f5b2788&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Monteal, Quebec, PQ, CA H2X 1Y2 Contact Type: Employer Job Details Job Description: We are a highly successful entrepreneurial company ($20M+ annual sales) specializing in the sale and rental of exclusive properties around the world. Having grown exponentially over the last number of years to become a global leader in this niche market, we are now focusing on ensuring appropriate strategies and mechanisms are in place to support our evolving operations. In this specific capacity, you will provide critical leadership as: Responsibilities Write killer copy for web, press releases, social media outlets, and the company blog Brainstorm ideas on how to enhance the company brand through social media outlets such as Twitter and Facebook Effectively strategizing and implementing unique press campaigns Organize and plan company events around the world Assisting with business development opportunities Manage our growing photography team Job Requirements: Must be enrolled in college Enthusiastic about immersing yourself in one of the most exciting start-ups in the world Active and displayable interest in social media marketing Solid copy writing skills Strong organizational ability A keen eye for great web and graphic design Willingness to work hard and play even harder Management Position?\n\nNo Entry-Level Position? Yes Work Permit Needed? Applicants who do not already have legal permission to work in Canada will not be considered.\n\nJob Available: Immediately Industry Categories : Travel & Tourism, Corporate Housing, Hotel Apartments. Position Categories : Web Marketing, SEM, SEO, Landing page automation, Link building, Online Media, PPC advertising, Online PR, blogging. Compensation Salary Range: From 1000$ Bonus Plan?\n\nYES Accommodation? No Other: 3 Weeks Vacations with Free accommodations and Iphone for trainees with 1 year commitment.",
            "job_is_remote": false,
            "job_posted_at": "19 hours ago",
            "job_posted_at_timestamp": 1732910400,
            "job_posted_at_datetime_utc": "2024-11-29T20:00:00.000Z",
            "job_location": "Montreal, Quebec",
            "job_city": "Montreal",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 45.501886899999995,
            "job_longitude": -73.56739189999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DYSzLIaTnTPLjYt9jAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15119900",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "-u49zZc53-OtJ_mFAAAAAA==",
            "job_title": "Stagiaire en recherche - apprentissage automatique | Research Intern - Machine Learning",
            "employer_name": "Microsoft",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQHBzkjMQZFFUrAbc31ESQSBQWbihE5JtnoaDnp&s=0",
            "employer_website": "http://www.microsoft.com/",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/stagiaire-en-recherche-apprentissage-automatique-research-intern-machine-learning-at-microsoft-4088194762?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/stagiaire-en-recherche-apprentissage-automatique-research-intern-machine-learning-at-microsoft-4088194762?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "English Text Follows French\n\nAvis: Avant de soumettre votre candidature, veuillez vous diriger en bas de la page et choisir le site que vous préférez English | FR – (au pied de page). Sélectionnez ‘English’ si vous souhaitez communiquer uniquement en anglais, ou FR – Canada si vous préférez recevoir des communications écrites en anglais et en français.\n\nNous cherchons des Stagiaires en recherche pour se joindre à notre équipe et contribuer à l’avancement des projets clés et du programme en cours au laboratoire de Montréal. Les candidats auront l’occasion de collaborer étroitement avec d’autres laboratoires MSR, en particulier avec celui de New York, de la Nouvelle-Angleterre et de Redmond.\n\nEn tant que stagiaire, vous jouerez un rôle crucial dans le développement, l’amélioration et l’exploration des capacités des modèles d’IA. Votre travail aura une incidence importante sur le développement de technologies de pointe, en plus de permettre de faire progresser celles-ci et d’apporter des solutions pratiques aux problèmes réels du monde.\n\nNotre objectif consiste à faire progresser la recherche sur les modèles de base selon trois axes :\n• Le raisonnement, c’est-à-dire la décomposition de problèmes difficiles en étapes plus petites et la recherche efficace de solutions aux problèmes difficiles.\n• L’interaction, c’est-à-dire les modèles de formation qui peuvent interagir avec des environnements textuels, ainsi que recueillir et apprendre des commentaires.\n• La modularité, c’est-à-dire la création d’architectures linguistiques prêtes à l’emploi pour aider les modèles à répondre aux exigences propres à l’application et aux contraintes de ressources.\n\nMicrosoft Research Montréal offre un environnement propice à la recherche avancée, une politique de publications ouvertes et des collaborations avec des institutions universitaires renommées dans le domaine de l'intelligence artificielle à Montréal, comme MILA, ainsi que dans d'autres régions du monde.\n\n_______________________________________________________________________________________\n\nNotice: Before you submit your application, please scroll-down and select the site of your choice English | FR – Canada (in the footer). Select English to communicate with us only in English, FR – Canada if you prefer to receive written communication from us in both English and French.\n\nWe are seeking Research Interns to join our team and contribute to the advancement of key projects and agenda pursued in the Montreal lab. Research Interns will get an opportunity to interact with other MSR labs, and especially with the New York lab, New England lab and Redmond lab.\n\nAs a Research Intern, you will play a crucial role in developing, improving, and exploring the capabilities of AI models. Your work will have a significant impact on the development of cutting-edge technologies, advancing state-of-the-art and providing practical solutions to real-world problems.\n\nOur goal is to advance research on Foundation Models along three axes:\n• Reasoning, i.e. decomposing hard problems into smaller steps and efficiently searching for solutions to hard problems.\n• Interaction, i.e. training models that can interact with textual environments, can gather and learn from feedback.\n• Modularity, i.e. building plug-and-play language architectures to help models meet application-specific requirements and resource constraints.\n\nMicrosoft Research Montreal offers a supportive environment for cutting-edge research, an open publications policy, and close links to top academic institutions in the Montreal AI community, such as MILA, and around the world.\n\nResponsibilities\n\nLes stagiaires de recherche appliquent leur savoir théorique et méthodologique. En collaboration avec d'autres candidats au doctorat et certains des chercheurs les plus renommés au monde, ils acquièrent des connaissances, collaborent étroitement et tissent des liens professionnels durables. Non seulement ces stages permettent aux participants de progresser dans leur carrière, mais ils contribuent également à des avancées significatives en recherche et en développement. Durant le stage de 12 semaines, les stagiaires sont encadrés par des mentors, travaillent en équipe avec d'autres chercheurs, présentent leurs résultats et participent activement à la dynamique de la communauté scientifique. Les opportunités de stage sont disponibles dans tous les domaines de recherche et sont proposées tout au long de l’année, bien que les sessions débutent généralement en été.\n\nResearch Interns put inquiry and theory into practice. Alongside fellow doctoral candidates and some of the world’s best researchers, Research Interns learn, collaborate, and network for life. Research Interns not only advance their own careers, but they also contribute to exciting research and development strides. During the 12-week internship, Research Interns are paired with mentors and expected to collaborate with other Research Interns and researchers, present findings, and contribute to the vibrant life of the community. Research internships are available in all areas of research, and are offered year-round, though they typically begin in the summer.\n\nQualifications\n\nQualifications requises\n• Doit être actuellement inscrit à un programme de doctorat en informatique ou dans un domaine STIM connexe.\n\nAutres conditions\n• Les stagiaires de recherche doivent se rendre physiquement sur le site de travail Microsoft où leur responsable est basé pendant la durée de leur stage.\n• En plus des qualifications ci-dessous, vous devrez soumettre un minimum de deux lettres de recommandation pour ce poste, ainsi qu’une lettre de motivation et tout travail ou tout échantillon de recherche pertinent. Une fois votre candidature déposée, une demande de lettres pourrait être envoyée à votre liste de références en votre nom. Veuillez noter que nous ne demanderons pas de lettres de recommandation avant l’envoi de votre candidature et que nous ne demandons pas automatiquement des lettres pour tous les candidats. Nous vous suggérons de prévenir vos références afin qu’elles se préparent à envoyer votre lettre.\n\nQualifications Souhaitées\n• Expérience dans la gestion de projets à grande échelle de l’entraînement préliminaire ou de l’affinage des transformateurs/grands modèles de langage.\n• Expérience en apprentissage par renforcement, y compris le clonage de comportements à grande échelle et l’optimisation des politiques.\n• Expérience en création, en optimisation et en exécution de canaux d’apprentissage automatique à grande échelle.\n• Expérience en création de canaux de collecte et de conservation de données.\n• Capacité à collaborer, à communiquer efficacement et à travailler au sein d’une équipe multidisciplinaire.\n• Avoir un vif intérêt à l’application de la technologie au monde réel et à son incidence.\n• Expérience dans la promotion de la diversité, de l’inclusion et de l’appartenance dans un environnement de recherche.\n\nStagiaire, Microsoft Research (MSR) – l’échelle salariale de base typique pour ce rôle dans l’ensemble du Canada est de 8,700 $ CAD à 9,700 $ CAD par mois.\n\nPour plus d’informations au sujet de la rémunération, veuillez cliquer sur le lien : https://careers.microsoft.com/v2/global/en/canada-pay-information.html\n\nMicrosoft accepte les candidatures et les offres de processus pour ces rôles sur une base continue.\n\nMicrosoft est un employeur qui a accès à l'égalité d'accès à l'emploi. Tous les candidats qualifiés recevront une considération pour l'emploi sans égard à l'âge, l'ascendance, la couleur, le congé familial ou de soins médicaux, l'identité ou l'expression de genre, les informations génétiques, l'état matrimonial, l'état de santé, l'origine nationale, le handicap physique ou mental, l'affiliation politique, le statut d'ancien combattant protégé, la race, la religion, le sexe (y compris la grossesse), l'orientation sexuelle ou toute autre caractéristique protégée par les lois, règlements et ordonnances applicables. Si vous avez besoin d'aide et/ou d'une mesure d'adaptation raisonnable en raison d'un handicap pendant le processus de demande ou de recrutement, veuillez envoyer une demande via le formulaire de demande d'adaptation.\n\nLes avantages énumérés ci-dessous peuvent varier selon la nature de votre emploi chez Microsoft et du pays où vous travaillez.\n\n_______________________________________________________________________________________\n\nRequired Qualifications\n• Currently enrolled in a PhD program in Computer Science or a related STEM field.\n• At Microsoft, you will be working in an integrated fashion with colleagues around the world. To facilitate this collaboration, knowledge of English is required for this role. Proficiency in verbal and written communication in French is required for candidates residing in Quebec, otherwise it is considered an asset.\n\nOther Requirements\n• Research Interns are expected to be physically located in their manager’s Microsoft worksite location for the duration of their internship.\n• In addition to the qualifications below, you’ll need to submit a minimum of two reference letters for this position as well as a cover letter and any relevant work or research samples. After you submit your application, a request for letters may be sent to your list of references on your behalf. Note that reference letters cannot be requested until after you have submitted your application, and furthermore, that they might not be automatically requested for all candidates. You may wish to alert your letter writers in advance, so they will be ready to submit your letter.\n\nPreferred Qualifications\n• Experience in running large scale experiments with transformers/LLMs pre-training and/or finetuning. \n• Experience with reinforcement learning, including large scale behavior cloning and policy optimization.\n• Experience in creating, optimizing and running large scale machine learning pipelines. \n• Experience in building data collection and curation pipelines. \n• Ability to collaborate, communicate effectively, and work as part of a multi-disciplinary team.\n• Keen interest in real-world applications and impact.\n• Experience fostering diversity, inclusion and belonging in a research environment.\n\nIntern – MSR - The typical base pay range for this role across Canada is CAD $8,700 - CAD $9,700 per month.\n\nFind Additional Pay Information Here\n\nhttps://careers.microsoft.com/v2/global/en/canada-pay-information.html\n\nMicrosoft accepts applications and processes offers for these roles on an ongoing basis.\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
            "job_is_remote": false,
            "job_posted_at": "19 hours ago",
            "job_posted_at_timestamp": 1732910400,
            "job_posted_at_datetime_utc": "2024-11-29T20:00:00.000Z",
            "job_location": "Québec City, Quebec",
            "job_city": "Québec City",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 46.8130816,
            "job_longitude": -71.20745959999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D-u49zZc53-OtJ_mFAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        }
    ]
}