{
    "status": "OK",
    "request_id": "3bd0db08-5ca0-4988-b39d-a1aaeb9b4d23",
    "parameters": {
        "query": "intern jobs canada",
        "page": 1,
        "num_pages": 3,
        "date_posted": "today",
        "country": "ca",
        "language": "en"
    },
    "data": [
        {
            "job_id": "XUkEN5U4-6vRCQStAAAAAA==",
            "job_title": "Business  Analyst  Training  &  Internship  Program",
            "employer_name": "Ededge Groups",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSBqmD8MoVXc8193sIvncQH5ZirY0IX6StxV6-v&s=0",
            "employer_website": "https://www.ededgelearning.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/business-analyst-training-internship-program-at-ededge-groups-4086029394?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/business-analyst-training-internship-program-at-ededge-groups-4086029394?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jooble",
                    "apply_link": "https://ca.jooble.org/jdp/1380534003675026066?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Company Description\n\nEdedge is a ground-breaking organization dedicated to nurturing the potential of our youth and empowering them to explore the vast world of technology and other high-growth fields. We have conducted numerous inspiring webinars that have reached an audience exceeding 100 individuals. Our upcoming initiatives will provide invaluable learning experiences by allowing audiences to gain insights from accomplished leaders, who will share not only their successes but also their journeys through failure. Despite our accomplishments, we remain dedicated to continuous growth, as our ultimate goal is to advance collectively as an organization and as a community. We elevate the industry of Ed-Tech by bringing in the training in the specific fields along with the industry experience.\n\nVisit Our Website to know about us : www.ededgelearning.com\n\nRole Description\n\nThis is a remote internship role for a Business Analytics Training & Internship Program. The role will involve day-to-day tasks related to data analytics, including data management, data analysis, data modeling, and developing analytical skills. The intern will have the opportunity to work on real-world data projects and gain practical experience in the field of data analytics.\n\nResponsibilities\n• Work closely with our esteemed data science team to gather, refine, and analyze extensive datasets, refining skills in data preprocessing and visualization.\n• Apply machine learning and data mining methods to derive insights from large datasets, including identifying Excel interface structures.\n• Utilize Python programming for Exploratory Data Analysis (EDA) in practical business contexts, with a focus on risk analytics in banking and finance.\n• Develop scientific tests and optimize model performance using cutting-edge modeling technologies such as no-code databases and data mining.\n• Collaborate with a multidisciplinary team to construct machine learning pipelines for various applications in commerce, finance, and procurement.\n• Engage with internal stakeholders to explore and comprehend business data, develop hypotheses, and evaluate strategies using techniques like T-tests.\n• Address specific challenges and devise innovative solutions by leveraging modeling technologies such as bike share systems.\n• Acquire and apply advanced analytical techniques using tools like Tableau.\n• Create reports and presentations to effectively convey data analysis methodologies and findings.\n\nQualifications\n• Strong problem-solving and critical thinking abilities\n• Currently pursuing any degree showcasing a strong commitment to continuous learning and professional growth.\n• Excellent communication and teamwork skills\n• Ability to work independently and remotely\n\nLocation : Greater Toronto Area, Canada ( Remote )\n\nNote : This is an unpaid internship. Upon application, our team will contact you to proceed with the application details and joining process.",
            "job_is_remote": false,
            "job_posted_at": "14 hours ago",
            "job_posted_at_timestamp": 1732982400,
            "job_posted_at_datetime_utc": "2024-11-30T16:00:00.000Z",
            "job_location": "Canada",
            "job_city": null,
            "job_state": null,
            "job_country": "CA",
            "job_latitude": 56.130365999999995,
            "job_longitude": -106.34677099999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DXUkEN5U4-6vRCQStAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13111100",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "liyk2u0XoACpB_g9AAAAAA==",
            "job_title": "Freelance Social Media Intern Assistant – Part-Time",
            "employer_name": "Razia Media Inc.",
            "employer_logo": null,
            "employer_website": null,
            "job_publisher": "Indeed",
            "job_employment_type": "Part-time and Internship",
            "job_employment_types": [
                "PARTTIME",
                "INTERN"
            ],
            "job_apply_link": "https://ca.indeed.com/viewjob?jk=d523ad1b1fc726cc&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": true,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=d523ad1b1fc726cc&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/nNegeROYfFfSUx43nFAbTdY3IM3Ht7NeI1m2DSxON-IRIy46UG_UYg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Freelance Social Media Intern Assistant – Part-Time\n\nLocation: Downtown Toronto, ON\n\nType: Freelance, Part-Time\n\nAbout the Role:\n\nI’m seeking a dynamic, motivated Social Media Intern Assistant to help bring my vision to life across TikTok, Instagram, and YouTube. This role is perfect for someone passionate about content creation and eager to gain hands-on experience in the fashion and lifestyle space.\n\nResponsibilities:*\n\n- Assist with capturing content for social media (Reels, TikToks, Stories).\n\n- Help with brand outreach and communication.\n\n- Support in organizing and planning shoots.\n\n- Collaborate on creative concepts and execution.\n\nRequirements:\n\n- Must be available to travel to downtown Toronto.\n\n- Familiarity with TikTok, Instagram, and YouTube (posting, trends, and audience engagement).\n\n- Strong organizational and communication skills.\n\n- A passion for fashion, lifestyle, and digital media.\n\nWhy Join?\n\nThis is an exciting opportunity to work closely with an established creator and gain real-world experience in social media management, brand collaboration, and content creation.\n\nJob Types: Part-time, Casual, Freelance, Internship / Co-op\nContract length: 12 months\n\nPay: $15.55-$20.00 per hour\n\nExpected hours: 3 per week\n\nBenefits:\n• Flexible schedule\n• Work from home\n\nSchedule:\n• Day shift\n• Evening shift\n• Morning shift\n• Weekends as needed\n\nAbility to commute/relocate:\n• Toronto, ON (M6K): reliably commute or plan to relocate before starting work (preferred)\n\nExperience:\n• TikTok, Instagram and YouTube Use: 1 year (preferred)\n• Sales: 1 year (preferred)\n\nWork Location: Hybrid remote in Toronto, ON (M6K)\n\nExpected start date: 2024-12-09",
            "job_is_remote": false,
            "job_posted_at": "15 hours ago",
            "job_posted_at_timestamp": 1732978800,
            "job_posted_at_datetime_utc": "2024-11-30T15:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dliyk2u0XoACpB_g9AAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": "HOUR",
            "job_highlights": {},
            "job_onet_soc": "27303100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "bgxUuSCzgFxuAiz2AAAAAA==",
            "job_title": "Data Analytics Internship",
            "employer_name": "Refonte Learning",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS_lpdvgj87i4JqBmH2Z89HSOuJkV5-2cLq9_C1&s=0",
            "employer_website": "https://www.refontelearning.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/data-analytics-internship-at-refonte-learning-4088611878?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/data-analytics-internship-at-refonte-learning-4088611878?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "BeBee Canada Meet Opportunities",
                    "apply_link": "https://ca.bebee.com/job/5f95b78d5b89c89e5d665379deb191cc?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Kit Job",
                    "apply_link": "https://www.kitjob.ca/job/88692371/data-analytics-internship-j-478-canada/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Data Analytics Intern (Remote – Canada)\n\nCompany: Refonte (Refonte AI)\n\nAre you passionate about data and eager to make a real-world impact? Refonte AI, a global leader in IT and Ed-tech, is searching for enthusiastic, driven individuals to join our Data Analytics Internship Program. This is a unique opportunity to gain hands-on experience, work with advanced analytics tools, and build the skills needed to succeed in a high-growth industry.\n\n🌐Learn More: https://refontelearning.com/\n\nAbout Refonte AI\n\nRefonte AI is a forward-thinking company specializing in IT and digital services, empowering professionals and businesses globally. Our expertise spans data analytics, data science, digital marketing, cybersecurity, UI/UX design, and web development. Known for our commitment to innovation, we’re excited to provide aspiring analysts with a chance to make a real impact through our RIGTIP (Refonte Global Training & Internship Program).\n\nWhy Join Us?\n\nOur Data Analytics Internship is crafted to help you develop critical data skills, offering real-world projects and collaboration with a diverse team across North America, Asia, Europe, and Oceania. With flexible, remote work arrangements, you’ll work alongside seasoned professionals, enhance your analytical abilities, and create a solid foundation for a rewarding career in data analytics.\n\nRoles & Responsibilities\n\nAs a Data Analytics Intern, you’ll have the opportunity to:\n• Analyze large datasets to extract actionable insights and drive data-backed decisions for real projects.\n• Develop and automate data visualizations and dashboards to communicate trends, patterns, and key performance indicators.\n• Collaborate with cross-functional teams to assist in building data models and conducting analyses to support strategic initiatives.\n• Utilize industry-standard tools such as SQL, Python, R, and Tableau to analyze and visualize complex data sets.\n• Perform data cleaning, preprocessing, and transformation to ensure data accuracy and reliability.\n• Assist in predictive analytics and contribute to building machine learning models to support data-driven decisions.\n• Present findings and recommendations to help improve business processes and strategies.\n\nWhat You’ll Gain\n• Hands-On Experience: Work with actual data and projects that impact businesses.\n• Technical Skills: Gain proficiency in analytics tools and methodologies.\n• Global Network: Collaborate with an international team of professionals.\n• Mentorship: Receive guidance from experienced data experts who support your growth.\n\nQualifications\n• Currently pursuing a degree in Data Science, Computer Science, Statistics, Business Analytics, or a related field.\n• Strong analytical and problem-solving skills, with a keen interest in data analytics.\n• Familiarity with SQL, Python, R, and data visualization tools (e.g., Tableau, Power BI).\n• Excellent communication skills for sharing insights and collaborating within teams.\n• Ability to work independently and with a team, showing adaptability and enthusiasm for learning.\n\nAdditional Details\n\nThis is an unpaid internship within our Data Analytics Training & Internship Program under RGTIP. Upon application, our team will reach out with further information on the selection process and onboarding.\n\n🌐Learn More: https://refontelearning.com/\n\nLocation\n\nRemote (Canadian applicants preferred)\n\nDon’t miss this exciting opportunity to begin your data analytics career! Join Refonte AI and turn data into powerful insights that drive change.\n\nApply Now!",
            "job_is_remote": false,
            "job_posted_at": "9 hours ago",
            "job_posted_at_timestamp": 1733000400,
            "job_posted_at_datetime_utc": "2024-11-30T21:00:00.000Z",
            "job_location": "Canada",
            "job_city": null,
            "job_state": null,
            "job_country": "CA",
            "job_latitude": 56.130365999999995,
            "job_longitude": -106.34677099999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DbgxUuSCzgFxuAiz2AAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "43911100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "oJrIVCO8Q-MG2xkhAAAAAA==",
            "job_title": "Reservoir Simulation Engineer Internship (May 2025 – August 2026)",
            "employer_name": "Computer Modelling Group",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTBI8S33BGdc0ZaERUwb_9QnaaO7vgecExc7GOM&s=0",
            "employer_website": null,
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/reservoir-simulation-engineer-internship-may-2025-%E2%80%93-august-2026-at-computer-modelling-group-4088450244?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/reservoir-simulation-engineer-internship-may-2025-%E2%80%93-august-2026-at-computer-modelling-group-4088450244?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "People are our most valuable asset.\n\nPeople are our most valuable asset.\n\nAs part of the Customer Success & Consulting team, the successful candidate will play an active role in the delivery of high-quality support, training & consulting services to end users and customers of CMG in a global setting.\n\nCMG is a worldwide leader in its field, thanks to its great staff who consistently deliver superior technology and unparalleled customer service. With approximately 200 employees in nine countries, CMG fosters a small-company culture in an organization with global presence. We have recently purchased additional companies called Bluware and Sharp Reflections; broadening our portfolio.\n\nCMG’s head office is located in the University Research Park at 3710 33 Street NW, Calgary (across from the Brentwood LRT station).\n\nKey Responsibilities\n\nAs a Member Of a World-wide Team In The Customer Success & Consulting (CSC) Group Of CMG, You Will Be Providing Reservoir Engineering And Simulation Assistance To CMG’s Reservoir Simulation Software Clients In a Global Setting. Specific Opportunities Include\n• Becoming familiar with oil and gas recovery processes with emphasis on advanced EOR processes\n• Becoming skilled in performing reservoir engineering studies\n• Becoming skilled in performing production engineering studies, including wellbore and facility design\n• Becoming adept at processes such as CO2 sequestration & EOR as well as Geothermal modelling to lead our clients into the energy transition\n• Becoming proficient with CMG’s software suite, including the graphical pre- and post-processors, EOS phase behavior software and CMG’s reservoir simulators\n• Play a leading role in supporting CMG clients who use the software for a variety of challenging and leading-edge petroleum reservoir recovery processes\n• Provide and assist with training to CMG clients when required\n• Assist senior consultants with simulation studies conducted for clients worldwide\n\nThe above statements are intended only to describe the general nature of the job and should not be construed as an all-inclusive list of position responsibilities.\n\nKnowledge, Skills & Experience\n• Targeted Programs: ENBI, ENCH, ENER, ENOG\n• This position requires the ability to communicate clearly both orally and verbally.\n• The candidate will show initiative, including asking for help when needed, and excellent problem solving and analytical skills.\n• This position requires strong interpersonal skills to assist in developing good client relationships.\n• A strong interest in reservoir engineering is a requirement.\n• Knowledge of geology and petrophysics will be an asset (but not a requirement), as well experience with MS PowerPoint and Excel.\n\nApply Now",
            "job_is_remote": false,
            "job_posted_at": "20 hours ago",
            "job_posted_at_timestamp": 1732960800,
            "job_posted_at_datetime_utc": "2024-11-30T10:00:00.000Z",
            "job_location": "Calgary, AB",
            "job_city": "Calgary",
            "job_state": "Alberta",
            "job_country": "CA",
            "job_latitude": 51.044733099999995,
            "job_longitude": -114.0718831,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DoJrIVCO8Q-MG2xkhAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17217100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "aqjFZU0IFobMHqOhAAAAAA==",
            "job_title": "Mechanical Design Intern",
            "employer_name": "Dana Incorporated",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTW8gM1MyYpJ14BkYU4NjWV0_7cAf51NwL-b58E&s=0",
            "employer_website": "https://www.dana.com",
            "job_publisher": "Careers At Dana Incorporated",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://jobs.dana.com/job/Boucherville-Mechanical-Design-Intern-Queb-Canada/1229197000/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Careers At Dana Incorporated",
                    "apply_link": "https://jobs.dana.com/job/Boucherville-Mechanical-Design-Intern-Queb-Canada/1229197000/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/Dana-Incorporated/Job/Mechanical-Design-Intern/-in-Boucherville,QC?jid=64f3fc2db8952067&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=639bf5bbff7329b7&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/mechanical-design-intern-dana-incorporated-JV_IC4036620_KO0,24_KE25,42.htm?jl=1009511508608&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/hTamzSwg8feu4HkCB8feZ89k_kLb088h7Ms_-1S5kqI5d4z7fqJfBA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jooble",
                    "apply_link": "https://ca.jooble.org/jdp/2526417624756442834?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Talent.com",
                    "apply_link": "https://ca.talent.com/view?id=af8b7f8a8494&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "BeBee Canada Meet Opportunities",
                    "apply_link": "https://ca.bebee.com/job/1268ecc651df5b3c3da37c621901b598?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Purpose\n\nAs a Mechanical Design Intern, you'll be involved in all stages of the high-voltage traction system life cycle, from architecture to design and validation, right through to production. You'll be at the forefront of supporting the various production lines, whether in Quebec, China or India. You'll be at the heart of a team of experts from all fields, and you'll have to use your imagination and creativity to ensure the efficiency and quality of Dana TM4 traction systems.\n\nJob Duties and Responsibilities\n\nResponsibilities:\n\n- Design mechanical parts and assemblies for traction systems (motors and inverters);\n\n- Consider thermal and structural constraints;\n\n- Perform analytical calculations and collaborate with the advanced calculations team;\n\n- Assemble and validate new prototypes or proofs of concept;\n\n- Support production start-up;\n\n- Participate in and lead design reviews of components and complete products;\n\nRequirements:\n\n- Bachelor's degree in mechanical engineering or equivalent field;\n\n- Experience in automotive mechanical design, an asset;\n\n- Knowledge of the following manufacturing processes, an asset: metal and plastic injection molding, stamping.\n\n- Resourcefulness\n\n- Interest in transportation electrification an asset;\n\n- Knowledge of NX and Team Center, an asset\n\n- Demonstrated ability to document work;\n\n- Ability to work in multidisciplinary teams;",
            "job_is_remote": false,
            "job_posted_at": "22 hours ago",
            "job_posted_at_timestamp": 1732953600,
            "job_posted_at_datetime_utc": "2024-11-30T08:00:00.000Z",
            "job_location": "Boucherville, Quebec",
            "job_city": "Boucherville",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 45.591369799999995,
            "job_longitude": -73.4364097,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DaqjFZU0IFobMHqOhAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17301300",
            "job_onet_job_zone": "3"
        },
        {
            "job_id": "lMISaS_aFUZyV0RPAAAAAA==",
            "job_title": "MITACS Postdoctoral Intern",
            "employer_name": "Micro Nano Lab University of Windsor",
            "employer_logo": null,
            "employer_website": null,
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/mitacs-postdoctoral-intern-at-micro-nano-lab-university-of-windsor-4088619202?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/mitacs-postdoctoral-intern-at-micro-nano-lab-university-of-windsor-4088619202?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "MITACS Postdoctoral Intern – MEMS Fabrication\n\nPosition Description: MicroNano Mechatronics research lab from the Department of Mechanical, Automotive, and Materials Engineering at the University of Windsor and Montreal based industry partner Stathera Inc is seeing a MITACS postdoctoral intern starting immediately. We are seeking an outstanding, highly motivated candidate for an immediate postdoctoral researcher opening working in the field of Microelectromechanical Systems (MEMS) based oscillator and timing device development. The candidate will take a leading role in the manufacturing, characterizing, and testing of MEMS-based resonators. The MITACS internship location is Montreal, Quebec. The project is part of an industrial collaborative research between the University of Windsor and the renowned MEMS industry Stathera Inc developing next generation MEMS timing devices. The projects aim to develop MEMS-based high-precision and temperature-stable resonating systems.\n\nMain Responsibilities: The range of responsibilities includes but is not limited to:\n\n hands-on MEMS fabrication in cleanroom\n\n layout design for fabrication\n\n hands-on MEMS characterization (microscopy) and electrical testing of MEMS resonators\n\n interpret results, identify, and propose design improvements\n\n interface and liaison with the industrial partner and work with the team\n\n provide feedback on fabrication, tests, analysis, and design\n\n write manuscripts and reports, publication and presentations of the research results\n\nResearch Environment: MicroNano Mechatronics Lab at the University of Windsor is developing various innovative micro/nano resonating sensing methods and systems. The group is continuously innovating high-precision and ultra-sensitive micro/nano sensing devices. Our partner Stathera’s core activity is innovating and commercializing semiconductor timing devices and they have an excellent team. For information about MicroNano Mechatronics Group, please visit http://www.uwindsor.ca/micronano\n\nQualifications: Should have PhD in Mechanical or Electrical or Microsystems or relevant field. Prospective candidates should have previous strong background and experience in MEMS fabrication, layout design, testing, and characterizing. Understanding of basic physics and working principles of MEMS inertial device design. Working with a cross-functional engineering team including design, fabrication, and packaging. Strong written and verbal communication skills are required for this position, especially in the context of a highly collaborative effort. As part of the MITACS Postdoctoral internship, the applicant will be required to perform research and fabrication at partner organization facility located in Montreal, Quebec and collaborate closely with graduate and undergraduate students with multidisciplinary backgrounds. The initial appointment will be for one year with a possible extension. The position is expected to start as soon as possible; however, the start date is negotiable. Applications will be considered until the position is filled. Please email a CV and contacts of 3 professional references. Interested candidates are encouraged to contact Prof. Jalal Ahamed (jahamed@uwindsor.ca). We thank all applicants in advance for their interest, however, only those under consideration will be contacted.\n\nInstitution: The University of Windsor is a comprehensive research and teaching institution with more than 16,000 students. The University of Windsor is situated on the traditional territory of the Three Fires Confederacy of First Nations, which includes the Ojibwa, the Odawa, and the Potawatomi. We are a welcoming community committed to equity, diversity, inclusion, and accessibility in our teaching, learning, and work environments. In pursuit of the University's commitment to employment equity, members from the designated groups (women, Indigenous/Aboriginal (First Nations, Métis, Inuit) persons, racialized persons/visible minorities, persons with disabilities, and persons of a minority sexual orientation and/or gender identity) are encouraged to apply and to self-identify. For more information about the university, please visit the University website at http://www.uwindsor.ca",
            "job_is_remote": false,
            "job_posted_at": "8 hours ago",
            "job_posted_at_timestamp": 1733004000,
            "job_posted_at_datetime_utc": "2024-11-30T22:00:00.000Z",
            "job_location": "Windsor, ON",
            "job_city": "Windsor",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 42.3149367,
            "job_longitude": -83.03636329999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DlMISaS_aFUZyV0RPAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "25106600",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "5Gw3cwEGNdK2n474AAAAAA==",
            "job_title": "Software Engineer (Intern) Canada",
            "employer_name": "Cisco",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRmoS08buVahWTvUWagz-dsle_e6YlFB8jLOG3C&s=0",
            "employer_website": "https://www.cisco.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/software-engineer-intern-canada-at-cisco-4034653822?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/software-engineer-intern-canada-at-cisco-4034653822?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=0e3cc5b40c850bb7&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Cisco Careers Jobs",
                    "apply_link": "https://ciscocareers.dejobs.org/kanata-on/software-engineer-intern-canada/C4CE35F034F84E259B2E3DAD9D10E18C/job/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/FPq6wE9oyY4wIZ4Y1oOmau4XAKF7lYUf7jUo5-iZ5CEvs9QbvGBvhA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Monster.ca",
                    "apply_link": "https://www.monster.ca/job-openings/24afb914-1561-4644-889e-11dca1779360?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Huzzle",
                    "apply_link": "https://www.huzzle.app/internships/software-engineer-intern-canada-421261?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Recruit.net",
                    "apply_link": "https://www.recruit.net/job/software-engineer-canada-jobs/2BD867B50C1B6B98?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Talentify",
                    "apply_link": "https://www.talentify.io/job/software-engineer-intern-canada-kanata-ontario-cisco-systems-1426800?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Applications are accepted until further notice.\n\nPlease note this posting is to advertise potential job opportunities. This exact role may not be open today but could open in the near future. When you apply, a Cisco representative may contact you directly if a relevant position opens.\n\nWho You’ll Work With\n\nOur hardworking team members are busy programming magic across the globe on teams such as Engineering, Information Technology, Supply Chain, Customer Experience, Security and Trust, etc.\n\nYou would play a crucial role in driving next-gen software innovations including cloud, mobile, desktop or security spaces. On any of these teams, you'll get hands-on experience working with applications that make technology accessible no matter what device they’re on. See the possibilities when creativity meets design and build solutions which will transform how we work, live, learn, and play.\n\nWhat You’ll Do\n\nOur software engineers are the gurus behind the scenes, ensuring all of our programs are easy to use and bug free. Using a keen eye, you’ll develop software and tools in support of many of our high-impact technology platforms such as operating systems, networks, databases and more. While we’re growing in the software business, you’ll still need to see the big picture and watch for hardware compatibility while even potentially influencing design.\n\nUnsure where to start? Apply and explore all of the possibilities in: Applications Development, Database Development, Embedded Networking and OS Development, IT, Security, Test & Quality, Web Services, etc.\n\nWho You Are\n\nA software developer who demonstrates exceptional communication and collaboration abilities, coupled with a genuine enthusiasm for tackling complex challenges. The ideal candidate will exhibit outstanding organizational skills and a keen aptitude for managing their time efficiently.\n\nAs a process-driven individual, you will have a fervent desire to streamline and enhance existing procedures. Your adeptness in time management will empower you to effectively prioritize tasks and deliver high-quality work within set deadlines.\n\nJoin our team and apply your passion for problem-solving to create innovative software solutions that make a difference.\n\nMinimum Qualifications\n• Including but not limited to an upcoming graduate of a technical degree or certification program from a Technical Boot Camp, Apprenticeship, Community College or 4-Year University.\n• Actively enrolled in an educational program in Computer Science, Software Engineering, Computer Engineering, Electrical Engineering or related field\n• Up-to-date on programming and scripting languages: C/C++, Python, and/or Java\n• Hands on QA, Testing, and/or Debugging skills\n• Able to legally live and work in the country for which you’re applying and have an authorized internship with your school\n\nPreferred Qualifications\n• Knowledge of Linux, Networking concepts, OS fundamentals, Embedded Development, and/or ML\n• Experience with Databases, Web Application Development, and Web Services\n• Knowledge in Computer Networking and/or Cybersecurity\n• Knowledge of Cloud Platforms: AWS, Microsoft Azure, or Google Cloud\n\nWhy Cisco\n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.\n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (40 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box!\n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.)\n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward.\n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!\n\nIngénieur logiciel (stagiaire) Canada\n\nLes candidatures sont acceptées jusqu’à nouvel ordre.\n\nVeuillez noter que cet affichage vise à annoncer des possibilités d’emploi potentielles. Ce poste précis n’est peut-être pas ouvert aujourd’hui, mais pourrait l’être dans un avenir proche. Lorsque vous postulez, un représentant de Cisco peut communiquer directement avec vous si un poste pertinent se libère.\n\nVos collègues\n\nNotre équipe de travailleurs acharnés crée des solutions magiques utilisées dans le monde entier au sein d’équipes telles que l’ingénierie, les technologies de l’information, la chaîne d’approvisionnement, l’expérience client, la sécurité et la confiance, etc.\n\nVous joueriez un rôle essentiel dans le développement d’innovations logicielles de nouvelle génération dans les domaines de l’infonuagique, de la mobilité, des environnements de bureau ou de la sécurité. Au sein de l’une de ces équipes, vous pourriez acquérir une expérience pratique avec des applications qui rendent la technologie accessible, quel que soit l’appareil sur lequel elle se trouve. Découvrez les possibilités qui prennent forme lorsque la créativité mène à la conception et à la création de solutions qui transforment notre façon de travailler, de vivre, d’apprendre et de jouer.\n\nVos fonctions\n\nNos ingénieurs en logiciels sont des gourous qui travaillent en coulisse et qui font en sorte que tous nos programmes sont faciles à utiliser et sans bogue. Avec un œil attentif, vous développerez des logiciels et des outils intégrés à plusieurs de nos plateformes technologiques parmi les plus importantes, telles que les systèmes d’exploitation, les réseaux, les bases de données, etc. Bien que nous soyons de plus en plus présents dans le domaine des logiciels, vous devrez adopter une vision élargie et assurer la compatibilité avec les équipements et possiblement exercer une influence sur leur conception.\n\nVous ne savez pas par où commencer? Soumettez votre candidature et explorez les possibilités qui s’offrent à vous dans les domaines suivants : développement d’applications, développement de bases de données, développement de systèmes d’exploitation et de réseaux intégrés, TI, sécurité, tests et qualité, services Web, etc.\n\nVos atouts\n\nVous êtes un développeur de logiciels qui fait preuve de capacités exceptionnelles de communication et de collaboration, ainsi que d’un véritable enthousiasme à relever des défis complexes. Le candidat idéal démontrera des compétences organisationnelles exceptionnelles et une grande aptitude à gérer son temps efficacement.\n\nEn tant que personne axée sur les processus, vous aurez un désir ardent de simplifier et d’améliorer les procédures existantes. Votre maîtrise de la gestion du temps vous permettra de hiérarchiser efficacement les tâches et de présenter un travail de haute qualité dans les délais fixés.\n\nJoignez-vous à notre équipe et appliquez votre passion pour la résolution de problèmes de manière à créer des solutions logicielles novatrices qui font la différence.\n\nQualifications Minimales\n• Y compris, mais sans s’y limiter, un futur diplômé technique ou un programme de certification d’un camp d’entraînement technique, d’un programme d’apprentissage, d’un collège communautaire ou d’une université de quatre ans.\n• Être activement inscrit à un programme de formation en informatique, en génie logiciel, en génie informatique, en génie électrique ou dans un domaine connexe\n• Vos connaissances des langages de programmation et de scriptage sont à jour : C/C++, Python ou Java\n• Compétences pratiques en assurance qualité, tests ou débogage\n• Être en mesure de vivre et de travailler légalement dans le pays dans lequel vous postulez et d'obtenir un stage autorisé auprès de votre université\n\nQualifications Recherchées\n• Connaissance de Linux, des concepts de mise en réseau, des principes fondamentaux des systèmes d'exploitation, du développement embarqué ou de l'AA\n• Expérience avec les bases de données, le développement d'applications Web, et les services Web\n• Connaissances en réseautique ou en cybersécurité\n• Connaissance des plateformes en nuage : AWS, Microsoft Azure ou Google Cloud\n\nPourquoi choisir Cisco?\n\n#NoussommesCisco signifie que chaque personne est unique, mais qu’elle met son talent au service de l’équipe afin d’apporter sa contribution et d’œuvrer en faveur d’un avenir inclusif pour tous.\n\nNous adhérons aux technologies numériques et aidons nos clients à mettre en œuvre des changements dans leurs entreprises numériques. Certains nous pensent peut-être « vieux » (40 ans de réussites!) et axés seulement sur le matériel, mais nous sommes également une entreprise de logiciels Et une entreprise axée sur la sécurité. Nous avons même inventé un réseau intuitif qui s’adapte, prédit, apprend et protège. Aucune autre entreprise ne peut faire ce que nous faisons; nous ne pouvons pas être enfermés dans une seule case!\n\nL’expression « transformation numérique » sert à attirer l’attention, mais elle est plutôt vide de sens si elle ne s’accompagne pas d’une culture qui autorise l’innovation, la créativité et, oui, même l’échec (si cela permet d’apprendre).\n\nAu quotidien, nous nous concentrons sur l’offre et la demande. Nous donnons le meilleur de nous-mêmes, nous mettons notre ego de côté, et nous mettons du cœur au travail (cela fait partie de notre ADN). Nous prenons nos responsabilités, nous prenons des mesures audacieuses, et nous savons apprécier la différence. Parce que sans diversité de pensée et sans engagement pour l’égalité entre tous, il n’y a pas de progrès.\n\nVous avez des cheveux colorés? Ce n’est pas important. Vous avez des tatouages? N’hésitez pas à les montrer. Vous aimez les vêtements à pois? C’est super! Vous êtes adepte de culture pop? Beaucoup d’entre nous le sont aussi. Vous êtes fanatique de technologie et voulez changer le monde? Soyez vous-même avec nous!",
            "job_is_remote": false,
            "job_posted_at": "20 hours ago",
            "job_posted_at_timestamp": 1732960800,
            "job_posted_at_datetime_utc": "2024-11-30T10:00:00.000Z",
            "job_location": "Ontario",
            "job_city": null,
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 51.253775,
            "job_longitude": -85.323214,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D5Gw3cwEGNdK2n474AAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": "YEAR",
            "job_highlights": {},
            "job_onet_soc": "15113200",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "2KUyihBHa5DyGBeOAAAAAA==",
            "job_title": "Technical Product Manager Internship at Vosyn",
            "employer_name": "Vosyn",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSbfPG235AyOzddKlfivF71I8GanLJ_MY6wO44R&s=0",
            "employer_website": "https://vosyn.ai",
            "job_publisher": "Jobgether",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://jobgether.com/offer/674ba7c9b10568bbc7ae0aa6-technical-product-manager-internship-at-vosyn?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Jobgether",
                    "apply_link": "https://jobgether.com/offer/674ba7c9b10568bbc7ae0aa6-technical-product-manager-internship-at-vosyn?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "This a Full Remote job, the offer is available from: Canada\n\nTeam: Product Management\n\nStatus: Full-time\n\nDuration: Equivalent to minimum 520 Hours (or ~ 3 months minimum)\n\nWork location: Remote (with hybrid options in Toronto)\n\nCompensation: Hourly (paid in equity compensation equivalent to CAD $32-35/hour\n\nAbout Us: At Vosyn, we embrace the exciting, game-changing world of Artificial Intelligence, driving innovation and pioneering impactful projects across various industries. Our incubator, AI Venture Lab is nestled in the heart of Office146.com, is a crucible of entrepreneurial spirit, supported by intelligent processes and industry-leading best practices. We believe in fostering a culture of flexibility, continuous improvement, and solution-focused strategies. Here, every idea is welcomed, nurtured, and has the potential to scale to new heights. Currently, we're at the forefront of a significant IPO endeavor, truly a unicorn in the making. We invite you to be part of our journey and leave your imprint on the future of AI.\n\nRole Overview:\n\nThe Technical Product Manager internship position requires the foundational skills of a Product Manager (PM) with specialized knowledge in Machine Learning (ML), Artificial Intelligence (AI), Large Language Models (LLM), or a background in cloud engineering. A strong grasp of these concepts is essential to effectively contribute to the innovative AI-driven products at Vosyn.\n\nIn this engagement/applied learning internship, you’ll gain unparalleled experience in a high-growth, dynamic environment, directly interfacing with senior management and contributing to transformative projects. It will be a demanding internship and will require you to bring the best version of yourself to the table, but for those who embrace this, it will be a richly rewarding experience as well as a great complement to your academic investment.\n\nKey Responsibilities:\n• Define and drive product strategy, roadmap, and feature prioritization for AI-driven products.\n• Collaborate with engineering, design, and marketing teams to ensure successful product launches.\n• Conduct market research and gather user feedback to inform product decisions.\n• Manage the product development lifecycle from ideation to launch, aligning with business goals.\n• Monitor product performance and iterate using data-driven insights.\n• What You Bring\n• An academic background in fields such as Business Administration, Product Management, or related disciplines.\n• Technical knowledge of Machine Learning, Artificial Intelligence, Large Language Models (LLM), or cloud engineering concepts.\n• Strong analytical skills for data-driven decision-making and problem-solving.\n• Proven experience in product management, including leading cross-functional teams.\n• Excellent organizational, multitasking, and communication skills (written and verbal).\n• Presentation and public speaking expertise.\n\nWhy Join Vosyn?\n• Be part of the invigorating journey of a start-up transitioning to an IPO.\n• Engage directly with senior management and strategic advisory board members.\n• Enhance your CV with a rich array of experiences unique to Vosyn\n• Gain valuable experience with shaping and developing all facets of a world class product department, while embracing the ‘experiential learning’ that comes from work in a fast paced global company.\n\nDEI and Workplace Safety:\n\nAt Vosyn Inc., we are committed to fostering a diverse, equitable, and inclusive workplace where every employee feels valued and supported. We believe that diversity of thought, background, and experience enriches our company culture and enhances innovation. We are an equal-opportunity employer and encourage candidates from all walks of life to apply. As part of our commitment to creating a safe and healthy work environment, we prioritize workplace safety, adhering to all relevant regulations and promoting a culture of responsibility. We believe that a safe and inclusive workplace is essential for the well-being and success of our team members. Join us in building a workplace that values diversity, prioritizes equity, and ensures the safety and well-being of every individual.\n\nHiring Process:\n• Application Submission: Candidates are invited to submit their resumes and cover letters through our career portal.\n• Written Questionnaire: Selected candidates will receive a set of 10 written questions to assess their fit and technical knowledge..\n• Video Questionnaire: Candidates who successfully pass the written assessment will be asked to answer 10 additional questions to be submitted in a video format to further evaluate their skills and cultural fit. The ability to video record your answers will be required.\n• Evaluation: Our team will review the responses to both questionnaires. Candidates who meet our criteria will be invited to the next stage.\n• Orientation Session: Successful candidates will be invited to participate in an orientation session where they will learn more about Vosyn, our projects, and what to expect during the internship. After this session, you will be given the opportunity to opt-in if you choose that this internship is for you.\n\nAt Vosyn, you will have the opportunity to engage with a fast growing global organization with diversity of thought, experience and cultures. Our interns have come from some of the top universities all around the world and we invite you to join us on this exciting journey.\n\nApply Now:\nVosyn Careers\n\nPlease note that only candidates who apply through our website and meet the qualifications will be contacted.\n\nThis offer from \"Vosyn\" has been enriched by Jobgether.com and got a 72% flex score.",
            "job_is_remote": false,
            "job_posted_at": "13 hours ago",
            "job_posted_at_timestamp": 1732986000,
            "job_posted_at_datetime_utc": "2024-11-30T17:00:00.000Z",
            "job_location": "Canada",
            "job_city": null,
            "job_state": null,
            "job_country": "CA",
            "job_latitude": 56.130365999999995,
            "job_longitude": -106.34677099999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D2KUyihBHa5DyGBeOAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": "YEAR",
            "job_highlights": {},
            "job_onet_soc": "11202100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "YSzLIaTnTPLjYt9jAAAAAA==",
            "job_title": "web marketing internship",
            "employer_name": "Corporate Stays",
            "employer_logo": null,
            "employer_website": "https://corporatestays.com",
            "job_publisher": "ZipRecruiter",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://www.ziprecruiter.com/c/Corporate-Stays/Job/Web-Marketing-Internship/-in-Montreal,QC?jid=1dc26f652f5b2788&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/Corporate-Stays/Job/Web-Marketing-Internship/-in-Montreal,QC?jid=1dc26f652f5b2788&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Monteal, Quebec, PQ, CA H2X 1Y2 Contact Type: Employer Job Details Job Description: We are a highly successful entrepreneurial company ($20M+ annual sales) specializing in the sale and rental of exclusive properties around the world. Having grown exponentially over the last number of years to become a global leader in this niche market, we are now focusing on ensuring appropriate strategies and mechanisms are in place to support our evolving operations. In this specific capacity, you will provide critical leadership as: Responsibilities Write killer copy for web, press releases, social media outlets, and the company blog Brainstorm ideas on how to enhance the company brand through social media outlets such as Twitter and Facebook Effectively strategizing and implementing unique press campaigns Organize and plan company events around the world Assisting with business development opportunities Manage our growing photography team Job Requirements: Must be enrolled in college Enthusiastic about immersing yourself in one of the most exciting start-ups in the world Active and displayable interest in social media marketing Solid copy writing skills Strong organizational ability A keen eye for great web and graphic design Willingness to work hard and play even harder Management Position?\n\nNo Entry-Level Position? Yes Work Permit Needed? Applicants who do not already have legal permission to work in Canada will not be considered.\n\nJob Available: Immediately Industry Categories : Travel & Tourism, Corporate Housing, Hotel Apartments. Position Categories : Web Marketing, SEM, SEO, Landing page automation, Link building, Online Media, PPC advertising, Online PR, blogging. Compensation Salary Range: From 1000$ Bonus Plan?\n\nYES Accommodation? No Other: 3 Weeks Vacations with Free accommodations and Iphone for trainees with 1 year commitment.",
            "job_is_remote": false,
            "job_posted_at": "22 hours ago",
            "job_posted_at_timestamp": 1732953600,
            "job_posted_at_datetime_utc": "2024-11-30T08:00:00.000Z",
            "job_location": "Montreal, Quebec",
            "job_city": "Montreal",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 45.501886899999995,
            "job_longitude": -73.56739189999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DYSzLIaTnTPLjYt9jAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15119900",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "L5sWOI6xtKchV3SSAAAAAA==",
            "job_title": "Head of Department (Special Educational Needs –SENDCO) Al Sharooq International school (HASIS)",
            "employer_name": "Hawthorn Muscat",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT65y_63PCv2aYEe1UdbyDeez5pCBGlN0fQ2gAl&s=0",
            "employer_website": "https://hawthorn.om",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/head-of-department-special-educational-needs-%E2%80%93sendco-al-sharooq-international-school-hasis-at-hawthorn-muscat-4086601935?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/head-of-department-special-educational-needs-%E2%80%93sendco-al-sharooq-international-school-hasis-at-hawthorn-muscat-4086601935?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Posted 12 months ago\n\nHawthorn Muscat is recruiting for Hay Al Sharooq International school (HASIS); the employees will be sponsored by HASIS and solely working for HASIS.\n\nHASIS is located in the Sultanate of Oman. HASIS started operations in 2002, HASIS is owned by Oman LNG with main goal is to provide education for children of the employees of Oman LNG. The School is based in Sur City near the Oman LNG staff accommodation complex, SUR City is a coastal city located 170 km south-east of the capital city Muscat, with a population of approx. 150,000 people. HASIS students age is from 3 to 18, HASIS follows the Cambridge curriculum.\n\nNew Positons for the academic year 2023/2024, to start duties on 24-8-2023, interview process will start immediately and will be online, teachers might be asked to do a DEMO class online in selected relevant subject to their area of studies, please email your cv + academic certificates + experience testimonials + passport copy + passport size photo to majali@hawthorn.om\n\nHead Of Department (Special Educational Needs –SENDCO)\n\nSalary Package: Salary up to 2000 OMR depending on qualifications and experience + 2 years’ contract renewable on mutual agreement + 60 days annual paid leave per year + Furnished Accommodation with deduction of only 125 OMR or you can get the 125 as accommodation allowance+ 400 OMR Air annual air ticket voucher + Free education for children at HASIS + Free medical insurance for staff, spouse and children+ free work visa for the employee + free transport from and to accommodation for work purposes+ Oman LNG club membership for only 5 OMR per month)\n• Bachelor of Education in Special needs.\n• Bachelor of Education with academic diploma not less than a year in Special needs.\n• Bachelor degree in a psychological or social field with academic diploma not less than a year in\n\nSpecial needs.\n• Strong academic experience – International British curriculum.\n• Minimum 10 years teaching experience as a special needs teacher.\n• Candidate should be able to lead students up to Key Stage 2.\n• Excellent Command of English speaking and writing with Minimum 6.5 IELTS.\n\nApply Online\n\nAttach Resume*\n\nNo file chosen\n\nBrowse",
            "job_is_remote": false,
            "job_posted_at": "18 hours ago",
            "job_posted_at_timestamp": 1732968000,
            "job_posted_at_datetime_utc": "2024-11-30T12:00:00.000Z",
            "job_location": "Saskatchewan",
            "job_city": null,
            "job_state": "Saskatchewan",
            "job_country": "CA",
            "job_latitude": 52.939915899999995,
            "job_longitude": -106.4508639,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DL5sWOI6xtKchV3SSAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "25205400",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "azSZ9Yn8A45UtqWcAAAAAA==",
            "job_title": "Social Media & Marketing Intern",
            "employer_name": "Ready Portal",
            "employer_logo": null,
            "employer_website": null,
            "job_publisher": "ZipRecruiter",
            "job_employment_type": "Full-time and Internship",
            "job_employment_types": [
                "FULLTIME",
                "INTERN"
            ],
            "job_apply_link": "https://www.ziprecruiter.com/c/Ready-Portal/Job/Social-Media-&-Marketing-Intern/-in-Toronto,ON?jid=39ee1c522663ec77&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/Ready-Portal/Job/Social-Media-&-Marketing-Intern/-in-Toronto,ON?jid=39ee1c522663ec77&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Adzuna",
                    "apply_link": "https://www.adzuna.ca/details/4801370862?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Who Are We? Debut Logic Canada Inc. is a Toronto-based IT start-up company specializing in information management and database programming.\n\nWe are currently looking for a freelance Social Media & Marketing Intern, who will assist our current and future projects. The ideal candidate is a creative individual, who is not afraid to take on different tasks. Your input and creative approach will be sought after and appreciated.\n\nReadyportal (A Debut Logic Company) is a leading enterprise content management (ECM) platform offered as both SaaS and Software. Readyportal's suite of content management software also includes social collaboration and portal functionalities that enable corporations, non-profits and small businesses to manage, collaborate and communicate efficiently with their target audience. For more information on our company, please visit http://www.readyportal.com/ We are looking for a Marketing & Social Media Intern to assist us in reaching our target market, create brand awareness, and generate sales to new clients in today's emerging economy.\n\nResponsibilities: As the Marketing & Social Media Intern, your position will entail working directly with the Manager of Corporate Communications to: Effectively utilize various social media mediums (ie. Facebook, Twitter, and LinkedIn) to promote our Web Content Management platform. Implement short and long-range strategies and plans to identify objectives for marketing penetration and sales opportunities.\n\nDevelop marketing and communications mediums. Help build and maintain partnerships with other companies. Other duties (as assigned) We are looking for a candidate who : possesses excellent communication skills, written and oral, in English.\n\nhas previous knowledge of, experience, and a keen interest in Social Media Marketing and Communications. has experience with Search Engine Marketing, specifically SEO, Local Search, Adwords, and Paid Search. has a strong understanding of the IT industry and social media platforms, and is aware of emerging technologies which would be a plus point for our company.\n\nhas experience with lead generation through Social Media (Preferred) is an entrepreneurial minded self-starter, and is looking to work in a dynamic and growing organization. enjoys working in a collaborative team environment. is comfortable speaking and emailing with business partners in a professional manner.\n\ncan be creative and thinks \"outside of the box\". Bilingual - English/French (Preferred) The chosen candidate will work between 15-20 hours a week. Candidates must reside in the Greater Toronto Area to be considered for this position.\n\nWhere: Our offices are located at the tip of Downtown Toronto, next to the Union Station and other TTC stops. Compensation: This is an unpaid internship. The selected candidate will be compensated for travel expenses and given training.\n\nThere may also be an opportunity to grow within the company, at which time we may employ the candidate to become a full time consultant. If interested, please tell us a little bit more about yourself (education, qualifications, interests about Information Technology, what makes you different from our other candidates?, why would you be a great fit for this position?). Only selected candidates will be contacted for interview.",
            "job_is_remote": false,
            "job_posted_at": "12 hours ago",
            "job_posted_at_timestamp": 1732989600,
            "job_posted_at_datetime_utc": "2024-11-30T18:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DazSZ9Yn8A45UtqWcAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15119900",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "PPh04EBoZgEKLOnbAAAAAA==",
            "job_title": "Co-op Summer 2025 - Systems Integration Engineer, CaJI - 8 months",
            "employer_name": "General Dynamics Mission Systems - Canada",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSuZ96sgvfnhrT8CAZbAGVVyzHkbfS0OO7czAen&s=0",
            "employer_website": "https://gdmissionsystems.ca",
            "job_publisher": "Dice",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://www.dice.com/job-detail/59774498-4ebd-4555-9beb-1c2bc6310ee6?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Dice",
                    "apply_link": "https://www.dice.com/job-detail/59774498-4ebd-4555-9beb-1c2bc6310ee6?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job DescriptionJob DescriptionCompany Description\n\nAt General Dynamics Mission Systems-Canada, co-op positions mean hands-on impact. Join an inclusive team that engineers high technology solutions, products, and services that have a real-world impact.\n• Realize your Impact: Our work enables customers to successfully execute missions across diverse domains of operation. Your fresh perspectives and ideas have the power to shape real solutions, influence projects and drive meaningful change.\n• Kick-start your Career: Immerse yourself in various industry facets, gaining insights that span from cutting-edge technology to project management. Elevate your resume with a distinguished company to set the stage for a rewarding career, while paving the way for future full-time opportunities within General Dynamics.\n• Grow your Network: Work side by side with seasoned professionals who are excited to share their experience and develop your skills. Have meaningful interactions, ask questions, and build relationships that can lead to lasting industry connections.\n• Balance your Life: Our flexible environment is designed for you to thrive. With options to work from home or under a compressed nine-day fortnight schedule, we champion work-life balance, ensuring you have time for personal endeavors and your professional aspirations.\n\nOur success is fueled by our people and the wide variety of backgrounds, perspectives, and skills they bring to the business - learn more about our commitment to diversity, inclusion, and belonging here. We will work with you around any workplace accommodation required during our application process. If you require accommodation or have questions, please contact Human Resources via recruitment@gd-ms.ca.\nJob Description\n\nLand & Joint Solutions provides assured information distribution and management in mission-critical operational environments where conditions are harsh, austere and hostile to ensure the right information, gets to the right place, at the right time, to enable the right actions.\n\nWe are looking for a Systems Integration Engineering co-op to join our Coalition and Joint Interoperability team working on the Land Command Support System (LCSS). LCSS provides the Canadian Armed Forces with the highly integrated command and control communications system they need. A highly integrated tactical system composed of communication, networking and information management sub-systems, LCSS is part of every Canadian Army vehicle, weapon platform and headquarters; comprising hardware, firmware and software.\n\nThe responsibilities and range of activities may vary, but in general you can expect to:\n• Participate in the requirements elicitation process and prepare requirements documents and specifications.\n• Develop, document, and review system designs and use cases, define system interfaces, and conduct analyses with support from lead and other senior engineers.\n• Prepare integration test plans, test procedures, and test reports in accordance with company and customer standards.\n• Execute formal and informal test procedures, gather appropriate measures and data, analyze and interpret test data, and prepare test reports.\n• Design, develop, and maintain automated test scripts and tools.\n• Identify and investigate system defects and raise problem reports.\n• Collaborate with customer, product, and engineering teams.\n• Management of requirement mapping to test cases\nQualifications\n• Currently enrolled in a Bachelor s degree program or equivalent in Engineering, or an applicable scientific discipline.\n\nIt would be excellent if the candidate had a combination of the following qualities, but we will work with them to grow in these areas:\n• Working knowledge of MS Office suite tools including Word, Excel, Visio and PowerPoint.\n• Strong problem solving and root cause analysis skills.\n• Ability to work effectively both independently and in a team environment.\n• Curiosity into how things work and why.\n• Strong communication skills, problem solving and analysis skills, and attention to detail.\n• Enthusiastic contributor, willing to learn new skills, and takes pride and ownership of work.\n\nAdditional Information\n\nSecurity Clearance\n• Must be able to obtain and maintain Canadian Security Clearance and a positive Controlled Goods Assessment. Eligibility to work in Canada either as a Canadian Citizen or Permanent Resident.\n• Applicants may be required to meet additional security requirements in order to gain access to technical data, classified areas or information that is subject to international regulations.",
            "job_is_remote": false,
            "job_posted_at": "19 hours ago",
            "job_posted_at_timestamp": 1732964400,
            "job_posted_at_datetime_utc": "2024-11-30T11:00:00.000Z",
            "job_location": "Ontario",
            "job_city": null,
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 51.253775,
            "job_longitude": -85.323214,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DPPh04EBoZgEKLOnbAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17214100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "xAo9S9r-YarzYsT2AAAAAA==",
            "job_title": "2025 winter Internship/Co-op (4 or 8 months) - Finance (Calgary, AB)",
            "employer_name": "Textron",
            "employer_logo": null,
            "employer_website": "https://www.textron.com",
            "job_publisher": "Textron Careers",
            "job_employment_type": "Full-time and Internship",
            "job_employment_types": [
                "FULLTIME",
                "INTERN"
            ],
            "job_apply_link": "https://careers.textron.com/calgary-ab/2025-winter-internshipco-op-4-or-8-months-finance-calgary-ab/637FBC019E574C6EBADD5B1A51D7AE23/job/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Textron Careers",
                    "apply_link": "https://careers.textron.com/calgary-ab/2025-winter-internshipco-op-4-or-8-months-finance-calgary-ab/637FBC019E574C6EBADD5B1A51D7AE23/job/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/Bell-Flight/Job/2025-winter-Internship-Co-op-(4-or-8-months)-Finance-(Calgary,-AB)/-in-Calgary,AB?jid=549a1e7448f9c4ef&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=04777e0f35d538ac&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobs.ca",
                    "apply_link": "https://www.jobs.ca/offer/2025-winter-internship-co-op-4-or-8-months-finance-calgary-ab/af3237e6-027a-45fc-9dab-07ebf6003d3a_en/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/2025-winter-internship-co-op-4-or-8-months-finance-calgary-ab-at-textron-4049527731?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/ullY-cHXs_H57oKt35ZjR1SG_3hfmklirtLk7sfXSiu-9NP3mzfqDw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Monster.ca",
                    "apply_link": "https://www.monster.ca/job-openings/2025-winter-internship-co-op-4-or-8-months-finance-calgary-ab-calgary-ab--a5ea82fa-713c-412b-a247-d5f93bc0ee0f?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/2025-winter-internship-co-op-4-or-8-months-finance-calgary-ab-bell-JV_IC2275123_KO0,61_KE62,66.htm?jl=1009489361909&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "2025 winter Internship/Co-op (4 or 8 months) - Finance (Calgary, AB)\n\nDescription\n\n!\\\n• !\n\nAbout Bell:\n\nWe are pioneers. We were the first to break the sound barrier and design the first functional jetpack. We were aboard NASA's first lunar mission and brought advanced tiltrotor systems to market. Today, we are defining the future of on-demand mobility. At Bell, we are proud to be an iconic company with superb talent, rapidly creating novel and coveted vertical lift experiences.\n\nThe Bell Canadian Supply Center located in Calgary, Alberta. We provide aftermarket support to a wide range of Canadian civil and military helicopters. Interns are assigned tasks based on their technical proficiency and demonstrated analytical skills to report and analyze financial transactions.\n\nAbout the internship:\n\nThis 4 to 8 months' internship will provide students with real world assignments that bring value to the business and high level exposure to the aviation industry.\n\nThe finance intern will work under the mentorship and direction of the Finance Business Partner and General Manager of the Calgary Supply Center to carry out various accounting and finance duties. This internship is designed as an opportunity to develop and enhance accounting and finance skills in a real world working environment.\n\nSpecific Duties\n\nRoles and responsibilities include but are not limited to:\n\nRoles and responsibilities include but are not limited to:\n• Month-end/Quarter-end closing process and financial reporting support\n• Balance sheet and profit & loss forecast\n• Assist with cash management and forecasting process\n• Track sales, overhead budget and other standardized metrics\n• Prepare management presentation reports\n• Work on special projects as assigned\n• Work closely with accounts receivable, accounts payable and credit departments\n\nQualifications\n\n!\\\n• !\n\nAcademic:\n• Enrollment in a Bachelor's level program in Accounting/Finance or other related field\n• Sound knowledge of general accounting principles\n\nothers\n• Good understanding of Microsoft suite (Excel, Word, PowerPoint, etc.)\n• Motivated and self-directed learners\n• Strong written and verbal communication skills\n• Maintain a valid driver's license\n• Start date: January 2025 as agreed upon.\n\nExperience\n\nNo previous experience required. Previous finance or accounting internships consider as a plus.\n\nDon't miss the chance to join a diverse, inclusive environment where you feel a sense of belonging. As a member of our global workforce, you will collaborate with dedicated, enthusiastic teams where unique experiences, backgrounds and ideas combined with a strong passion for our products take us above and beyond flight.\n\nBell Textron Canada Ltee adheres to the principles of Employment Equity\n\nRecruiting Company: Bell Textron Inc.\n\nPrimary Location: CA-Alberta-Calgary\n\nJob Function: Finance/Accounting\n\nSchedule: Full-time\n\nJob Level: Individual Contributor\n\nJob Type: Internship / Co-Op\n\nShift: First Shift\n\nTravel: No\n\nJob Posting: 10/16/2024, 6:37:30 AM\n\nJob Number: 328251",
            "job_is_remote": false,
            "job_posted_at": "8 hours ago",
            "job_posted_at_timestamp": 1733004000,
            "job_posted_at_datetime_utc": "2024-11-30T22:00:00.000Z",
            "job_location": "Calgary, AB",
            "job_city": "Calgary",
            "job_state": "Alberta",
            "job_country": "CA",
            "job_latitude": 51.044733099999995,
            "job_longitude": -114.0718831,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DxAo9S9r-YarzYsT2AAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13205100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "PJJQ2djwn2LnpzwCAAAAAA==",
            "job_title": "Program Technician Internship",
            "employer_name": "Government of Nova Scotia",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSr3qxYWPtvk67TXDOhMXDJLPoZ3JL0Zn_anNLQ&s=0",
            "employer_website": "https://beta.novascotia.ca",
            "job_publisher": "Recruit.net",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://www.recruit.net/job/program-technician-internship-jobs/DC05E7147F44869F?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Recruit.net",
                    "apply_link": "https://www.recruit.net/job/program-technician-internship-jobs/DC05E7147F44869F?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Competition # : 43362\n\nDepartment: Seniors and Long-Term Care\n\nLocation: HALIFAX\n\nType of Employment: Internship\n\nUnion Status: NSGEU - NSPG\n\nClosing Date: ​03-Jul-24 ​ (Applications are accepted until 11:59 PM Atlantic Time)\n\nAbout Us\n\nThe Department of Seniors and Long-Term Care offers opportunities to grow and advance in a dynamic sector that touches the lives of all Nova Scotians. We are committed to continually improving our health care system. With a focus on capital infrastructure, the Department is thinking differently about how to plan, fund, legislate and monitor to improve access and service delivery.\n\nAbout Our Opportunity\n\nOur Mandate at Seniors and Long-Term Care includes to renovate and build 5700 new single-bed rooms, development of a Long-term Care Infrastructure Renewal Plan and supporting aging infrastructure. The Infrastructure Division is looking for a Program Technician Intern to contribute to the planning and monitoring LTC facility builds. Reporting to Coordinator – Program Planning, this position will be responsible for supporting the core deliverables that guide the projects within the Program. The Program Technician Intern will be required to advance the goals of the department through tracking of project and program level data, identifying and executing improvements based on this evidence.\n\nPrimary Accountabilities\n\nAs the Program Technician Intern, you provide technical and administrative support to the SLTC Infrastructure division and have a direct impact on the management of LTC rebuild project records, through the intake, analysis and tracking of submissions.\nWe count on your strong attention to detail and organization skills for the accurate and timely preparation of informal reports and recommendations in response to project document submissions and inquiries from department staff, other government departments, the public, service providers and project teams. You will be responsible to:\n• Participate in project initiatives as part of the team and complete tasks as assigned by the manager or supervisor to ensure an efficient and effective implementation.\n• Ensure that department records are maintained and the information is relayed to the proper individual for action;\n• Ensure proper documentation and signing authority are received;\n• Protect the confidentiality of Departmental and LTC sector information.\n• Perform other duties as required.\n\nQualifications and Experience\n\nGraduation from a post-secondary institution, with an applicable field of study, within the last three years is mandatory. Applicable programs include: Engineering Technology, Building Systems Technologist, Engineering, Architecture, Planning.\nFor this position, experience and competency in a computerized environment with proficient and accurate keyboarding and data entry skills is required. You will have experience adapting to rapidly evolving technologies and procedures.\nAs an ideal candidate, you have:\n• The ability to communicate effectively with the Department, both verbally and in writing.\n• Strong working knowledge of MS Office Suite of programs, especially Excel.\n• The ability to utilize, analyze and synthesize data from database applications.\n• The ability to prioritize the scheduling of work requirements.\n• The ability to work within a team or individually, as required, with minimal supervision.\n• Ability to carry out policies and procedures of the Department of Seniors and Long-Term Care.\n\nThough not required, it is considered an asset if you are familiar with:\n• Knowledge of building construction practices.\n• Knowledge of building plant systems including heating, ventilation, air conditioning, electrical, plumbing, life safety and controls systems and devices.\n• A strong working knowledge of design software such as AutoCAD and Revit.\n\nWe will assess the above qualifications using one or more of the following tools: written examination, standardized tests, oral presentations, interview(s), and reference checks.\n\nBenefits\n\nBased on the employment status and union agreement, the Government of Nova Scotia offers its employees a wide range of benefits such as a Defined Benefit Pension Plan, Health, Dental, Life Insurance, General illness, Short and Long Term Disability, Vacation and Employee and Family Assistance Programs. For information on all our Benefit program offerings, click here: Benefits for government employees.\n\nWorking Conditions\n\n35 hours per week, some flexibility in hours of work based on required travel within the province.\n\nAdditional Information\n\nThis is a term internship opportunity with an anticipated start date of July 30, 2024, and an anticipated end date of May 31, 2026. The appointment status (‘term’, ‘temporary’ or ‘casual’) is dependent on the start date of the successful candidate.\n\nPay Grade: PR 06\n\nSalary Range: $1,924.95 - $2,360.46 Bi-Weekly\n\nEmployment Equity Statement:\n\nOur goal is to be a diverse workforce that is representative, at all job levels, of the citizens we serve. The Government of Nova Scotia has an Employment Equity Policy, and we welcome applications from Indigenous People, African Nova Scotians and Other Racially Visible Persons, Persons with Disabilities and Women in occupations or positions where they are under-represented. If you are a member of one of these equity groups, you are encouraged to self-identify on your electronic application.\n\nThis is a bargaining unit position initially restricted to current civil service employees represented by the Nova Scotia Government Employees Union (NSGEU). If applying from outside a government office, employees must apply correctly via this link:\n\nFailure to apply correctly means that your application will not be given first consideration as a bargaining unit applicant, and will only be included if external applications are pursued.\n\nExternal applicants and current casual employees will only be considered if there are no qualified civil service bargaining unit candidates. PLEASE NOTE: Candidates will not be considered for an interview if applications are incomplete or are missing information.\n\nOffer of employment is conditional upon the completion of all applicable background checks and confirmation of credentials, the results of which must be satisfactory to the employer. We thank all applicants for the interest, however, only those selected for an interview will be contacted. All questions and concerns may be directed to Competitions@novascotia.ca.",
            "job_is_remote": false,
            "job_posted_at": "6 hours ago",
            "job_posted_at_timestamp": 1733011200,
            "job_posted_at_datetime_utc": "2024-12-01T00:00:00.000Z",
            "job_location": "Halifax, NS",
            "job_city": "Halifax Regional Municipality",
            "job_state": "Nova Scotia",
            "job_country": "CA",
            "job_latitude": 44.885708699999995,
            "job_longitude": -63.100527299999996,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DPJJQ2djwn2LnpzwCAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "55301800",
            "job_onet_job_zone": null
        },
        {
            "job_id": "wj6ArRYUNYmI0nXPAAAAAA==",
            "job_title": "Internship - Field engineer (Toronto/Port-Severn/Sudbury- Winter 2025)",
            "employer_name": "EBC Inc.",
            "employer_logo": null,
            "employer_website": null,
            "job_publisher": "ZipRecruiter",
            "job_employment_type": null,
            "job_employment_types": [],
            "job_apply_link": "https://www.ziprecruiter.com/c/EBC-Inc./Job/Internship-Field-engineer-(Toronto-Port-Severn-Sudbury-Winter-2025)/-in-Mississauga,ON?jid=fbbc05b6149cb3fa&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/EBC-Inc./Job/Internship-Field-engineer-(Toronto-Port-Severn-Sudbury-Winter-2025)/-in-Mississauga,ON?jid=fbbc05b6149cb3fa&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jooble",
                    "apply_link": "https://ca.jooble.org/jdp/1101556125431332522?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/internship-field-engineer-toronto-port-severn-sudbury-winter-2025-at-ebc-inc-4084942631?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Monster.ca",
                    "apply_link": "https://www.monster.ca/job-openings/senior-bridge-engineer-hybrid-mississauga-on--0082632f-5df5-4c99-b406-20897964b776?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "BeBee Canada Meet Opportunities",
                    "apply_link": "https://ca.bebee.com/job/2d54feea7f7f51394d75d9b038819bbb?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "INTERNSHIP - FIELD ENGINEER\n\nWorking at EBC means joining a growing construction company, on projects across Canada, in diverse and stimulating sectors. It also means working for a company that cares about the health and well-being of its employees and offers various programs and initiatives that promote wellness. At EBC, you will benefit from exciting professional development opportunities. During your internship, you will be involved or oversee duties usually assigned to a Field Engineer. You will assist the Project Manager in various tasks pertaining to the job site, including planning, organizing, and supporting project execution works; from negotiations with suppliers and subcontractors to providing support with work methods. You will also develop and suggest improvements to design standards, advise, and solve complex design and engineering issues on site.\n\nReach your full potential with us!\n\n\\u200B\n\nRESPONSIBILITIES\n• Monitor works daily through the technical and administrative tasks assigned to you ;\n• Plan and oversee works coordination with foremen, surveyors, superintendents, engineers, project managers and subcontractors ;\n• Prepare and follow up on technical issues in plans and specifications ;\n• Prepare, monitor, analyze and manage subcontractor files ;\n• Contribute to contract negotiations when necessary ;\n• Contribute to project scheduling;\n• Obtain permits and authorizations required to carry out works ;\n• Plan and check material orders as needed ;\n• Follow-up on \"Conflict detection\" when the project is executed in BIM ;\n• Assist, review and communicate technical questions and change requests to the customer representative and follow-up when required;\n• Plan, supervise and contribute to the development of appropriate construction methods and processes per contractual requirements, while respecting current health and -safety requirements ;\n• Participate in site meetings with various project stakeholders ;\n• Follow up and manage deficiencies at the end of the project ;\n• Contribute to traffic management when required.\n\nRequirements\n• Bachelor's degree in Civil Engineering or Construction Engineering, in progress ;\n• Relevant experience in engineering or construction is an important asset ;\n• A driver's license and/or ability to travel may be required in some cases.\n\nSKILLS AND ATTITUDES REQUIRED\n• Is versatile and adaptable ;\n• Is a fast learner ;\n• Respects deadlines ;\n• Possesses strong teamwork skills.\n\nBenefits \\u200B\n\nAn internship at EBC means:\n• You actively participate in larger-than-life construction projects ;\n• You work on projects across our vast Canadian territory, offering exceptional professional and personal experiences ;\n• Colleagues are delighted to share time and knowledge with our interns and their infectious passion about their work ;\n• The perfect opportunity to enter the workforce ;\n• Advantageous compensation and generous remote project incentives ;\n• The possibility to secure a position at EBC upon graduation ;\n• An unforgettable experience.",
            "job_is_remote": false,
            "job_posted_at": "14 hours ago",
            "job_posted_at_timestamp": 1732982400,
            "job_posted_at_datetime_utc": "2024-11-30T16:00:00.000Z",
            "job_location": "Mississauga, ON",
            "job_city": "Mississauga",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.5852972,
            "job_longitude": -79.64498379999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dwj6ArRYUNYmI0nXPAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17219900",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "RsjTQ7do-E2zfIvsAAAAAA==",
            "job_title": "Frontend Developer Intern - Winter 2025 Semester (January-April, Remote - Canada)",
            "employer_name": "Blaise Transit",
            "employer_logo": null,
            "employer_website": "https://www.blaisetransit.com",
            "job_publisher": "HR Software For Growing Businesses | Freshteam",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://blaisetransit.freshteam.com/jobs/aYC9T59H1z96/frontend-developer-intern-winter-2025-semester-january-april-remote-canada?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "HR Software For Growing Businesses | Freshteam",
                    "apply_link": "https://blaisetransit.freshteam.com/jobs/aYC9T59H1z96/frontend-developer-intern-winter-2025-semester-january-april-remote-canada?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Remote Jobs",
                    "apply_link": "https://remotefetch.com/career/84977/frontend-developer-intern-winter-2025-semester-january-april-remote-canada-montreal?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Candidates MUST:\n• Live in Canada.\n• Be full or part-time students with at least one semester of school remaining in their program.\n• Be Canadian citizens, permanent residents, or hold refugee status.\nAny candidate that does not have these 3, will not be considered.\n\nBlaise Transit is on a mission to create sustainable, enjoyable, and accessible transportation for all! Our platform allows any organization to create an on-demand transit system using their own vehicles. Unlike traditional (fixed-route) public transit, on-demand transit allows vehicles to be dynamically routed based on passenger demand. Using Blaise, our partner transit agencies can use their vehicles more efficiently (meaning less greenhouse gas emissions), provide a better passenger experience, and connect populations who have never had access to public transit before!\n\nWe hold the following values:\n• We are sustainable. We leave our clients, our team, and our world better than we found them.\n• We are innovative. We experiment with new solutions to help us continually improve.\n• We are empathetic. We listen to understand, so we can forge strong relationships.\n• We are inclusive. We want to be accessible to everyone, so we seek diverse perspectives.\n\nThings we hope our Frontend Developer Intern will do:\n• Implement new features and bug fixes in our mobile and web apps\n• Create technical designs for new features, and present them to the team\n• Provide feedback on technical designs presented by other developers\n• Provide feedback on feature specifications (e.g. user interface mockups and prototypes) created by other members of the Blaise team\n• Review code written by other members of our development team\n\nOur Frontend Developer Intern might have:\n• Knowledge of frontend development using React.js or React Native\n• One or more previous professional experiences (internships) using JavaScript\n• A portfolio of projects you worked on by yourself, or in a small team\n• Proficiency with Git and ticket management software such as Asana\n• BONUS: You’re passionate about code, public transit and urbanism\n\nPerks of joining us:\n• Learn how to write production quality code from our team of developers\n• Gain experience working as part of a real software development team\n• Get feedback and support from a mentor throughout your internship\n• Develop your own designs, get feedback, implement them, and see them deployed to production!\n• Participate in our Programming Book Club, and pick up best practices, design patterns, and programming concepts that you may not be exposed to during your day-to-day work.\n• Work with awesome, driven people!\n\nThe Blaise Transit team values diversity in all forms and is an equal opportunity employer. Creating an inclusive environment where everyone feels comfortable is a top priority. To that end, we welcome and encourage applications from those who self-identify as Indigenous, Black, as a Person of Colour, LGBTQ2S+, as a person with a disability, and/or any other minority.\n\nReady to join one of the fastest-growing, ambitious, impact-driven, and fully remote companies in Montreal?\n\nBlaise Transit a pour mission de créer des solutions de transport durables, agréables et accessibles à tous! Notre plateforme permet à n’importe quelle organisation de créer un système de transport en commun à la demande en utilisant ses propres véhicules. Contrairement au transport en commun traditionnel (c’est-à-dire à itinéraires et horaires fixes), le transport en commun à la demande permet de continuellement réarranger les itinéraires et les horaires des véhicules en fonction de la demande des passagers. Les sociétés de transport faisant appel à notre plateforme peuvent ainsi utiliser leurs véhicules plus efficacement (réduisant ainsi leurs émissions de gaz à effet de serre), offrir une meilleure expérience aux passagers et relier des communautés qui n'ont jamais eu accès à des services de transport en commun auparavant!\n\nLes valeurs fondamentales de Blaise sont les suivantes :\n• Nous sommes durables. Nous laissons nos clients, notre équipe et notre monde en meilleur état que nous les avons trouvés.\n• Nous sommes innovants. Nous expérimentons continuellement de nouvelles solutions afin de nous améliorer.\n• Nous sommes empathiques. Nous écoutons pour comprendre et ainsi développer des relations solides.\n• Nous sommes inclusifs. Nous voulons être accessibles à tous et nous recherchons donc des perspectives diverses.\n\nNous espérons que notre Stagiaire en Développement Frontend pourra assumer les fonctions suivantes:\n• Implémenter de nouvelles fonctionnalités et corriger les bogues dans nos applications mobiles et web\n• Contribuer à la conception technologique des nouvelles fonctionnalités et la présenter au reste de l’équipe\n• Fournir de la rétroaction sur les plans techniques présentés par les autres développeurs\n• Fournir de la rétroaction sur les spécifications des fonctionnalités (par exemple des maquettes et prototypes d’interface utilisateur) créées par les autres membres de l’équipe Blaise\n• Réviser le code écrit par les autres développeurs\n\nNotre Stagiaire en Développement Frontend aurait idéalement :\n• Une bonne connaissance du développement frontend avec les outils React.js ou React Native\n• Une ou plusieurs expériences professionnelles antérieures (stages) impliquant JavaScript\n• Un portfolio de projets sur lesquels vous avez travaillé seul ou avec une petite équipe\n• Une maîtrise de Git et d’un logiciel de gestion de tickets (par exemple Asana)\n• BONUS: Une passion pour le transport en commun et l’urbanisme\n\nLes avantages de se joindre à nous :\n• Apprendre à écrire du code de production de haute qualité grâce à notre équipe de développeurs\n• Acquérir une expérience de travail professionnelle au sein d'une véritable équipe de développement logiciel\n• Bénéficier de la rétroaction et du soutien d'un mentor pendant votre stage\n• Développer vos propres conceptions, recevoir des conseils sur ceux-ci, les mettre en œuvre et les voir déployées en production!\n• Participer à notre club de lecture sur la programmation et développer des meilleures pratiques, des modèles de conception et des concepts de programmation auxquels vous n'êtes peut-être pas exposé dans votre travail quotidien.\n• Travailler avec des personnes sympathiques et motivées !\n\nL'équipe de Blaise Transit valorise la diversité sous toutes ses formes et s’engage à garantir l’égalité des chances à toutes les personnes candidates qualifiées. La création d'un environnement inclusif où chacun se sent à l'aise est une priorité absolue. À cette fin, nous accueillons et encourageons les candidatures de tout individu s'identifiant comme autochtone, noir, personne de couleur, LGBTQ2S+, personne handicapée et/ou faisant partie de toute autre minorité.\n\nÊtes-vous prêt à rejoindre une entreprise complètement en télétravail qui est en pleine croissance et parmi les plus ambitieuses et les plus dynamiques de Montréal?",
            "job_is_remote": false,
            "job_posted_at": "14 hours ago",
            "job_posted_at_timestamp": 1732982400,
            "job_posted_at_datetime_utc": "2024-11-30T16:00:00.000Z",
            "job_location": "Montreal, Quebec",
            "job_city": "Montreal",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 45.501886899999995,
            "job_longitude": -73.56739189999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DRsjTQ7do-E2zfIvsAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15113400",
            "job_onet_job_zone": "3"
        },
        {
            "job_id": "lyr6uDJBhvUiuI8mAAAAAA==",
            "job_title": "Branch Manager Intern- EN",
            "employer_name": "RBC",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSwvaVz7449rV0v_3hEjALgVW3ZrdU3AnQIJ0fz&s=0",
            "employer_website": null,
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/branch-manager-intern-en-at-rbc-4048167563?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/branch-manager-intern-en-at-rbc-4048167563?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Levels.fyi",
                    "apply_link": "https://www.levels.fyi/jobs?jobId=97118562623070918&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Summary\n\nJob Description\n\nCandidates will have to be mobile in the Laval, Lanaudière and Laurentides regions.\n\nWhat is the opportunity?\n\nAs a Branch Manager, you are a local market leader, motivating and coaching your team to create a memorable experience for clients. Inside and outside the branch, you capitalize on emerging market opportunities and act as an RBC Ambassador within the community you work in. Sharing common goals, purpose, vision, and values with other RBC partners, you build relationships and encourage collaboration across all roles, as well as steward digital enablement and multichannel usage. As a team leader, you support the ongoing development of staff through consistent routines to ensure a high level of employee capability and engagement.\n\nWhat will you do?\n• Deliver results and support new client acquisitions through multiple channels, including your own team and local partners\n• Lead change and allocate resources to meet the needs of the community, growing sales, revenue, and market share\n• Ensure high employee engagement through recruiting, talent management, development, and career planning\n• Inspire, orchestrate, and pioneer superior retailing excellence to deliver a memorable client experience\n• Coach your team on client advice and education, problem resolution and prevention at first point of contact, and advocate for digital enablement and multichannel usage\n• Take appropriate actions to close gaps identified through operational, credit effectiveness, and compliance reviews and reports\n\nWhat do you need to succeed?\n\nMust-have\n• Mutual Funds accreditation (IFIC or CSC) and minimum 2 years of licensed mutual funds sales experience within the last 3 years\n• Completed an acceptable mutual fund branch management exam offered by the CSI, or ability to write an exam within 4 months of start date\n• Minimum 3 years in a people management role\n• Entrepreneurial business acquisition mindset\n• Ability to employ digital channels, drive client awareness, and ensure your team is enabling clients with RBC digital access\n• Bilingualism (English and French) required, as you will regularly serve our clients with English and French-speaking needs.\n\nNice-to-have\n• Experience in both business and personal banking\n• Strong track record of building and maintaining client relationships in the finance or service sector\n\nWhat’s in it for you?\n\nWe thrive on the challenge to be our best, progressive thinking to keep growing, and working together to deliver trusted advice to help our clients thrive and communities prosper. We care about each other, reaching our potential, making a difference to our communities, and achieving success that is mutual.\n• A comprehensive Total Rewards Program including bonuses and flexible benefits, and competitive compensation\n• Leaders who support your development through coaching and managing opportunities\n• Ability to make a difference and lasting impact\n• Work in a dynamic, collaborative, progressive, and high-performing team\n• Financial strength and strong brand to support your goals\n\nJob Skills\n\nBuilding Talent, Critical Thinking, Inspiring, Long Term Planning\n\nAdditional Job Details\n\nAddress:\n\n3100 BOUL LE CARREFOUR:LAVAL\n\nCity:\n\nLAVAL\n\nCountry:\n\nCanada\n\nWork hours/week:\n\n37.5\n\nEmployment Type:\n\nFull time\n\nPlatform:\n\nPERSONAL & COMMERCIAL BANKING\n\nJob Type:\n\nRegular\n\nPay Type:\n\nSalaried\n\nPosted Date:\n\n2024-10-10\n\nApplication Deadline:\n\nInclusion and Equal Opportunity Employment\n\nAt RBC, we embrace diversity and inclusion for innovation and growth. We are committed to building inclusive teams and an equitable workplace for our employees to bring their true selves to work. We are taking actions to tackle issues of inequity and systemic bias to support our diverse talent, clients and communities.\n\nWe also strive to provide an accessible candidate experience for our prospective employees with different abilities. Please let us know if you need any accommodations during the recruitment process.\n\nJoin our Talent Community\n\nStay in-the-know about great career opportunities at RBC. Sign up and get customized info on our latest jobs, career tips and Recruitment events that matter to you.\n\nExpand your limits and create a new future together at RBC. Find out how we use our passion and drive to enhance the well-being of our clients and communities at jobs.rbc.com",
            "job_is_remote": false,
            "job_posted_at": "22 hours ago",
            "job_posted_at_timestamp": 1732953600,
            "job_posted_at_datetime_utc": "2024-11-30T08:00:00.000Z",
            "job_location": "Laval, Quebec",
            "job_city": "Laval",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 45.6066487,
            "job_longitude": -73.712409,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dlyr6uDJBhvUiuI8mAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "11102100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "1_e1tIURwrGUxf4yAAAAAA==",
            "job_title": "Regulatory and Scientific Affairs Intern",
            "employer_name": "Nestlé",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQvEMeSeimIxCfU0cuY11vqz6udmsatYZu4kh3f&s=0",
            "employer_website": "https://www.nestle.com",
            "job_publisher": "Recruit.net",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://www.recruit.net/job/regulatory-scientific-affairs-jobs/50A54552CCC1EC88?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Recruit.net",
                    "apply_link": "https://www.recruit.net/job/regulatory-scientific-affairs-jobs/50A54552CCC1EC88?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Position Snapshot\nBusiness area: Nestlé Health Science\nJob title: Regulatory and Scientific Affairs Intern\nLocation: North York, ON located at 25 Sheppard Ave W, North York, ON M2N 6S8; Hybrid\n\nA little bit about us\nWhile Nestlé is known for Boost, Nature’s Bounty, Vital Proteins, Garden of Life, our recipe for success comes down to one thing: our people.\n\nWe strive to lead a people-focused culture that empowers employees to bring their authentic selves to work each day. There are 3,000+ members of Nestlé Canada celebrated for taking action using agility, courage, and trust to find solutions that benefit the business or greater good. We’re a team of changemakers, who are curious and challenge the status quo, that take risks that will help drive us forward.\n\nOur focus is not only on nourishing our customers, but also about enriching you. We know that empowerment leads to strong employee engagement, a great work culture, and motivated employees.\n\nPosition Summary\nWe are looking for a Regulatory and Scientific Affairs Intern based at our North York location for the months of May to August 2025. This role at Nestlé Health Science will provide support to the Natural Health Products platforms on various regulatory and compliance projects. Responsibilities include assisting with government submissions, product registrations, conducting claims assessments, and contributing to the development of new digital tools. This internship offers valuable experience in the field, allowing interns to gain practical knowledge and skills in regulatory affairs while working closely with experienced professionals.\n\nA day in the life of a Regulatory and Scientific Affairs Intern\nAs a Regulatory and Scientific Affairs Intern, your responsibilities will include working on compliance for both external regulations and internal Nestle policies and standards, conducting claims assessments to ensure compliance with regulations and Nestle internal claims standards, and reviewing communication and advertising materials for compliance.\n\nYou will also be:\n• Assisting with local Innovation and Renovation (I&R) projects to support Canadian market launches.\n• Assisting the RSA team to ensure compliance of finished products, labels and product related communication and registrations.\n• Assisting in various projects within the RSA group and related functions.\n\nWhat will make you successful?\nAs the successful candidate, you will need to be passionate, tenacious, results focused and really enjoy working in a highly energetic and exciting environment.\n\nYou will also:\n• Currently enrolled in a gradudate or undergraduate program in science, or relevant field such as pharmacy, nutrition, herbal medicine, or a related discipline is preferred.\n• Strong interest in natural health products and a desire to learn more about the industry.\n• Knowledge of regulatory requirements for natural health products is preferred.\n• Experience in regulatory affairs or the food and beverage industry is preferred.\n• Familiarity with the Food and Drugs Act and Food and Drugs Regulatory is preferred.\n• Strong understanding of at least one of the regulatory related topics such as food safety, consumer information, nutrition & health, additives, or quality.\n• Exceptional organizational & efficiency skills – ability to organize work, multi-task, create detailed plans, monitor progress, follow-up and meet deadlines.\n• Demonstrates initiative and is proactive; ability to work independently, anticipate needs and be forward-thinking. Assertive with the ability to adapt to change.\n• Advanced Microsoft Office skills, including Outlook, Excel, Word and PowerPoint.\n\nWe have a friendly, supportive team with a coaching and mentoring environment. There are real opportunities for future development and progression – this really could be a move towards the exciting Regulatory career you’ve always wanted.\n\nBenefits\n• Flexible and hybrid work arrangements\n• Excellent training and development programs as well as opportunities to grow within the company\n• Up to 50% off – Nespresso Coffee Machine, Capsules and accessories\n• Access to the Discount Company store with Nestlé, Nespresso, and Purina products (Located across various Nestle offices/sites)\n• Additional discounts on a variety of products and services offered by our preferred vendors and partnerships\n\nWhat you need to know\nApplications close on November 11, 2024. We will be considering applicants as they apply, so please don’t delay in submitting your application. We will be considering applicants as they apply, so please don’t delay in submitting your application.\nNestlé Canada is an equal-opportunity employer committed to diversity, equity, inclusion, and accessibility. We welcome qualified applicants to bring their diverse and unique experiences as a result of their education, perspectives, culture, ethnicity, race, sex, gender identity and expression, nation of origin, age, languages spoken, veteran’s status, colour, religion, disability, sexual orientation and beliefs.\n\nIf you are selected to participate in the recruitment process, please inform Human Resources of any accommodations you may require. Nestlé will work with you in an effort to ensure that you are able to fully participate in the process.\n\n#LI-Hybrid",
            "job_is_remote": false,
            "job_posted_at": "6 hours ago",
            "job_posted_at_timestamp": 1733011200,
            "job_posted_at_datetime_utc": "2024-12-01T00:00:00.000Z",
            "job_location": "Ontario",
            "job_city": null,
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 51.253775,
            "job_longitude": -85.323214,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D1_e1tIURwrGUxf4yAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13104100",
            "job_onet_job_zone": "3"
        },
        {
            "job_id": "eStbyK3rOiRejclsAAAAAA==",
            "job_title": "Advisor Internship Program (AIP) (Calgary/Edmonton/Saskatoon)",
            "employer_name": "Raymond James Ltd.",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQyCByA8kU0g662ww9D2X2Yx6tP_72k6CE1WuZ1&s=0",
            "employer_website": "https://www.raymondjames.com",
            "job_publisher": "ZipRecruiter",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://www.ziprecruiter.com/c/Raymond-James-Ltd./Job/Advisor-Internship-Program-(AIP)-(Calgary-Edmonton-Saskatoon)/-in-Edmonton,AB?jid=3e038ba5084f1825&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/Raymond-James-Ltd./Job/Advisor-Internship-Program-(AIP)-(Calgary-Edmonton-Saskatoon)/-in-Edmonton,AB?jid=3e038ba5084f1825&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://emplois.ca.indeed.com/viewjob?jk=bf33d7b6ca001393&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/advisor-internship-program-aip-calgary-edmonton-saskatoon-at-raymond-james-ltd-4056151254?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/kSFDaNbBi3XcKInZ6BXWpvTRSX77wCNFUMT_sJ5es0D4Ve49YT6xtA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Adzuna",
                    "apply_link": "https://www.adzuna.ca/details/4911659653?title=Advisor_Internship_Program_(AIP)_(Calgary/Edmonton/Saskatoon)&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Www.jobaliza.com",
                    "apply_link": "https://www.jobaliza.com/ca/jobad/3997edee9e11547d/9307679650/8282504725/advisor-internship-program-aip-calgaryedmontonsaskatoon-edmonton-ab.html?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "At Raymond James, we develop, we collaborate, we decide, we deliver, and we improve together.\n\nRaymond James Ltd. is Canada’s leading independent investment dealers offering high quality investment products and services to Canadians seeking customized solutions to their wealth management needs.\n\nAdvisor Internship Program (AIP)\n\nHow Does The Role Impact The Organization?\n\nRaymond James, Canada’s leading independent investment dealer, is seeking Financial/Investment Advisors who are keen to develop their career at one of our branch locations through our Advisor Internship Program (AIP). The Raymond James AIP is a comprehensive and demanding career development training program designed to provide an opportunity for individuals who have been in the financial services industry for at least 3 years to build and grow their own successful advisory practice. Candidates will join the firm as a Financial Advisor, and will be responsible for building their own book of business. The AIP is a 36-month training and development program that focuses on expanding the advisor’s existing level of knowledge of business building strategies and successful advisor practices. The AIP is conducted as an interactive program that includes a combination of classroom training, online learning, mentorship, and individual as well as group coaching.\n• *PLEASE NOTE**: This posting is not for short term co-op internship opportunities. The Advisor Internship Program is a 3 year career development program.\n\nWhat Will Your Role Be Responsible For?\n\nThe primary responsibility of an Advisor is to provide clients with advice on financial matters with a total wealth management perspective. Advisors will build relationships with high net worth individuals and families through various prospecting methods, (including but not limited to outbound calling, social media, in person networking, webinars and seminars, direct mail campaigns and various other sales and marketing methods). The role involves understanding the needs of clients, then providing appropriate options and solutions to best meet those needs. While there are asset-gathering minimums in each of the first, second, and third years, new advisors should aim to grow their assets under administration by $8 -10 million in each of year one, two and three; while continuing to properly service those clients who are already engaged with the practice.\n\nWhat Can You Expect From Us?\n\nOur most important investment is in our people. Upon eligibility, Raymond James Ltd offers and a competitive compensation and benefits package. Our benefits include Health Benefits, Paid Time Off, Volunteer Days, Tuition Reimbursement and much more! AIP provides access to industry leading coaching, in depth training on how to develop and grow a book of business and one to one trainee support. We also encourage and support community involvement.\n\nWhat Do We Require From You?\n• University degree and/or related working experience in business, finance, economics, commission sales\n• A minimum of 3 years full-service brokerage and/or financial industry related experience\n• Must be registered (or eligible to be re-registered) with CIRO in Province of Residence as of date of hire\n• Successful completion of the Canadian Securities Course (CSC) (valid & completed within the last 3 years)\n• Successful completion of the Conduct and Practices Handbook Course (CPH) (valid & completed within the last 2 years) (note this may be required to be completed once employed by a CIRO regulated firm)\n• Experience with using various prospecting methods to gain appointments\n• Knowledge of investment products and services\n• Proven finance, sales and entrepreneurial skills in an advice capacity to persons of influence\n• Excellent interpersonal/relationship building skills required to build strong, positive and trusting client relationships\n• Well-developed presentation skills sufficient to convey both factual and conceptual information and ideas to clients.\n• Upon hire, the Raymond James AIP training program and classroom session(s) must be attended and successfully completed\n• Fulfillment of CIRO continuing education requirements on an ongoing basis\n\nWhat Other Talents Would be Helpful In This Role?\n• Successful completion of the 90-Day IIROC Licensing Training Program (valid & completed within the last 2 years) – If not already RR licensed with CIRO, you will be required to complete this course upon entrance to AIP.\n• Comfortable working within a fully commissioned environment and dealing with targets\n• Excellent time management and organizational skills sufficient to meet multiple and conflicting deadlines in a high pressure environment; and\n• Ability to learn quickly and make sound, timely decisions\n• Successful completion of the Certified Financial Planner (CFP) designation or equivalent is an asset\n\nWe encourage our associates at all levels to:\n• Grow professionally and inspire others to do the same\n• Work with and through others to achieve desired outcomes\n• Make prompt, pragmatic choices and act with the client in mind\n• Take ownership and hold themselves and others accountable for delivering results that matter\n• Contribute to the continuous evolution of the firm\n\nAt Raymond James – we honor, value, and respect the uniqueness, experiences, and backgrounds of all of our Associates. When associates bring their best authentic self, our organization, clients and communities thrive, it is part of our people-first culture. The Company is an equal opportunity employer and makes all employment decisions on the basis of merit and business needs.\n\nHere at Raymond James we demonstrate our commitment to ensuring equal opportunities for all candidates. To request accommodations, candidates are instructed to contact Human Resources via email at recruitment@raymondjames.ca. By reaching out to this email address, candidates can communicate their specific requirements and discuss the necessary accommodations they may need to participate fully in the recruitment process.\n\nCompensation for this role is $60,000.00/year commission",
            "job_is_remote": false,
            "job_posted_at": "22 hours ago",
            "job_posted_at_timestamp": 1732953600,
            "job_posted_at_datetime_utc": "2024-11-30T08:00:00.000Z",
            "job_location": "Edmonton, AB",
            "job_city": "Edmonton",
            "job_state": "Alberta",
            "job_country": "CA",
            "job_latitude": 53.5460983,
            "job_longitude": -113.49372659999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DeStbyK3rOiRejclsAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "19309400",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "6wR8NWZ1gu-XwU9SAAAAAA==",
            "job_title": "University Co-Op Student-Assistant Project Manager- Distribution Work Management-12-16 Months-Winter",
            "employer_name": "Hydro One",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTGlhjgSHYLxR4j8c47lMBNEU-O7K0WyniuysWv&s=0",
            "employer_website": "https://www.hydroone.com",
            "job_publisher": "Recruit.net",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://www.recruit.net/job/university-co-op-student-assistant-jobs/83D4ADE53DB345F5?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Recruit.net",
                    "apply_link": "https://www.recruit.net/job/university-co-op-student-assistant-jobs/83D4ADE53DB345F5?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "49858 - Toronto - Temporary - 12-16 Months\n\nHydro One is proud to be the largest electricity transmission and distribution provider in Ontario, serving nearly 1.5 million customers. We have a long history in the industry with our roots dating back over 110 years to 1906. Since then, we have worked to grow and evolve to meet the changing needs of our customers and communities across Ontario. Today, we’re focused on providing exceptional customer service and ensuring we are building safe communities where we live, work and play.\n\nIt’s an exciting time to join the team at Hydro One!\n• NOTE* Hydro One introduced a Hybrid Work Pilot Project in 2022 for most office-based roles. Employees work in-office/on-site two days a week and remotely from home for three days a week. Hydro One is adding refreshed workspaces and technology to support these changes. Join us as we ‘trial & learn’ a new modern way of working and be a key driver of future state!\n\nIn office but with intention – a time for team and trust building, collaboration, and socialization. Please reach out to us to learn more!\n\nJob location: Barrie/Toronto\n\nJob Duties:\n• Assist our Contract, Program, and Project Management Teams\n• Assist in ongoing project management support of Distribution lines and/or Engineering, Procurement and Construction (EPC) projects.\n• Assist in creating documentation for requests for quote (RFQs) and requests for proposal (RFPs) during the procurement stage of projects.\n• Receive assignments from supervisors on problems related to assigned area of work.\n• Research available resources and contacts and propose effective recommendations.\n• Assist in the analysis of problems and develop strategies and preferred solutions; and assist in the delivery of the solution through suppliers and service providers.\n• Assist in managing small- and large-scale deliverables in a cross functional team.\n• Gather, consolidate, analyze and present project data (metrics, project status, financial) in spreadsheets and dashboards to improve decision making Prepare comprehensive reports and specifications for projects and programs.\n• Work with others, including different project managers, as required.\n• Assist in managing and tracking project budget and status; report on variances and assist in redirection of programs and projects.\n• Assist in driving project success through timely update requests.\n• Perform other duties as required.\n\nThis job will provide you with the following professional development:\n• Develop project and program management skills\n• Skills to set up and conduct efficient meetings\n• Develop the skills to write effective briefing notes\n• Understand how to analyze financial data and its importance for making business decisions\n• Effective communication and writing skills\n• Knowledge of power systems and deployment of new investments and infrastructure\n• Experience supporting programs and projects utilizing the Capital Project Delivery Model\n• Opportunity to implement technical writing and problem-solving skills\n• Learn from a diverse group of project managers and mentors\n• Develop strong organizational and effective time management skills\n• First-hand experiences through site visits and in-field information sessions\n\nSelection Criteria:\n• Currently in 2nd year or 3rd year of a 4-year Engineering, Business or Finance program (Project Management focus an asset).\n• A valid driver's license.\n• Requires knowledge of technical writing to prepare effective reports.\n• Requires knowledge of engineering and/or business administration and financial reporting.\n• Requires mathematics, information technology, analytical studies related to the application, design, and performance of the transmission/distribution system.\n• Demonstrated strong communication, organization, and planning skills.\n• Ability to function effectively as a team member with a demonstrated ability to be an agent of change.\n• Strong working knowledge of SharePoint, Microsoft Office (Visio/Excel/Word/PowerPoint), SAP, etc is an asset.\n• PMP certification an asset\n• Requires excellent analytical, written, and oral communication skills.\n\nHydro One requires that all students applying for student opportunities be enrolled in post-secondary level studies and be returning to full-time studies upon the completion of their work term. Exceptions will be made in cases where students require a work term in order to graduate. Only applications submitted via Hydro One's career page will be accepted.\n\nIf you are an international student, please ensure you have obtained a proper work permit and a Social Insurance Number (SIN). Speak with your school’s career centre if you have any questions about acquiring this documentation.\n\nAt Hydro One we understand that the success and strength of our business rests with our people. When we develop their skills, we are investing in both their success and ours. To secure the best talent, we seek to create a workforce that reflects the diverse populations of the communities where we live and work and to create a culture based on safety, innovation and inclusiveness.\n\nWe are honoured to be recognized by Forbes in its list of Canada’s Best Employers for 2024.\n\nThank you for considering a career with Hydro One, we welcome applications from all qualified candidates. If you are having difficulty using our online application system and you need an accommodation due to a disability, please email careers@hydroone.com. Hydro One will provide reasonable accommodation for qualified individuals with disabilities in the job application process.\n\nDeadline: September 9, 2024\n\nPlease note that students are to apply to a maximum of 3 co-op positions per term.\n\nIn the event you are experiencing difficulties applying to this job please consult our help page here.\n\nIf you are available for an opportunity in a future semester, join our Talent Community to receive updates about jobs matching your interests. Click on this link on our Careers Page: Talent Network.",
            "job_is_remote": false,
            "job_posted_at": "6 hours ago",
            "job_posted_at_timestamp": 1733011200,
            "job_posted_at_datetime_utc": "2024-12-01T00:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D6wR8NWZ1gu-XwU9SAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13108200",
            "job_onet_job_zone": null
        },
        {
            "job_id": "eLT1qqCwHJMQ4rdWAAAAAA==",
            "job_title": "Process Engineering Analyst Co-Op - 16 Month Term",
            "employer_name": "CIBC",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRzb7QieKaTzg8OvCO8iynmc7FXNtdtI-yJO6uf&s=0",
            "employer_website": null,
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/process-engineering-analyst-co-op-16-month-term-at-cibc-4035989692?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/process-engineering-analyst-co-op-16-month-term-at-cibc-4035989692?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Levels.fyi",
                    "apply_link": "https://www.levels.fyi/jobs?jobId=106254278439379654&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "BeBee Canada Meet Opportunities",
                    "apply_link": "https://ca.bebee.com/job/f85df97b402bacc55a978e2d44cd2127?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "WhatJobs",
                    "apply_link": "https://en-ca.whatjobs.com/job/Process-Engineering-Analyst/toronto-ontario/81571755?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Blind",
                    "apply_link": "https://www.teamblind.com/jobs/130357722?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "We’re building a relationship-oriented bank for the modern world. We need talented, passionate professionals who are dedicated to doing what’s right for our clients.\n\nAt CIBC, we embrace your strengths and your ambitions, so you are empowered at work. Our team members have what they need to make a meaningful impact and are truly valued for who they are and what they contribute.\n\nTo learn more about CIBC, please visit CIBC.com\n\nWhat You’ll Be Doing\n\nCIBC’s Process Engineering, Intelligent Automation, End to End Optimization, and Complaints Management Program Data & Insights Teams are hiring several students for a 16-month Co-op (PEY)! This is a great opportunity to be a part of highly collaborative, agile team-based environment, solving problems to create meaningful change across the enterprise. Join our team and stretch your innovative thinking skills to help enhance the banking experience for the modern world.\n• PE Team: Serve as internal consultants managing projects across the business. You'll use Lean, Six Sigma, BPM, and project management to improve client processes.\n• IA Team: Collaborate with technology and business partners to enhance automation efficiency. You'll apply analytics and reporting skills to streamline business intelligence for the automation portfolio.\n• E2E Team: Analyze process activities as part of the end-to-end operational transformation team. Support business process optimization using no- or low-tech improvements to enhance overall performance.\n• CMP Team: Transform the complaint handling journey for clients and employees. You’ll leverage Lean, Six Sigma, and human-centered design, while employing advanced analysis for data-driven solutions.\n\nAt CIBC we enable the work environment most optimal for you to thrive in your role. Details on your work arrangement (proportion of on-site and remote work) will be discussed at the time of your interview\n\nImportant information\n• We may ask you to complete an attribute-based assessment and other skills tests (such as simulation, coding, French proficiency, MS Office). Our goal for the application process is to get to know more about you, all that you have to offer, and give you the opportunity to learn more about us.\n• This posting is for current STEM/ Engineering undergraduate students in their 3rd or 4th year of study only. Candidates must be eligible to complete a full 16-month co-op term. You must be currently enrolled in post-secondary education and returning to full-time studies to be eligible.\n• Please include your resume (no more than 2 pages), a cover letter (no more than 1 page), and your most recent unofficial transcript with your application. These should all be uploaded into the Resume section of the application as one pdf document.\n\nHow You’ll Succeed\n• Innovation - You’ll participate in process mapping, statistics evaluation, time studies, operations center visits, and interviews, to understand the current state and to design future state processes.\n• Simplification - You’ll spend time assessing current CIBC processes and making suggestions to reduce costs and decrease cycle time. You will apply VBA, Power Query, and Power BI for data analysis and creating innovative analytical solutions.\n• Teamwork - You’ll collaborate with team members and stakeholders to identify opportunities for process improvements and implement solutions.\n• Communication - You’ll define project requirements and prepare project summary reports (e.g., post-implementation reviews and data gathering from operations center visits).\n• Change Agent - You are aware of AI (traditional and generative) and have ability to apply AI concepts to improve processes and improve your own personal productivity.\n• Accuracy- You’ll document detailed current state maps, conducting process analysis, and designing future state process and client journey flows using Microsoft Visio and other process mapping tools.\n• Detail – You’ll use your skills to gather, clarify and apply information provided accurately and your critical thinking skills help you inform your decision making.\n\nWho you are\n• Values matter to you. You bring your real self to work, and you live our values – trust, teamwork, and accountability.\n• You put our clients first. You engage with purpose to find the right solutions. You go the extra mile because it's the right thing to do.\n• You're digitally savvy. You seek out innovative solutions and embrace evolving technologies. You can easily adapt to new tools and trends.\n• You give meaning to data. You enjoy investigating complex problems and making sense of information. You're confident in your ability to communicate detailed information in an impactful way.\n• You understand that success is in the details. You notice things that others don't. Your critical thinking skills help to inform your decision making.\n\nWhat CIBC Offers\n\nAt CIBC, your goals are a priority. We start with your strengths and ambitions as an employee and strive to create opportunities to tap into your potential.\n• We work to recognize you in meaningful, personalized ways including a competitive compensation, a banking benefit*, wellbeing support, and additional offers such as employee and family assistance programs and MomentMakers, our social, points-based recognition program.\n• Our spaces and technological toolkit will make it simple to bring together great minds to create innovative solutions that make a difference for our clients.\n• Subject to program terms and conditions\n\nWhat You Need To Know\n• CIBC is committed to creating an inclusive environment where all team members and clients feel like they belong. We seek applicants with a wide range of abilities and we provide an accessible candidate experience. If you need accommodation, please contact Mailbox.careers-carrieres@cibc.com\n• You need to be legally eligible to work at the location(s) specified above and, where applicable, must have a valid work or study permit.\n• We may ask you to complete an attribute-based assessment and other skills tests (such as simulation, coding, French proficiency, MS Office). Our goal for the application process is to get to know more about you, all that you have to offer, and give you the opportunity to learn more about us.\n\nJob Location\n\nToronto-81 Bay, 15th Floor\n\nEmployment Type\n\nTemporary (Fixed Term)\n\nWeekly Hours\n\n37.5",
            "job_is_remote": false,
            "job_posted_at": "20 hours ago",
            "job_posted_at_timestamp": 1732960800,
            "job_posted_at_datetime_utc": "2024-11-30T10:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DeLT1qqCwHJMQ4rdWAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17214100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "OLc8cazFUSGNRGqnAAAAAA==",
            "job_title": "Marketing and Social Media Internship => Relocate to China",
            "employer_name": "Laowaicareer",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTj55pYEUr11QGWbNkGDZKulXw_FnpmGWox521_&s=0",
            "employer_website": "https://www.laowaicareer.com",
            "job_publisher": "Sercanto",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://fr.ca.sercanto.com/detail/a/marketing-and-social-media-internship-relocate-to-china_richmond_29572394?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Sercanto",
                    "apply_link": "https://fr.ca.sercanto.com/detail/a/marketing-and-social-media-internship-relocate-to-china_richmond_29572394?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Description: Students applying for this internship must have strong communication skills.Majoring or work experience in Public Relations, Communications, Marketing or Journalism are a plus. Applicants should also have strong writing skills, as well as a solid understanding of social media. Only interns with fluent English, proficient with Microsoft Excel and other Microsoft Office applications should apply. Design skills are a plus. Requirements: Your daily duties and responsibilities shall consist of, but not limited to the following:  Monitor all forms of media  Schedule and coordinate speaking engagements, appearances, photo shoots, and other special events  Write press releases, blog articles and other PR copies  Assist with composing publicity material, promotional flyers and brochures;  Develop social media network, including Twitter, Facebook, Wechat, LinkedIn, Google+ etc.  Create or update databases  Assist with the creation, editing and promotion of multimedia content. Benefits: Skills: Account Marketing, BD, Brand PR",
            "job_is_remote": false,
            "job_posted_at": "6 hours ago",
            "job_posted_at_timestamp": 1733011200,
            "job_posted_at_datetime_utc": "2024-12-01T00:00:00.000Z",
            "job_location": "Richmond, BC",
            "job_city": "Richmond",
            "job_state": "British Columbia",
            "job_country": "CA",
            "job_latitude": 49.1665898,
            "job_longitude": -123.133569,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DOLc8cazFUSGNRGqnAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "27303100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "qQI0CgpIOgG6AUhXAAAAAA==",
            "job_title": "Writer/Journalist Internship Part-Time in Worldwide - Remote Worldwide",
            "employer_name": "Borgen Project",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRg_69l81P4Ka2HKdLNiuy4WGo28Yk9AXOYZ_Rh&s=0",
            "employer_website": "https://borgenproject.org",
            "job_publisher": "Recruit.net",
            "job_employment_type": "Part-time",
            "job_employment_types": [
                "PARTTIME"
            ],
            "job_apply_link": "https://www.recruit.net/job/writer-journalist-worldwide-worldwide-jobs/D72B23C5C99E4B5D?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Recruit.net",
                    "apply_link": "https://www.recruit.net/job/writer-journalist-worldwide-worldwide-jobs/D72B23C5C99E4B5D?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "WhatJobs",
                    "apply_link": "https://en-ca.whatjobs.com/job/Writer-Journalist-Internship/north-vancouver-vancouver-british-columbia/75778503?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobilize",
                    "apply_link": "https://www.jobilize.com/amp/job/ca-bc-north-vancouver-writer-journalist-internship-part-time-worldwide-pdfxqia?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Are you passionate about making a difference in the world? Look no further!\nThe Borgen Project is an international organization that works at the political level to improve living conditions for people impacted by war, famine and poverty.\nWith 20 years of experience in the advocacy space, The Borgen Project has worked to support the passage of numerous bills that have benefitted close to 500 million people in developing countries.\nWriter/Journalist Internship: The role is focused on content creation for BORGEN Magazine or The Borgen Project Blog. This is a part-time 12-hours per week, 12 week, unpaid remote internship. If your availability is limited, you can work ahead and complete the program in fewer weeks.\n.\nResponsibilities will include:\nArticle writing.\nResearching topics.\nAssisting with The Borgen Project's advocacy efforts.\nAssisting with fundraising. Create a personal fundraising campaign and meet targets.\nExperience: No prior experience is necessary, we’re looking for people who are passionate about fighting poverty and righting wrongs, regardless of your GPAs/background.\nDetails: This is an unpaid internship, although college credit is available.\nStart Date: New programs begin every month, you choose the month you wish to start.",
            "job_is_remote": false,
            "job_posted_at": "6 hours ago",
            "job_posted_at_timestamp": 1733011200,
            "job_posted_at_datetime_utc": "2024-12-01T00:00:00.000Z",
            "job_location": "North Vancouver, BC",
            "job_city": "North Vancouver",
            "job_state": "British Columbia",
            "job_country": "CA",
            "job_latitude": 49.3199816,
            "job_longitude": -123.0724139,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DqQI0CgpIOgG6AUhXAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "27302200",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "fRoQu09DFYNHLGOdAAAAAA==",
            "job_title": "University Co-Op Student- IT Operations - Business Analyst- 8 Months-Winter 2025",
            "employer_name": "Hydro One",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTGlhjgSHYLxR4j8c47lMBNEU-O7K0WyniuysWv&s=0",
            "employer_website": "https://www.hydroone.com",
            "job_publisher": "Recruit.net",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://www.recruit.net/job/university-co-op-student-operations-jobs/D0D5BCABBEFD02FE?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Recruit.net",
                    "apply_link": "https://www.recruit.net/job/university-co-op-student-operations-jobs/D0D5BCABBEFD02FE?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "49855 - Toronto - Temporary - 8 Months\n\nHydro One is proud to be the largest electricity transmission and distribution provider in Ontario, serving nearly 1.5 million customers. We have a long history in the industry with our roots dating back over 110 years to 1906. Since then, we have worked to grow and evolve to meet the changing needs of our customers and communities across Ontario. Today, we’re focused on providing exceptional customer service and ensuring we are building safe communities where we live, work and play.\n\nIt’s an exciting time to join the team at Hydro One!\n\nNOTE* Employees work in-office/on-site five days a week\n\nJob Duties: Assist the Digital Workplace Services Team within IT Operations\n• Assist in the Application Readiness/Assessment phase of the Windows 11 Migration Project\n• Assist in ongoing project management support of the Windows 11 Application Readiness Project\n• Assist in creating reports, dashboards, and other visualizations to clearly articulate progress, statuses, and risks.\n• Communicate with internal teams, peers, and 3rd party vendors to obtain concise information with respect to Windows 11 readiness of over 800 applications.\n• Assist in the creation and modification of department processes.\n• Receive assignments from supervisors on problems related to assigned area of work.\n• Research available resources and contacts required to perform the necessary analysis and propose effective recommendations.\n• Work with others, including different team managers and senior staff as required.\n• Assist in managing and tracking projects statuses, report on variances.\n• Assist in driving project success through timely update requests.\n• Perform other duties as required.\n\nThis job will provide you with the following professional development:\n• Develop project and program management skills.\n• Understand the complexity of managing large software application portfolios within large organizations, their unique uses within various business units, and downstream impacts of change as it pertains to the IT landscape (e.g. software licensing, device hardware compatibility, security compliance, etc.)\n• Skills to set up and conduct efficient meetings.\n• Develop the skills to write effective briefing notes.\n• Understand how to analyze data and its importance for making business decisions.\n• Effective communication and writing skills.\n• Knowledge of IT Operations within a large Transmission and Distribution Utility\n• Experience supporting programs and projects within the broader IT Operations teams.\n• Opportunity to implement problem-solving skills.\n• Learn from a diverse group of IT analysts, managers and mentors.\n• Develop strong organizational and effective time management skills.\n\nSelection Criteria:\n• Currently in 2nd year or 3rd year of a 4-year Business or IT Management program.\n• Requires strong working knowledge of Microsoft Excel and the Microsoft Office Suite (Visio/Excel/Word/PowerPoint/SharePoint)\n• Working knowledge of PowerBI or other analytics / visualization tools would be a definite asset.\n• Demonstrated strong communication, organization, and planning skills.\n• Requires knowledge of IT and business administration.\n• Ability to function effectively as a team member with a demonstrated ability to be an agent of change.\n• Requires excellent analytical, written, and oral communication skills.\n\nHydro One requires that all students applying for student opportunities be enrolled in post-secondary level studies and be returning to full-time studies upon the completion of their work term. Exceptions will be made in cases where students require a work term in order to graduate. Only applications submitted via Hydro One's career page will be accepted.\n\nIf you are an international student, please ensure you have obtained a proper work permit and a Social Insurance Number (SIN). Speak with your school’s career centre if you have any questions about acquiring this documentation.\n\nAt Hydro One we understand that the success and strength of our business rests with our people. When we develop their skills, we are investing in both their success and ours. To secure the best talent, we seek to create a workforce that reflects the diverse populations of the communities where we live and work and to create a culture based on safety, innovation and inclusiveness.\n\nWe are honoured to be recognized by Forbes in its list of Canada’s Best Employers for 2024.\n\nThank you for considering a career with Hydro One, we welcome applications from all qualified candidates. If you are having difficulty using our online application system and you need an accommodation due to a disability, please email careers@hydroone.com. Hydro One will provide reasonable accommodation for qualified individuals with disabilities in the job application process.\n\nDeadline: September 9, 2024\n\nPlease note that students are to apply to a maximum of 3 co-op positions per term.\n\nIn the event you are experiencing difficulties applying to this job please consult our help page here.\n\nIf you are available for an opportunity in a future semester, join our Talent Community to receive updates about jobs matching your interests. Click on this link on our Careers Page: Talent Network",
            "job_is_remote": false,
            "job_posted_at": "6 hours ago",
            "job_posted_at_timestamp": 1733011200,
            "job_posted_at_datetime_utc": "2024-12-01T00:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DfRoQu09DFYNHLGOdAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13111100",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "unAE24doszjONeQpAAAAAA==",
            "job_title": "Co-op Student, Assurance & Accounting",
            "employer_name": "MNP",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQB8gfYdGSHm9M7lRrqfPqdOFOquQd6pf8Xfsq1&s=0",
            "employer_website": null,
            "job_publisher": "ZipRecruiter",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://www.ziprecruiter.com/c/MNP/Job/Co-op-Student,-Assurance-&-Accounting/-in-Terrace,BC?jid=d49bc9deaa802ed1&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/MNP/Job/Co-op-Student,-Assurance-&-Accounting/-in-Terrace,BC?jid=d49bc9deaa802ed1&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "ACCA Careers - ACCA Global",
                    "apply_link": "https://jobs.accaglobal.com/job/12992232/co-op-student-assurance-and-accounting/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=0c4f6e0a20e47e0a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/co-op-student-assurance-accounting-mnp-JV_IC2278177_KO0,34_KE35,38.htm?jl=1009386319419&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/co-op-student-assurance-accounting-at-mnp-3986152032?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Eluta.ca",
                    "apply_link": "https://www.eluta.ca/spl/co-op-student-assurance-accounting-7051f95b02f74b50173ae7d2b344d199?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/fbbE2rMd8bEOIvZgsAfimiSelFbInhRSlCtpMoEvX_15ICXY3nQ3PQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "JobLeads",
                    "apply_link": "https://www.jobleads.com/ca/job/co-op-student-assurance-accounting--terrace--e18926452ff880e64eeaee1ab7966d4ff?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Inspirational, innovative and entrepreneurial - this is how we describe our empowered teams. Combine your passion with purpose and join a culture that is thriving in the face of change.\n\nMake an impact with our Assurance & Accounting team as a Co-op Student for a 4 month or 8 month co-op starting January 2025, May 2025, or September 2025. This diverse team of professionals are dedicated to exceeding clients’ unique needs within a rapidly evolving business and financial reporting landscape. As a trusted advisor, you’ll provide comprehensive, tailored financial information that enables clients to make informed decisions with confidence.\n\nMNP is proudly Canadian. Providing business strategies and solutions, we are a leading national accounting, tax and business advisory firm in Canada. Entrepreneurial to our core, our talented team members transcend obstacles into opportunities and are successfully transforming mid-market business practices.\n\nWhen applying, please submit your resume, cover letter, transcript and other applicable forms, as necessary, in 1 document.\n\nResponsibilities\n• Develop technical skills in areas such as: compilations, reviews, audits, bookkeeping and tax\n• Develop and apply knowledge of International Financial Reporting Standards (IFRS), Generally Accepted Accounting Principles (GAAP) and/or Accounting Standards for Private Enterprise (ASPE)\n• Set-up files for new clients and newly incorporated businesses, manage multiple files simultaneously and conduct inventory counts\n• Perform accounts receivable, accounts payable, capital asset acquisition and disposition and payroll walk-through with clients in a professional manner\n• Summarize current financial status by collecting information and preparing balance sheet, profit and loss statements and other relevant reports\n• Assess appropriateness of audit evidence for expenses, revenues, capital asset additions, accounts payable, accounts receivable and prepaid expenses\n• Review, investigate and correct discrepancies and irregularities in financial entries, documents and reports\n• Establish charts of accounts and prepare entries for posting to accounts\n• Prepare correspondence, technical reports, client summaries and presentations outlining engagement findings, facts and highlights\n• Collaborate with client engagement team and build relationships with client contacts\n• Contribute to the development of new ideas and approaches to improve work processes while effectively using MNP internal programs and systems\n• Maintain flexibility to travel, as necessary\n\nSkills and Experience\n• Working towards a bachelor’s degree in commerce or business administration (accounting or finance major is preferred)\n• Working towards prerequisites for admission into the CPA Professional Education Program (PEP)\n• Previous accounting related office experience is considered an asset\n• Customer service and/or client service experience is considered an asset\n• Experience working with accounting and tax software is considered an asset\n\nMyRewards@MNP\n\nWith a focus on high-potential earnings, MNP is proud to offer customized rewards that support our unique culture and a balanced lifestyle to thrive at work and outside of the office. You will be rewarded with generous base pay, vacation time, exclusive access to perks and discounts, MNP University, a flexible ‘Dress For Your Day’ environment, firm sponsored social events and more! The annual salary for this position is: $48,000 and will be prorated to your term.\n\nDiversity@MNP\n\nWe embrace diversity as a core value and celebrate our differences. We believe each team member contributes unique gifts and amplifying their potential makes our business stronger. We encourage people with disabilities to apply!",
            "job_is_remote": false,
            "job_posted_at": "17 hours ago",
            "job_posted_at_timestamp": 1732971600,
            "job_posted_at_datetime_utc": "2024-11-30T13:00:00.000Z",
            "job_location": "Terrace, BC",
            "job_city": "Terrace",
            "job_state": "British Columbia",
            "job_country": "CA",
            "job_latitude": 54.5181925,
            "job_longitude": -128.6031539,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DunAE24doszjONeQpAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13201100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "rW7J-2YaNaQRZYgEAAAAAA==",
            "job_title": "Political Affairs Internship Part-Time in Worldwide - Remote Worldwide - Political Team",
            "employer_name": "Borgen Project",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRg_69l81P4Ka2HKdLNiuy4WGo28Yk9AXOYZ_Rh&s=0",
            "employer_website": "https://borgenproject.org",
            "job_publisher": "Recruit.net",
            "job_employment_type": "Part-time",
            "job_employment_types": [
                "PARTTIME"
            ],
            "job_apply_link": "https://www.recruit.net/job/political-affairs-worldwide-worldwide-political-jobs/F92C7D1538BE3982?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Recruit.net",
                    "apply_link": "https://www.recruit.net/job/political-affairs-worldwide-worldwide-political-jobs/F92C7D1538BE3982?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Are you passionate about making a difference in the world? Look no further!\nThe Borgen Project is an international organization that works at the political level to improve living conditions for people impacted by war, famine and poverty.\nWith 20 years of experience in the advocacy space, The Borgen Project has worked to support the passage of numerous bills that have benefitted close to 500 million people in developing countries.\nPolitical Affairs Internship: The role focuses on making poverty a focus of U.S., Canadian and U.K. foreign policy. This is a part-time 12-hours per week, 12 week, unpaid remote internship. If your availability is limited, you can work ahead and complete the program in fewer weeks.\nResponsibilities will include:\nLeading public and political outreach in your state and district.\nMeeting with members of Congress/Government in your State/District/Constituency.\nRepresenting The Borgen Project at various business, political and community events.\nAssisting with fundraising. Create a personal fundraising campaign and meet targets.\nMobilizing individuals to contact their members of Government in support of key poverty-reduction legislation.\nSpeaking to groups, classes and organizations.\nWriting letters of support for key programs to political leaders, media and other groups.\nExperience: No prior experience is necessary, we’re looking for people who are passionate about fighting poverty and righting wrongs, regardless of your GPAs/background.\nDetails: This is an unpaid internship, although college credit is available.\nStart Date: New programs begin every month, you choose the month you wish to start.",
            "job_is_remote": false,
            "job_posted_at": "6 hours ago",
            "job_posted_at_timestamp": 1733011200,
            "job_posted_at_datetime_utc": "2024-12-01T00:00:00.000Z",
            "job_location": "Kimberley, BC",
            "job_city": "Kimberley",
            "job_state": "British Columbia",
            "job_country": "CA",
            "job_latitude": 49.6651567,
            "job_longitude": -115.9967207,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DrW7J-2YaNaQRZYgEAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "19309400",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "2W9j_fYaGvTTDN1MAAAAAA==",
            "job_title": "Stage - Hiver 2025 - Formation main doeuvre \\ Internship - Winter 2025 - Manpower Training",
            "employer_name": "RTX",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQnhBpgqoEpl1PFw02B0MTo7s0oI39eNBb2LJvI&s=0",
            "employer_website": null,
            "job_publisher": "Recruit.net",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://www.recruit.net/job/stage-hiver-formation-main-oeuvre-jobs/B9630BA1B51B43D8?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Recruit.net",
                    "apply_link": "https://www.recruit.net/job/stage-hiver-formation-main-oeuvre-jobs/B9630BA1B51B43D8?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "WhatJobs",
                    "apply_link": "https://en-ca.whatjobs.com/job/Stage-Hiver-2025/qu%C3%A9bec-quebec/81070837?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Date d’affichage / Date Posted:\n2024-04-05\n\nPays / Country:\nCanada\n\nEmplacement / Location:\nLOC13052 1000 Boul Marie Victorin,Longueuil,Quebec,J4G 1A1,Canada\n\nQui sommes-nous ?\n\nChez Pratt & Whitney, nous croyons que le vol motorisé a transformé et continuera de transformer le monde. C'est pourquoi nous travaillons avec le cœur d'un explorateur et le cran d'un perfectionniste pour concevoir, construire et entretenir les moteurs d'avion les plus perfectionnés au monde. Nous le faisons dans le cadre d'un portefeuille diversifié comprenant les moteurs commerciaux, les moteurs militaires, l'aviation d'affaires, l'aviation générale, l'aviation régionale et l'aviation d'hélicoptère, afin de transformer les possibilités en réalités pour nos clients. C'est ainsi que nous abordons notre travail chez Pratt & Whitney, et c'est pourquoi nous sommes inspirés à nous dépasser.\n\nQue vous soyez actuellement aux études au CEGEP ou au baccalauréat, nous pouvons vous aider à exploiter votre potentiel, à améliorer vos compétences et à faire de l'impossible une réalité. Si vous êtes présentement inscrit dans une université canadienne, c'est le moment d'entamer un parcours professionnel susceptible d'avoir un impact et de favoriser l'innovation pour les générations à venir.\n\nChez Pratt & Whitney, la différence que vous faites est visible chaque jour. Il suffit de lever les yeux. Êtes-vous prêt (e) à vous dépasser ?\n\nDates du stage : 6 janvier au 25 avril 2025\n\nConsultez notre chaîne YouTube : https://www.youtube.com/@PrattWhitneyCa\n\nNotre site web : https://www.pwc.ca/fr\n\nNos attentes :\n\nLes étudiants sont prêts à relever les défis suivants:\n• Support à l’intégration du nouveau système d’amélioration continue (CORE) au niveau des processus d’affaires en formation\n• Optimisation des processus de formation (Ex. planification annuel, inscriptions, demande de développement de cours, formation en milieu de travail)\n• Standardisation des contenus de cours en collaboration avec les fournisseurs de service\n• Support dans la gestion des compétences pour employés d’usines (plate-forme Poka).\n\nÀ quoi ressemblera votre travail quotidien :\n• Développer et mise à jour des contenus de cours avec des employés experts et les fournisseurs de service.\n• Collaboration avec des employés et gestionnaires pour poursuivre l’implentation de la plate-forme POKA de formation en mlieu de travail;\n• Participer à l’amélioration continue des processus d’affaire de l’organisation\n\nCe dont vous avez besoin pour réussir :\n\nLes incontournables :\n• Être éligible à travailler au Canada.\n• Être inscrit dans une université canadienne pendant toute la durée de votre stage.\n• Être en mesure de travailler sur place dans la province où vous êtes embauché, le cas échéant.\n• Excellentes compétences en communication en français (parlé/écrit).\n• Une bonne connaissance de la langue anglaise, à l’écrit et à l’oral, est requise pour ce poste compte tenu des besoins opérationnels de l’Employeur et des personnes avec lesquelles le candidat sera appelé à interagir.\n\nAtouts :\n• Sens de l'organisation et capacité à travailler sous pression avec des priorités concurrentes et variables\n• Compétences en matière de gestion de projet\n\nEnvironnement de travail\n\nQuel est mon type de rôle :\n\nSur site, horaire flexible\n\nCe poste s’inscrit dans un milieu de travail francophone, néanmoins il nécessite une connaissance fonctionnelle de l’anglais pour lire et comprendre des instructions spécialisées, des plans, des dessins et des termes techniques qui peuvent émaner d’organisations internationales, ainsi que pour écrire et parfois communiquer en anglais avec des clients, des fournisseurs ou des collègues internationaux.\n\nDiversité, équité et inclusion\n\nLe pronom masculin est utilisé sans discrimination et uniquement dans le but de faciliter la lecture du texte. P&WC est un employeur qui souscrit au principe de l'égalité des chances et qui cherche à promouvoir la diversité et l'inclusion. Nous examinerons les candidatures de tous les candidats qualifiés, indépendamment de leur race, de leur couleur, de leur religion, de leur orientation sexuelle, de leur sexe, de leur nationalité, de leur âge, de leur handicap, de leur statut d'ancien combattant ou de tout autre statut protégé par la loi.\n\nVeuillez noter que des licences, des permis, des certifications ou d'autres types d'autorisations pourraient être nécessaires si le poste requiert l'accès à des données contrôlées ou à des données soumises à une règle ou à un règlement applicable.\n\n----------------\n\nWho we are:\n\nAt Pratt & Whitney, we believe that powered flight has transformed and will continue to transform the world. That's why we work with an explorer's heart and a perfectionist’s grit to design, build, and service world's most advanced aircraft engines. We do this across a diverse portfolio including Commercial Engines, Military Engines, Business Aviation, General Aviation, Regional Aviation, and Helicopter Aviation and as a way of turning possibilities into realities for our customers. This is how we at Pratt & Whitney approach our work, and this is why we are inspired to go beyond.\n\nWhether you are currently pursuing a CEGEP diploma or a bachelor's degree, we can help you harness your potential, advance your skills and make the impossible a reality. If you are currently enrolled in a Canadian university, now is the moment to start a career path that can drive impact and innovation for generations to come.\n\nAt Pratt & Whitney, the difference you make is on display every day. Just look up. Are you ready to go beyond?\n\nInternship dates: January 6th to April 25th, 2025\n\nCheck out our YouTube channel: https://www.youtube.com/@PrattWhitneyCa\n\nOur website: https://www.pwc.ca/en\n\nOur expectations:\n\nWe are looking for students who are up for the following challenges:\n• Support the integration of our new continuous improvement system (Core) in relation to our training processes.\n• Optimisation of our training processes (Ex. Annual plan, registrations, course development, on the job training)\n• In collaboration with our training providers, standardize our training contents.\n• Support the competency management of our shop floor employees via the Poka platform.\n\nWhat your day to day will look like:\n• Develop and revise training contents with internal subject matter experts and training providers.\n• Collaborate with employees and management for the implementation of the Poka numerical platform for On the job training\n• Participate in the continuous improvement of our business processes\n\nWhat you need to be successful:\n\nMust haves:\n• Be eligible to work in Canada\n• Be enrolled in a Canadian university throughout your internship\n• Be able to work on-site in the province where you are hired if applicable\n• Excellent communication skills in French (spoken/written).\n• A good knowledge of the English language, both written and spoken, is required for this the operational needs of the Employer and the people with whom the candidate will interact.\n\nAssets:\n• Organizational skills and ability to work under pressure with competing and varying priorities\n• Project management skills\n\nWork Environment\n\nWhat my role type is:\n\nOn-site, flexible schedule\n\nAlthough this position is part of a French-speaking work environment, it requires a working knowledge of English to read and understand specialized instructions, plans, drawings and technical terms that may emanate from international organizations, as well as to write and sometimes communicate in English with customers, suppliers or international colleagues.\n\nDiversity, Equity & Inclusion\n\nThe masculine pronoun is used without discrimination and solely for the purpose of making the text easier to read. P&WC is an equal opportunities employer, seeking to promote diversity and inclusion. We will consider applications from all qualified candidates, regardless of their race, colour, religion, sexual orientation, gender, nationality, age, disability, veteran status or any other status protected by law.\n\nPlease note that licenses, permits, certifications or other types or authorizations could be required if the position requires access to controlled data or data subject to any applicable rule or regulation.\n\nRTX is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.\n\nPrivacy Policy and Terms:\n\nClick on this link to read the Policy and Terms",
            "job_is_remote": false,
            "job_posted_at": "6 hours ago",
            "job_posted_at_timestamp": 1733011200,
            "job_posted_at_datetime_utc": "2024-12-01T00:00:00.000Z",
            "job_location": "Québec City, Quebec",
            "job_city": "Québec City",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 46.8130816,
            "job_longitude": -71.20745959999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D2W9j_fYaGvTTDN1MAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13115100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "FATH_Brtb4Ah6hFWAAAAAA==",
            "job_title": "Telecom Operations Support University Co-Op Student",
            "employer_name": "Hydro One",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTGlhjgSHYLxR4j8c47lMBNEU-O7K0WyniuysWv&s=0",
            "employer_website": "https://www.hydroone.com",
            "job_publisher": "Recruit.net",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://www.recruit.net/job/telecom-operations-support-university-co-jobs/56677ABFD31F9799?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Recruit.net",
                    "apply_link": "https://www.recruit.net/job/telecom-operations-support-university-co-jobs/56677ABFD31F9799?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Title : University Co-Op Student\n\nLocation : TCT - Hydro One Head Office - Trinity Square, 483 Bay Street, Toronto, ON M5G 2P5\n\nCompany : Acronym Solutions\n\nAcronym Solutions is a full-service information and communications technology company that provides a range of scalable and secure solutions. With more than 20 years’ experience managing the communications system that enables Ontario’s electrical grid, Acronym is uniquely positioned to understand the mission-critical needs of any business. We deliver innovative and reliable services that respond to the changing demands of businesses and support rapid growth and digital transformation.\n\nIt’s an exciting time to join the team at Acronym Solutions!\n\nYou will be a member of the above group, which is responsible for:\n\nOur team is responsible for managing power system telecom services (PSTS) data for Hydro One Networks and Acronym Solutions. We capture telecommunication engineering designs in various operations support systems (OSS) to support operating and planning functions across the organization. We are looking for an enthusiastic, bright individual to assist us.\n\nYour job duties may include:\n• Assist senior staff with operations support systems (OSS) updates\n• Conduct research and analysis of engineering design documents and systems of record\n• Generate regular status reports and other reports as required\n• Prepare training documentation\n\nThis job will provide you with the following professional development:\n• Power system telecom services knowledge\n• Basic transmission system protection and control knowledge\n• Experience with operations support systems (OSS)\n• Experience with Engineering design documents\n\nSelection Criteria:\n• Discipline: Telecom or power system engineering, Telecommunication Engineer, Electrical Engineer or Computer Science\n• Basic understanding of protection and control principles\n• Basic understanding of networking and telecom systems and services\n• Ability to multi-task, prioritize and meet deadlines\n• Self-starter with exceptional communication skills\n• Proficiency with MS Office Suite\n\nDeadline: September 9, 2024\n\nAcronym requires that all students applying for student opportunities be enrolled in post-secondary level studies and be returning to full-time studies upon the completion of their work term. Exceptions will be made in cases where students require a work term in order to graduate. Only applications submitted via Acronym's career page will be accepted.\n\nIf you are an international student, please ensure you have obtained a proper work permit and a Social Insurance Number (SIN). Speak with your school’s career centre if you have any questions about acquiring this documentation.\n\nAt Acronym we understand that the success and strength of our business rests with our people. When we develop their skills, we are investing in both their success and ours. To secure the best talent, we seek to create a workforce that reflects the diverse populations of the communities where we live and work and to create a culture based on safety, innovation and inclusiveness.\n\nWe are honoured to be recognized by Forbes in its list of Canada’s Best Employers for 2024.\n\nThank you for considering a career with Acronym, we welcome applications from all qualified candidates. If you are having difficulty using our online application system and you need an accommodation due to a disability, please email careers@hydroone.com. Acronym will provide reasonable accommodation for qualified individuals with disabilities in the job application process.\n\nIn the event you are experiencing difficulties applying to this job please consult our help page here.\n\nIf you are available for an opportunity in a future semester, join our Talent Community to receive updates about jobs matching your interests. Click on this link on our Careers Page: Talent Network.",
            "job_is_remote": false,
            "job_posted_at": "6 hours ago",
            "job_posted_at_timestamp": 1733011200,
            "job_posted_at_datetime_utc": "2024-12-01T00:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DFATH_Brtb4Ah6hFWAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15115200",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "tP-4a_vfCfFkbfzLAAAAAA==",
            "job_title": "Stage - Hiver 2025 - Support technique au laboratoire / Internship - Winter 2025 - Technical support in laboratory",
            "employer_name": "RTX",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQnhBpgqoEpl1PFw02B0MTo7s0oI39eNBb2LJvI&s=0",
            "employer_website": null,
            "job_publisher": "Recruit.net",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://www.recruit.net/job/stage-hiver-support-technique-au-jobs/C5B7C97B3E06C960?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Recruit.net",
                    "apply_link": "https://www.recruit.net/job/stage-hiver-support-technique-au-jobs/C5B7C97B3E06C960?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Date d’affichage / Date Posted:\n2024-08-19\n\nPays / Country:\nCanada\n\nEmplacement / Location:\nLOC13060 7007 Chemin De La Savane,Saint-Hubert,Quebec,J3Y 8Y9,Canada\n\nQui sommes-nous ?\n\nChez Pratt & Whitney, nous croyons que le vol motorisé a transformé et continuera de transformer le monde. C'est pourquoi nous travaillons avec le cœur d'un explorateur et le cran d'un perfectionniste pour concevoir, construire et entretenir les moteurs d'avion les plus perfectionnés au monde. Nous le faisons dans le cadre d'un portefeuille diversifié comprenant les moteurs commerciaux, les moteurs militaires, l'aviation d'affaires, l'aviation générale, l'aviation régionale et l'aviation d'hélicoptère, afin de transformer les possibilités en réalités pour nos clients. C'est ainsi que nous abordons notre travail chez Pratt & Whitney, et c'est pourquoi nous sommes inspirés à nous dépasser.\n\nQue vous soyez actuellement aux études au baccalauréat ou à la maîtrise, nous pouvons vous aider à exploiter votre potentiel, à améliorer vos compétences et à faire de l'impossible une réalité. Si vous êtes présentement inscrit dans une université canadienne, c'est le moment d'entamer un parcours professionnel susceptible d'avoir un impact et de favoriser l'innovation pour les générations à venir.\n\nChez Pratt & Whitney, la différence que vous faites est visible chaque jour. Il suffit de lever les yeux. Êtes-vous prêt (e) à vous dépasser ?\n\nDates du stage : 6 janvier au 25 avril 2025\n\nConsultez notre chaîne YouTube : https://www.youtube.com/@PrattWhitneyCa\n\nNotre site web https://www.pwc.ca/fr\n\nNos attentes :\n\nL’équipe du support technique est responsable de la création et du maintien des documents de travail dont le plan 5 est propriétaire pour toutes les familles de moteurs P&WC (turbofan, turbopropulseurs, régionaux et hélicoptères). De plus, le groupe est engagé à solutionner les problèmes rencontrés dans la réparation des composantes au niveau de l’outillage, de la programmation et du laboratoire. Nous recherchons une personne avec une expérience technique dans le domaine de l’usinage et de la tôlerie. Le spécialiste devra collaborer avec d’autres experts en après-marché tel que l’ingénierie, l’outillage, spécialiste en chimie et en métallurgie.\n\nÀ quoi ressemblera votre travail quotidien :\n\nComme le poste est relié aux opérations, ce stage se déroulera entièrement sur place. Vous serez responsable d’une ligne de produit dans la réparation des composantes en ce qui a trait du support aux opérations. Notre objectif est de participer dans la livraison des composantes et des moteurs pour le plan 5 et d’être engagé dans le solutionnement des problématiques qui bloquent l’avancement des travaux. De plus, des projets de développements technologiques et d’amélioration sont dans nos livrables. Le support technique doit assurer la liaison et la coordination avec plusieurs disciplines pour favoriser la livraison de ces projets de haute visibilité dû aux investissements qu’y sont attachés. Assurez la santé globale du nos processus, développer des initiatives d'optimisation et d'amélioration continue.\n• Supporter les opérations dans la réparation des composantes;\n• Préparer, créer et modifier les instructions de travail pour clarifier les procédés;\n• Supporter les investigations avec l’équipe de qualité dans le cas où une erreur survienne en cours de réparation (agir comme expert technique).\n\nGestions de projets de développements et d’intégration technologiques avec les suivis qui en découlent pour assurer l’avancement et d’adresser les points qui ralentissent l’évolution.\n• Préparation et analyse de coût pour des prochaines réparations disponibles sur le marché;\n• Analyse de faisabilité et capabilité avant l’introduction de nouveaux produits avec l’aide des différents spécialistes de l’équipe et de l’usine;\n• Maintien des communications efficaces avec les principales parties prenantes, les membres de l'équipe multidisciplinaire et les opérations.\n\nCe dont vous avez besoin pour réussir :\n\nLes incontournables :\n• Être éligible à travailler au Canada.\n• Être inscrit dans une université canadienne pendant toute la durée de votre stage.\n• Être en mesure de travailler sur place dans la province où vous êtes embauché, le cas échéant.\n• Poursuivre des études en aéronautique, génie aérospatial, génie mécanique, techniques d’usinage\n• Excellentes compétences en communication en français (parlé/écrit).\n• Bonnes habilités dans l’environnement CATIA V5;\n• Bonne connaissance de l'informatique (PowerPoint, Excel, Word, Access, etc.);\n\nAtouts :\n• Sens de l'organisation et capacité à travailler sous pression avec des priorités concurrentes et variables\n• Compétences en matière de gestion de projet\n• Bon sens des affaires;\n• Bonne connaissance technique et du produit (composantes / moteurs);\n• Fortes habiletés interpersonnelles et de communication;\n\nEnvironnement de travail\n\nQuel est mon type de rôle : Sur site uniquement - de 8h à 16h30 (heures de travail flexible)\n\nCe poste s’inscrit dans un milieu de travail francophone, néanmoins il nécessite une connaissance fonctionnelle de l’anglais pour lire et comprendre des instructions spécialisées, des plans, des dessins et des termes techniques qui peuvent émaner d’organisations internationales, ainsi que pour écrire et parfois communiquer en anglais avec des clients, des fournisseurs ou des collègues internationaux.\n\nDiversité, équité et inclusion\n\nLe pronom masculin est utilisé sans discrimination et uniquement dans le but de faciliter la lecture du texte. P&WC est un employeur qui souscrit au principe de l'égalité des chances et qui cherche à promouvoir la diversité et l'inclusion. Nous examinerons les candidatures de tous les candidats qualifiés, indépendamment de leur race, de leur couleur, de leur religion, de leur orientation sexuelle, de leur sexe, de leur nationalité, de leur âge, de leur handicap, de leur statut d'ancien combattant ou de tout autre statut protégé par la loi.\n\nVeuillez noter que des licences, des permis, des certifications ou d'autres types d'autorisations pourraient être nécessaires si le poste requiert l'accès à des données contrôlées ou à des données soumises à une règle ou à un règlement applicable.\n\nEnglish--------------------------------------------------------------------------------------------------------------------\n\nWho we are:\n\nAt Pratt & Whitney, we believe that powered flight has transformed and will continue to transform the world. That's why we work with an explorer's heart and a perfectionist’s grit to design, build, and service world's most advanced aircraft engines. We do this across a diverse portfolio including Commercial Engines, Military Engines, Business Aviation, General Aviation, Regional Aviation, and Helicopter Aviation and as a way of turning possibilities into realities for our customers. This is how we at Pratt & Whitney approach our work, and this is why we are inspired to go beyond.\n\nWhether you are currently pursuing a bachelor's or master's degree, we can help you harness your potential, advance your skills and make the impossible a reality. If you are currently enrolled in a Canadian university, now is the moment to start a career path that can drive impact and innovation for generations to come.\n\nAt Pratt & Whitney, the difference you make is on display every day. Just look up. Are you ready to go beyond?\n\nInternship dates: January 6th to April 25th, 2025\n\nCheck out our YouTube channel: https://www.youtube.com/@PrattWhitneyCa\n\nOur website: https://www.pwc.ca/en\n\nOur expectations:\n\nThe Technical Support team is responsible for creating and maintaining Plant 5 proprietary working documents for all P&WC engine families (turbofan, turboprop, regional and turboshaft). In addition, the group is committed to solving problems encountered in the repair of components at the tooling, programming, and laboratory levels. We are looking for someone with technical experience in the field of machining and sheet metal work. The specialist will have to collaborate with other aftermarket experts such as engineering, tooling, chemical and metallurgy specialist. As the position is related to operations, the expectation is that the person will be on site full time.\n\nWhat your day to day will look like:\n• Support operations in the repair of components\n• Prepare, create, and modify work instructions to clarify processes\n• Support investigations with the quality team if an error occurs during repair (act as a technical expert)\n• Management of technological development and integration projects with the resulting follow-ups to ensure progress and address the points that slow down the evolution.\n• Preparation and cost analysis for future repairs available on the market\n• Feasibility and capability analysis before the introduction of new products with the help of the various specialists of the team and the plant\n• Maintain effective communications with key stakeholders, multidisciplinary team members and operations.\n\nWhat you need to be successful:\n\nMust haves:\n• Be eligible to work in Canada\n• Be enrolled in a Canadian university throughout your internship\n• Be able to work on-site in the province where you are hired if applicable\n• Pursuing a degree in aeronautics, aerospace engineering, mechanical engineering, electrical engineering\n• Excellent communication skills in French (spoken/written).\n• Good skills in the CATIA V5 environment\n• Good knowledge of computers (PowerPoint, Excel, Word, Access, etc.)\n\nAssets:\n• Organizational skills and ability to work under pressure with competing and varying priorities.\n• Project management skills.\n• Good business sense\n• Good technical and product knowledge (components / motors)\n• Strong interpersonal and communication skills.\n\nWork Environment\n\nWhat my role type is: Onsite only- 8am to 4h30pm (flexible working hours)\n\nAlthough this position is part of a French-speaking work environment, it requires a working knowledge of English to read and understand specialized instructions, plans, drawings and technical terms that may emanate from international organizations, as well as to write and sometimes communicate in English with customers, suppliers or international colleagues.\n\nDiversity, Equity & Inclusion\n\nThe masculine pronoun is used without discrimination and solely for the purpose of making the text easier to read. P&WC is an equal opportunities employer, seeking to promote diversity and inclusion. We will consider applications from all qualified candidates, regardless of their race, colour, religion, sexual orientation, gender, nationality, age, disability, veteran status or any other status protected by law.\n\nPlease note that licenses, permits, certifications or other types or authorizations could be required if the position requires access to controlled data or data subject to any applicable rule or regulation.\n\nRTX is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class.\n\nPrivacy Policy and Terms:\n\nClick on this link to read the Policy and Terms",
            "job_is_remote": false,
            "job_posted_at": "6 hours ago",
            "job_posted_at_timestamp": 1733011200,
            "job_posted_at_datetime_utc": "2024-12-01T00:00:00.000Z",
            "job_location": "Québec City, Quebec",
            "job_city": "Québec City",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 46.8130816,
            "job_longitude": -71.20745959999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DtP-4a_vfCfFkbfzLAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "29201200",
            "job_onet_job_zone": "3"
        },
        {
            "job_id": "wF3nqyxEsxXhflsIAAAAAA==",
            "job_title": "STAGE - Ingénieur test de cartes électroniques - F/H",
            "employer_name": "Thales",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRJyVSXOQ47X09Un5zAPpX0kdjRwnYRC0Yo6-Wo&s=0",
            "employer_website": "https://www.thalesgroup.com",
            "job_publisher": "Recruit.net",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://www.recruit.net/job/stage-ingenieur-test-de-cartes-jobs/DCE06CA16DE01655?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Recruit.net",
                    "apply_link": "https://www.recruit.net/job/stage-ingenieur-test-de-cartes-jobs/DCE06CA16DE01655?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "QUI SOMMES-NOUS ?\n\nConstruisons ensemble un avenir de confiance\n\nThales est un leader mondial des hautes technologies spécialisé dans trois secteurs d’activité : Défense & Sécurité, Aéronautique & Spatial, et Cybersécurité & Identité numérique. Il développe des produits et solutions qui contribuent à un monde plus sûr, plus respectueux de l’environnement et plus inclusif. Le Groupe investit près de 4 milliards d’euros par an en Recherche & Développement, notamment dans des domaines clés de l’innovation tels que l’IA, la cybersécurité, le quantique, les technologies du cloud et la 6G. Thales compte près de 81 000 collaborateurs dans 68 pays.\n\nNos engagements, vos avantages\n• Une réussite commune portée par notre culture et excellence technologique, votre expérience et notre ambition partagée\n• Un package de rémunération attractif (épargne salariale, variable ou 13ième mois selon les postes, restaurant d’entreprise,…)\n• La possibilité de développer vos compétences en continu grâce à nos parcours de formation et nos académies internes #ENTREPRISEAPPRENANTE\n• Notre attention portée à votre équilibre personnel et professionnel (Accord télétravail, RTT, congés d’ancienneté, jours enfants malades, guide parentalité, crèches, CSE / ASC,… )\n• Des communautés internes permettant de vous engager sur les sujets qui vous tiennent à cœur : innovation, diversité, environnement\n• Un environnement inclusif et bienveillant où vous êtes accueilli et valorisé avec notre politique handi-accueillante, notre charte LGBT+, notre initiative #StOpe pour lutter contre le sexisme.\n\nThales propose des systèmes d’information et de communication sécurisés et interopérables pour les forces armées, les forces de sécurité et les opérateurs d’importance vitale. Ces activités, qui regroupent radiocommunications, réseaux, systèmes de protection, systèmes d’information critiques et cybersécurité, répondent aux besoins de marchés où l’utilisation des nouvelles technologies numériques est déterminante. Thales intervient tout au long de la chaîne de valeur, des équipements aux systèmes en passant par le soutien logistique et les services associés.\nLe site de Laval dispose d’une forte expertise dans le domaine de la veille d’obsolescence, de la R&D et des bancs de tests. Sur ce site, les équipes développent et produisent également les équipements de communication aéronautique (IFF, MIDS), et assurent les réparations des produits pour nos Clients. Le site réalise la recherche et développement ainsi que la production d’équipements d’identification Ami-Ennemi (IFF), et de communication et navigation Aéronautique et Naval.\n\nL’équipe Soutien Clients recherche un STAGE Ingénieur Tests de cartes électroniques – F/H\n\nBasé à Laval (53)\n\nQUI ÊTES VOUS ?\n• Vous êtes en formation BAC+5, en électronique analogique, numérique ?\n• Vous avez des connaissances dans les composants et systèmes électroniques ?\n• Vous avez étudié les tests in-situ et le développement cartes électroniques ?\n• *\n\nVous possédez un fort d’analyse?\n• Vous faites preuve de curiosité et êtes force de proposition ?\n• Vous aimez travailler en collectif ?\n\nCE QUE NOUS POUVONS ACCOMPLIR ENSEMBLE :\n\nAu sein du service Soutien des équipements d'Identification, de Navigation et équipements Navals, vous intégrez une équipe multi-métiers de 35 personnes. Cette équipe veille à la satisfaction des clients, en faisant preuve de réactivité dans le traitement des prestations de réparations/retrofits.\n\nEn tant que Stagiaire Ingénieur Tests de cartes électroniques :\n• Vous étudiez la couverture de test des moyens existants : Pilote V8, BTE 3000, Deltest, …\n• Pour chaque carte numérique, vous définissez la stratégie de test/diagnostic la plus couvrante,\n• Vous identifiez et développez les programmes de test nécessaires pour atteindre le taux de couverture souhaité et réduire le temps de diagnostic;\n\nTous nos stages sont conventionnés et soumis à une gratification dont le montant est déterminé selon votre niveau d’études.\nThales reconnait tous les talents, la diversité est notre meilleur atout. Postulez et rejoignez nous !",
            "job_is_remote": false,
            "job_posted_at": "6 hours ago",
            "job_posted_at_timestamp": 1733011200,
            "job_posted_at_datetime_utc": "2024-12-01T00:00:00.000Z",
            "job_location": "Ontario",
            "job_city": null,
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 51.253775,
            "job_longitude": -85.323214,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DwF3nqyxEsxXhflsIAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15119900",
            "job_onet_job_zone": "4"
        }
    ]
}