{
    "status": "OK",
    "request_id": "aa62b6cc-9a05-4c18-acf9-2a326277ae96",
    "parameters": {
        "query": "intern jobs canada",
        "page": 1,
        "num_pages": 3,
        "date_posted": "3days",
        "country": "ca",
        "language": "en"
    },
    "data": [
        {
            "job_id": "d_A-bu3NuDjJ9CDEAAAAAA==",
            "job_title": "PMO Intern",
            "employer_name": "CDW Canada",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ_4emeLJCvS06rausehkWRcjYL3EGt5OotV_ia&s=0",
            "employer_website": null,
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/pmo-intern-at-cdw-canada-4085668073?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/pmo-intern-at-cdw-canada-4085668073?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "BeBee Canada Meet Opportunities",
                    "apply_link": "https://ca.bebee.com/job/55454ff8ce0e10ec4568532c1b82f8ee?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Description\n\nBring your IT career and talents to CDW, where you can have a greater impact, be inspired by our mission and excited about your career and future. A Fortune 200 leader, we’re the driven professionals and technology experts companies turn to most to solve their IT challenges.\n\nIn this role, you will have the opportunity to collaborate with our delivery partners (vendors) and internal teams to deliver projects to meet our customers’ business needs.\n\nYou will ensure documentation and finances are accurately updated and maintained from the initiation of our projects to close out. Your analytical skills and interest in project finance will allow you to guide our delivery partners in following CDW’s standards in budget and labour management. With guidance from management, you will organize our vendor project portfolio and create well-crafted reports that provide key insights into projects performance.\n\nAt times, you may assist senior project managers on medium and large complexity projects or take on other administrative and coordination tasks as required.\n\nAs a Project Coordinator here in CDW, you will partner with some of the most dynamic, strategic, and talented professionals in IT. Your ability to build strong relationships with our customers, internal SMEs, sales, vendors, and other members of cross-functional teams is your key asset in today’s IT world.\n\nWhat you’ll do\n• Validate initial records in financial systems with project scope and estimations\n• Be responsible for project financials throughout the project lifecycle\n• Input changes to project financials in our PSA (Professional Services Automation) Software\n• Establish, monitor, adjust, and communicate tasks and associated schedule to project team\n• Ensure project is completed as per customer requirements\n• Assist project managers with managerial/administrative work as required\n\nWhat you need to succeed\n\nMust-have\n• Bachelor’s degree in business or computer related field or equivalent experience\n• Ability to manage multiple priorities/projects, meet deadlines, facilitate change, and delegate responsibilities\n• Solid understanding of arithmetic and some understanding of GAAP (Generally Accepted Accounting Principles)\n• Working knowledge of MSFT Project, MSFT Office, SharePoint, Salesforce, FinancialForce\n\nNice-to-have\n• Relevant experience working at VARs (Value Added Resellers)\n• Entry level Industry standard project management certification and/or IT certifications\n• Working knowledge of FinancialForce\n• Understanding of procurement and accounting process\n\nWho we are:\nCDW is a leading technology solutions provider to business, government, education and healthcare organizations across the globe. Our fingerprints can be found on technology in workplaces of more than 250,000 companies; from fresh-faced start-ups to international conglomerates. With the breadth of products and services we offer, there is no request too big or too small.\n\nWhat you can expect from us: Culture, coworkers, careers.\nCDW is not only the People Who Get IT but the People who get People. Our relationships are fueled by our deep expertise and grounded in the CDW Way. Our empowering leadership makes things happen and inspires their teams to do the same. From the teammates beside us to the leaders who guide us, we move forward together. At CDW, you’ll work with people who inspire you. People with positive, success-driven attitudes who you will learn from and forge strong relationships with. Bring your best true self—and your best ideas—to CDW. Because diverse perspectives bring forth better problem solving—and better solutions for our customers on a rapidly evolving technology landscape.",
            "job_is_remote": false,
            "job_posted_at": "23 hours ago",
            "job_posted_at_timestamp": 1732636800,
            "job_posted_at_datetime_utc": "2024-11-26T16:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dd_A-bu3NuDjJ9CDEAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13108200",
            "job_onet_job_zone": null
        },
        {
            "job_id": "LWnXSdzFrERRRvgUAAAAAA==",
            "job_title": "SIMON & SCHUSTER CANADA INTERNSHIPS",
            "employer_name": "Simon & Schuster",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRGJHaUHfZtmMuyqzL7EjpWGRG74CpmYOZVa4bi&s=0",
            "employer_website": "http://www.simonandschuster.com/",
            "job_publisher": "Indeed",
            "job_employment_type": "Part-time",
            "job_employment_types": [
                "PARTTIME"
            ],
            "job_apply_link": "https://ca.indeed.com/viewjob?jk=e76495c24a32a241&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": true,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=e76495c24a32a241&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/simon-and-schuster-canada-internships-simon-and-schuster-JV_IC2281069_KO0,37_KE38,56.htm?jl=1009542458241&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.com/job-listing/simon-and-schuster-canada-internships-simon-and-schuster-JV_IC2281069_KO0,37_KE38,56.htm?jl=1009542458241&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://fr.simplyhired.ca/job/9wybbhWyig-bj8EPY6OzrfpX80rxZl48LdfRzbZgs55g4icVIZVebg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Simon & Schuster has been named to Forbes magazine list of America's Best Mid-Size Employers 2022. Simon & Schuster is a global leader in general interest publishing, dedicated to providing the best in fiction and nonfiction for readers of all ages, and in all printed, digital and audio formats. Its distinguished roster of authors includes many of the world's most popular and widely recognized writers, and winners of the most prestigious literary honors and awards. It is home to numerous well-known imprints and divisions such as Simon & Schuster, Scribner, Atria Books, Gallery Books, Pocket Books, Adams Media, Simon & Schuster Children's Publishing and Simon & Schuster Audio and international companies in Australia, Canada, India and the United Kingdom, and proudly brings the works of its authors to readers in more than 200 countries and territories. For more information visit our website at www.simonandschuster.com.\n\nSIMON & SCHUSTER CANADA INTERNSHIPS\nSimon & Schuster Canada offers four full-time, paid ($17.20/hour) internships running from January to June and July to December. The internship program offers behind-the-scenes and hands-on experience within the world of book publishing. Interns will be placed within a variety of areas including editorial, marketing, and sales and in those departments, they will be able to explore all aspects of the industry. While guided by a mentor they will experience \"a day in the life\" of an entry level assistant and will engage in work that contributes to their professional growth.\nInterns will be included in key department and company meetings and will be able to contribute to ongoing projects. They will gain valuable industry experience, develop important connections, and make an important contribution to the publishing process.\nNo prior experience in publishing is required but a love of books and storytelling is a must.\n\nEDITORIAL –\nThis Simon & Schuster Canada internship is an excellent opportunity for someone specifically interested in the editorial process. We are looking for an energetic individual with an eye for detail, a knowledge of proofreading and copyediting, and a keen interest in publishing. The appropriate candidate will be an independent, confident, and adaptable worker and an enthusiastic reader of both Canadian and international fiction and non-fiction.\n\nResponsibilities include: assisting the editorial team, reading and responding to submissions, proofreading and copyediting book material (cover copy, tip sheets, etc.), checking page proofs, researching book ideas, and writing copy. The editorial intern will participate in editorial meetings and launch meetings, and perform a variety of administrative tasks (photocopying, mailing, etc.) as needed.\n\nMARKETING -\nSimon & Schuster Canada is looking for creative, social media savvy, highly motivated intern for a marketing internship. As a marketing intern you will gain hands-on experience in various areas of brand marketing, book marketing, social media, content marketing, and digital advertising. The ideal applicant will have solid written and verbal communication skills, be highly organized and able to multitask, possess a strong knowledge of the digital media landscape including various social media platforms, and have a keen eye for content creation and design.\n\nResponsibilities include: Supporting the marketing team with research, mailings, admin and other tasks, creating engaging social media content including visually compelling Instagram photos and TikTok videos, working with the marketing team to implement seasonal campaigns, assisting the digital marketing team on various projects, and collaborating with colleagues in publicity, editorial, and sales as needed.\n\nSALES –\nSimon & Schuster Canada is looking for data-loving, motivated intern for a sales internship. Our sales internship offers the successful candidate an opportunity to learn about the publishing industry in a dynamic and interactive way, supporting and collaborating with sales and operations departments, while getting acquainted with other departments including marketing, editorial, and publicity.\n\nAs a sales intern you will gain hands-on professional experience with day-to-day reporting, sales pitches, forecasting, creating catalogues, and administrative tasks, as well as preparing for sales conferences, special projects, and more. The ideal candidate is someone who has strong organizational skills, leans into problem-solving, leads with creativity and curiosity, loves data and finding stories in the numbers, and has a basic knowledge of Excel and wants to learn more.\n\nPUBLICITY –\nSimon & Schuster Canada is looking for a creative, motivated intern for a publicity internship. Our publicity internship offers the successful candidate an opportunity to learn about the publishing industry in a dynamic and interactive way, supporting and collaborating with publicists, while getting acquainted with other departments including marketing, editorial, and sales.\n\nAs a publicity intern you will gain hands-on professional experience with day-to-day research, outreach, development of press materials, and administrative tasks, as well as author events, special projects, and more.\n\nInternships are full-time, five days per week (37.5 hours). Simon & Schuster Canada operates on a hybrid work model which includes spending part of the week in person at our King Street office in Toronto.\n\nIf you’re interested in an internship at Simon & Schuster Canada, please apply via the link below with a cover letter and c.v. by December 4th, indicating which department you are applying to.\n\nSimon & Schuster Canada is an equal opportunity employer (EOE) including disability/vet. At Simon & Schuster Canada, the spirit of inclusion feeds into everything that we do. From employee benefits/programs and social impact outreach initiatives, we believe that opportunity, access, resources and rewards should be available to and for the benefit of all. Simon & Schuster Canada is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ethnicity, ancestry, religion, creed, sex, national origin, sexual orientation, age, citizenship status, marital status, disability, gender identity, gender expression, and Veteran status.\n\nCandidates hired for this or any other posted Simon & Schuster Canada role will be employees of Simon & Schuster, LLC Canada ULC, subject to all policies, including the Workplace Privacy Notice, and eligible solely for the benefits plans thereof.",
            "job_is_remote": false,
            "job_posted_at": "13 hours ago",
            "job_posted_at_timestamp": 1732672800,
            "job_posted_at_datetime_utc": "2024-11-27T02:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DLWnXSdzFrERRRvgUAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": "HOUR",
            "job_highlights": {},
            "job_onet_soc": "55301800",
            "job_onet_job_zone": null
        },
        {
            "job_id": "0wR72zkCHE3LmT3IAAAAAA==",
            "job_title": "HR Recruitment Intern",
            "employer_name": "Archmill House",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRklnyDx2VO6BxKI0fAeeFUYj2I4GFxNYojvt1n&s=0",
            "employer_website": "http://www.archmillhouse.com/",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Contractor",
            "job_employment_types": [
                "CONTRACTOR",
                "CONTRACTOR"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/hr-recruitment-intern-at-archmill-house-4083785687?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/hr-recruitment-intern-at-archmill-house-4083785687?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "For over 30 years, Archmill House Inc. has been a trusted leader in the creation of high-end millwork and premium store fixtures across North America. Our legacy is built on delivering exceptional craftsmanship, innovative solutions, and unwavering commitment to quality. This dedication has allowed us to become a preferred partner for a wide range of commercial and retail sectors.\n\nAt Archmill House, we take pride in our ability to evolve with the industry while maintaining our commitment to precision, efficiency, and client satisfaction. Our latest innovation, the Rapid Re-Image™ program, exemplifies this commitment. This cutting-edge restaurant remodeling solution is designed to meet the unique demands of Quick Service Restaurants, offering swift, flawless transformations that minimize disruption and maximize return on investment.\n\nBy integrating our expertise in millwork with the Rapid Re-Image™ program, Archmill House not only delivers superior renovations but also reinforces our reputation for excellence. We understand the importance of minimizing downtime, enhancing operational efficiency, and ensuring that every project we undertake reflects the high standards that have defined our brand for decades. With a robust presence across Canada and the United States, we continue to set the benchmark for quality and innovation in the industry.\n\nPosition Summary\n\nThe HR Recruitment Intern will support with recruitment initiatives including sourcing, screening and interviewing top talent for the organization. This position is responsible will partner closely with HR and hiring managers to ensure a smooth and efficient recruitment process. This is an exciting opportunity for a passionate HR graduate with a keen eye for talent and a knack for creating exceptional candidate experiences. The ideal candidate thrives in a fast-paced environment and is comfortable managing multiple positions across different departments.\n\nKey Responsibilities\n• Support end-to-end recruitment processes, from job posting and sourcing to interviewing.\n• Use various channels such as job boards, social media, LinkedIn, and employee referrals to identify and engage high-quality candidates.\n• Review resumes, conduct phone screens, and schedule interviews with hiring managers.\n• Ensure a positive and engaging candidate experience throughout the entire hiring process.\n• Support with tracking and reporting on key recruitment metrics (time to hire, cost per hire, source of hire, etc.).\n• Collaborate with HR Director to proactively address staffing needs.\n• Stay ahead of industry changes and emerging trends to build talent pipeline/network.\n• Conduct interviews and assess candidates and partners using standardized methodology.\n• Support with other HR projects and initiatives as needed.\n• Assist with other duties as assigned.\n\nQualifications\n• Education in human resources, organizational development, training and development, recruitment or related field considered an asset.\n• Exposure to recruitment would be considered an asset.\n• Basic working knowledge of relevant employment legislation including Employment Standards Act.\n• Ability to handle sensitive and confidential information with discretion.\n• Ability to work in a fast-paced, high-volume recruitment environment.\n• Detail-oriented with strong organizational skills.\n• Strong interpersonal and communication skills.\n• Proficiency in HRIS and MS Office Suite.\n• Ability to multitask and prioritize tasks effectively.\n• Team player with the ability to take ownership of all projects involved.\n• High emotional intelligence and commitment to professionalism.\n\nWORK CONDITIONS\n• In Person First Workplace.\n• Requires sitting/being stationary at a desk for extended periods of time.\n\nCHARACTERISTICS TO SUCCEED\n\nAt Archmill House Inc., we are seeking Ideal Team Players who are Humble, Hungry and Smart (as referenced by Patrick Lencioni in his book, The Ideal Team Player).\n• Humble – Who shares the credit and success with team members\n• Hungry – Who is always looking for more responsibilities and learnings\n• Smart – Who is emotionally intelligent and has good judgement\n\nWe pursue individuals who have an “All In” attitude. \"All In\" means showing unwavering commitment, embracing teamwork, and going above and beyond to drive success for our company, our colleagues, and our clients.\n\nWHY YOU WILL LOVE WORKING WITH US\n• Competitive Pay\n• Perkopolis Account\n• In-Office Bistro with Snacks & Refreshments\n• Frequent Social Committee Events\n\nOUR COMMITMENT TO EQUITY & INCLUSION\n\nArchmill House Inc. is committed to fostering an inclusive and accessible work environment where all employees feel respected and have the opportunity to succeed. If you are contacted to arrange for an interview, please advise us If you require an accommodation and we will work with you to ensure your needs are met. We encourage applicants from all backgrounds to apply, and we are committed to providing a fair and accessible application process for everyone.\n\nThis posting is for an existing vacancy.",
            "job_is_remote": false,
            "job_posted_at": "17 hours ago",
            "job_posted_at_timestamp": 1732658400,
            "job_posted_at_datetime_utc": "2024-11-26T22:00:00.000Z",
            "job_location": "Ontario",
            "job_city": null,
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 51.253775,
            "job_longitude": -85.323214,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D0wR72zkCHE3LmT3IAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13107100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "Pkzx7PARj7ucjL0oAAAAAA==",
            "job_title": "Management Trainee Summer 2025 Intern",
            "employer_name": "Enterprise",
            "employer_logo": null,
            "employer_website": "https://www.enterprise.com",
            "job_publisher": "Enterprise Mobility",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://www.enterprisemobility.ca/en/careers/job.html/500700/saint-john/management-trainee-summer-2025-intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Enterprise Mobility",
                    "apply_link": "https://www.enterprisemobility.ca/en/careers/job.html/500700/saint-john/management-trainee-summer-2025-intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/Enterprise-Holdings/Job/Management-Trainee-Summer-2025-Intern/-in-Saint-John,NB?jid=3a28488f653082c5&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Enterprise - ICIMS",
                    "apply_link": "https://cae-erac.icims.com/jobs/500700/management-trainee-summer-2025-intern/job?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "Adzuna",
                    "apply_link": "https://www.adzuna.ca/details/4923653172?title=Management_Trainee_Summer_2025_Intern&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobillico",
                    "apply_link": "https://www.jobillico.com/en/job-offer/enterprise-holdingskAurEv/management-trainee-summer-2025-intern/14898748?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Monster.ca",
                    "apply_link": "https://www.monster.ca/job-openings/management-trainee-summer-2025-intern-saint-john-nb--8b598bda-4337-4bc3-ae89-c1c2325ca3bb?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://emplois.ca.indeed.com/viewjob?jk=14a34687929bbd28&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/management-trainee-summer-2025-intern-enterprise-mobility-JV_IC2294191_KO0,37_KE38,57.htm?jl=1009542290774&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "If you’re looking to hit the ground running, the Enterprise Management Internship will help you build valuable business and leadership skills. For a university/college student, the real-world professional experience you’ll receive during the internship will help you stand apart from the crowd, and will be more than just a line on your resume.\n\nFrom day one as a paid intern with Enterprise, you'll learn what it takes to run a successful business and acquire highly marketable skills in management. Our university/college interns take on the same challenges as our first and second year full-time professionals. It's a team-based environment; and throughout your internship, your peers will be right by your side helping you learn, grow and have fun.\n\nThis role is located in Saint John , New Brunswick and Surrounding Area.\n\nWhen you join our Management Internship Program, you'll soon discover that every day is different because it is filled with new, exciting, rewarding and often unexpected opportunities. For a season, we’ll put you in the middle of everything, just like our Management Trainees. We’ll give you the chance to develop the skills you need to manage a fleet of vehicles, take care of customers, develop marketing strategies and build relationships with customers and coworkers.\n\nDuring our internship, you’ll use the skills you learn to complete intern projects and engage in some friendly competition with your peers. You may also be eligible for performance incentives and employee referral rewards.\n• Must be at least 18 years of age.\n• Must be a current university student graduating with a Bachelor's Degree on or before June of 2026.\n• Students enrolled in business degree programs are preferred.\n• Must have a valid Class 5 Canadian driver's license with no more than 3 driving infractions on license in the past 3 years.\n• No drug or alcohol related convictions on driving record (DWI/DUI) in past 5 years.\n• Must be authorized to work in Canada and not require sponsorship by our company for this position now or in the future.\n• Must have a minimum of six months experience in sales, customer service, management or leadership.",
            "job_is_remote": false,
            "job_posted_at": "23 hours ago",
            "job_posted_at_timestamp": 1732636800,
            "job_posted_at_datetime_utc": "2024-11-26T16:00:00.000Z",
            "job_location": "Saint John, NB",
            "job_city": "Saint John",
            "job_state": "New Brunswick",
            "job_country": "CA",
            "job_latitude": 45.2733153,
            "job_longitude": -66.06330799999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DPkzx7PARj7ucjL0oAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": "HOUR",
            "job_highlights": {},
            "job_onet_soc": "55301800",
            "job_onet_job_zone": null
        },
        {
            "job_id": "HrLI8T2og8AWe3nVAAAAAA==",
            "job_title": "Digital Marketing Co-op/Intern - Product",
            "employer_name": "Nokia",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR3VQwotUpX75AsBoBjCoEt7J7haXNIj_Nf0x8O&s=0",
            "employer_website": "http://www.nokia.com/",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/digital-marketing-co-op-intern-product-at-nokia-4083774697?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/digital-marketing-co-op-intern-product-at-nokia-4083774697?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Description\n\nPosition: Digital Marketing Co-op/Intern - Product\n\nNumber of Position(s): 2\n\nDuration: 4 Months\n\nDate: 28 April - 29 August 2025\n\nLocation: Hybrid in Ottawa, Canada\n\nEducation Recommendations:\n• Enrolled in an Electrical/Computer Engineering or a related program at an accredited Canadian university.\n• Education in both technical and marketing/communications disciplines is advantageous\n• Preference is an enrolment in a Marketing, Communications, or Business-related program at an accredited Canadian college or university.\n\nHow You Will Contribute And What You Will Learn\n\nAs part of our team, you will:\n• Maintain online activity dashboard and present status at weekly marketing meetings to keep appropriate stakeholders appraised of the progress towards participation goals for each activity.\n• Work closely with our program, campaign, and product marketing teams to draft posts and monitor social media presence on LinkedIn and X.\n• Audit and update internal and external web pages to ensure that our marketing content is up-to-date and easy for our sales teams and customers to find.\n• Project manage product collateral, photo shoots, demo videos, and associated event activities.\n• Search for published articles on technical topics to aid in the development of white papers, application notes datasheets, and blogs.\n• Conduct competitive analysis of product offerings, marketing messages, and tactics.\n\nKey Skills And Experience\n\nWhat is Nokia looking for from me:\n\nThe Network Infrastructure Marketing Programs team at Nokia is seeking a co-op student for the position of Digital Marketing Specialist to support the product marketing activities of the Network Infrastructure marketing team. This individual will be responsible for supporting product-marketing activities as it pertains to go-to-market strategies structured for various IP, optical, or fixed network product lines. These can include but are not limited to supporting technical sales enablement collateral, technical video generation, primary technical content feature awareness, and video generation for various product lines within the Network Infrastructure program portfolio. Together with the Manager, this position will partner with cross-functional teams to shape and deliver the technical marketing content, go-to-market collateral to support regional sales, and to execute the multi-channel campaigns across various tools and platforms, social media campaigns, and integration with our event presence with the objective of driving demand generation, engagement, and increased brand awareness.\n• Well organized, able to multitask and work with cross-functional teams and subjects simultaneously\n• Be creative and possess strong written, communication, and presentation skills\n• Strong attention to detail\n• Understanding of telecommunication network infrastructure, network automation, and network security (Layer 3 to Layer 0 is considered an asset)\n• Understanding of Optical Networking (WDM, ROADMs, OTN, etc) is an asset\n• Understanding of Security protocols (such as IPSec, MACSec, or OTNSec) is an asset\n• Understanding of network management protocols and interfaces (ie: NETCONF/YANG, and gRPC) is an asset\n• Effective interpersonal skills, adaptability, initiative, reliability, and judgment\n• Proficiency in Microsoft Office 365 – Word, PowerPoint, Excel, Teams, SharePoint, Outlook.\n\nAbout Us\n\nCome create the technology that helps the world act together\n\nNokia is committed to innovation and technology leadership across mobile, fixed and cloud networks. Your career here will have a positive impact on people’s lives and will help us build the capabilities needed for a more productive, sustainable, and inclusive world.\n\nWe challenge ourselves to create an inclusive way of working where we are open to new ideas, empowered to take risks and fearless to bring our authentic selves to work\n\nWhat we offer\n\nNokia offers continuous learning opportunities, well-being programs to support you mentally and physically, opportunities to join and get supported by employee resource groups, mentoring programs and highly diverse teams with an inclusive culture where people thrive and are empowered.\n\nNokia is committed to inclusion and is an equal opportunity employer\n\nNokia has received the following recognitions for its commitment to inclusion & equality:\n• One of the World’s Most Ethical Companies by Ethisphere\n• Gender-Equality Index by Bloomberg\n• Workplace Pride Global Benchmark\n\nAt Nokia, we act inclusively and respect the uniqueness of people. Nokia’s employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law. We are committed to a culture of inclusion built upon our core value of respect.\n\nJoin us and be part of a company where you will feel included and empowered to succeed.\n\nAdditional Information\n\nUS/Canada Nokia Offers a comprehensive benefits package that includes but is not limited to:\n• Corporate Retirement Savings Plan\n• Health and dental benefits\n• Short-term disability, and long-term disability\n• Life insurance, and AD&D – Company paid 2x base pay\n• Optional or Supplemental life and AD&D insurance (Employee/Spouse/Child)\n• Paid time off for holidays and Vacation\n• Employee Stock Purchase Plan\n• Tuition Assistance Plan\n• Adoption assistance\n• Employee Assistance Program/Work Life Resource Program\n\nThe above benefits exclude students. Disclaimer for US/Canada\n\nNokia Maintains broad annual base salary ranges for its roles in order to account for variations in knowledge, skills, experience and market conditions, and with consideration to internal peer equity.(Check the salary ranges in the job info section for this role)\n\nAll North America job posts will post for a minimum of 7 calendar days and up to 180 days or until candidate/s identified.\n\nAbout The Team\n\nThe pandemic has highlighted how important telecoms networks are to society. Nokia’s Network Infrastructure group is at the heart of a revolution to bring more and faster network capacity to people worldwide through our ambition, innovation, and technical expertise.",
            "job_is_remote": false,
            "job_posted_at": "18 hours ago",
            "job_posted_at_timestamp": 1732654800,
            "job_posted_at_datetime_utc": "2024-11-26T21:00:00.000Z",
            "job_location": "Ontario",
            "job_city": null,
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 51.253775,
            "job_longitude": -85.323214,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DHrLI8T2og8AWe3nVAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15119900",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "Bof5BZSg396qjME2AAAAAA==",
            "job_title": "2025 Summer Sales Intern",
            "employer_name": "Vantage Marketing Canada",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRUy2nrMvcw5mOb368JlBJrr4oABTNYpHk-oJGB&s=0",
            "employer_website": "https://www.vantagemarketingcanada.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/2025-summer-sales-intern-at-vantage-marketing-canada-4085452309?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/2025-summer-sales-intern-at-vantage-marketing-canada-4085452309?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Stage en ventes été 2025 - Vantage Marketing Canada\n\nTransformez votre été : Apprenez, gagnez et évoluez avec Vantage\n\nÊtes-vous prêt à lancer votre carrière avec une expérience estivale qui combine apprentissage intensif et potentiel de gains exceptionnels ? Vantage Marketing Canada vous offre l'opportunité de développer des compétences professionnelles cruciales, de gagner un revenu impressionnant et de profiter d'un été inoubliable dans certaines des villes les plus dynamiques du Canada.\n\nÀ propos de nous\n\nVantage Marketing Canada, établie en 2009, a révolutionné l'industrie de la lutte antiparasitaire en créant une stratégie marketing innovante pour les propriétaires résidentiels. Aujourd'hui, nous sommes fiers d'être l'expérience de vente estivale n°1 au Canada, ayant employé plus de 1 500 étudiants dans sept provinces d'un océan à l'autre.\n\nLe rôle : Stagiaire en ventes d'été\n\nEn tant que stagiaire en ventes d'été, vous serez immergé dans un environnement d'apprentissage dynamique, représentant Insight Pest Solutions - la plus grande entreprise de lutte antiparasitaire résidentielle au Canada. Ce rôle est conçu pour vous mettre au défi et accélérer votre croissance professionnelle :\n• Maîtrisez l'art de la vente grâce à une expérience pratique\n• Développez des compétences de haut niveau en communication et en négociation\n• Améliorez vos capacités de réflexion critique et de résolution de problèmes\n• Participez à un camp d'entraînement complet sur la vente couvrant des sujets comme la persuasion, le langage corporel et la communication non verbale\n\nCe que nous offrons\n• Environnement d'apprentissage exceptionnel : Notre programme est structuré comme un camp d'entraînement intensif aux ventes avec une formation continue en cours d'emploi\n• Potentiel de gains impressionnant : 80% de nos représentants gagnent entre 15 000 $ et 25 000 $ pendant l'été, avec les meilleurs représentants de première année gagnant plus de 100 000 $ (vous avez bien lu !)\n• Structure de commission : Les représentants de première année commencent à 20% et peuvent atteindre jusqu'à 40%\n• Hébergement gratuit : Profitez d'un logement sans loyer de mai à août dans la ville de votre choix, ou restez chez vous\n• Formation complète : Bénéficiez de notre programme de vente, des réunions matinales de vente et du coaching individuel\n• Mentorat : Recevez les conseils de gestionnaires de vente expérimentés\n• Culture stimulante : Travaillez dur et amusez-vous encore plus avec des activités d'équipe, des primes et des compétitions\n• Voyage des meilleurs performants : Une opportunité exclusive pour nos meilleurs vendeurs en août\n\nQui nous recherchons\n\nLe candidat idéal :\n• A un parcours compétitif (sports, débats, etc.)\n• Est intrinsèquement motivé et désireux d'apprendre\n• Possède d'excellentes compétences interpersonnelles et est sociable\n• Est motivé par la croissance personnelle et professionnelle\n• Aime les défis et les nouvelles expériences\n\nUne journée type\n• Matinées : Gym, méditation ou toute autre routine personnelle !\n• Midi : Réunion d'équipe de vente et session de formation, déplacement vers la zone assignée pour la journée\n• 14h jusqu'à la tombée de la nuit : Début des ventes porte-à-porte, application des compétences acquises\n• Semaine de six jours avec samedis mi-journée et dimanches libres\n\nPourquoi choisir Vantage pour votre été de croissance ?\n• Développement accéléré des compétences : Acquérez des compétences inestimables en vente et marketing applicables à tout parcours professionnel\n• Littératie financière : Apprenez à gagner et à gérer des revenus substantiels\n• Croissance personnelle : Relevez des défis, développez votre confiance et une solide éthique de travail\n• Réseautage : Connectez-vous avec des pairs partageant les mêmes idées et des professionnels de l'industrie\n• Formation pratique en affaires : Expérimentez l'application concrète des principes commerciaux\n\nPrêt à transformer votre été en une expérience d'apprentissage intensive avec un potentiel de gains exceptionnel ? Postulez maintenant pour rejoindre l'équipe Vantage Marketing et libérez votre potentiel en vente, leadership et croissance personnelle !\n\nNote : Ce poste est basé sur la commission. Nos services incluent la lutte antiparasitaire générale (fourmis, guêpes, souris, rats, araignées) et les traitements contre les moustiques pour les propriétés résidentielles.",
            "job_is_remote": false,
            "job_posted_at": "2 days ago",
            "job_posted_at_timestamp": 1732492800,
            "job_posted_at_datetime_utc": "2024-11-25T00:00:00.000Z",
            "job_location": "Laval, Quebec",
            "job_city": "Laval",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 45.6066487,
            "job_longitude": -73.712409,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DBof5BZSg396qjME2AAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "55301800",
            "job_onet_job_zone": null
        },
        {
            "job_id": "EVc-zhGYU-Rq5k02AAAAAA==",
            "job_title": "Application and Web Development Internship",
            "employer_name": "Canadian Jewellers Technology",
            "employer_logo": null,
            "employer_website": "https://canadianjewellerstech.ca",
            "job_publisher": "SimplyHired",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://www.simplyhired.ca/job/9UkvnF_VMgbcz1h9J8NX5ZJomMK28TeoWNYqgKVSF7bdADm1Ath25A?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/9UkvnF_VMgbcz1h9J8NX5ZJomMK28TeoWNYqgKVSF7bdADm1Ath25A?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Overview\nWe are seeking a talented and motivated Application and Web Developer to join our dynamic team. In this role, you will be responsible for designing, developing, and maintaining web applications that enhance user experience and drive business success. The ideal candidate will have a strong understanding of both front-end and back-end technologies, with a passion for creating efficient and scalable web solutions.\n\nResponsibilities\n• Develop and maintain high-quality web applications using modern programming languages and frameworks.\n• Collaborate with cross-functional teams to define, design, and ship new features.\n• Write clean, maintainable code while adhering to best practices in software development.\n• Optimize applications for maximum speed and scalability.\n• Troubleshoot, debug, and resolve technical issues as they arise.\n• Implement responsive design principles to ensure a seamless user experience across devices.\n• Participate in code reviews to maintain code quality and share knowledge with the team.\n• Stay updated with emerging technologies and industry trends to continuously improve skills.\n\nExperience\n• Proficiency in programming languages such as Python, Ruby on Rails, HTML, TypeScript, and familiarity with PostgreSQL.\n• Experience with DevOps practices and tools to streamline development workflows.\n• Strong understanding of UI/UX principles to create intuitive interfaces.\n• Knowledge of E-commerce platforms and their integration into web applications.\n• Familiarity with cloud services such as AWS for application deployment and management.\n• A proven track record of developing responsive web applications that meet user needs.\n• Experience with Wordpress, Shopify, Wix.\n\nJoin us in shaping the future of our digital landscape by applying your skills as a Application and Web Developer. We look forward to welcoming you to our innovative team!\n\nJob Type: Internship / Co-op\nContract length: 4 months\n\nPay: $500.00 per month\n\nAdditional pay:\n• Commission pay\n\nSchedule:\n• Monday to Friday\n\nEducation:\n• Bachelor's Degree (preferred)\n\nWork Location: In person",
            "job_is_remote": false,
            "job_posted_at": "22 hours ago",
            "job_posted_at_timestamp": 1732640400,
            "job_posted_at_datetime_utc": "2024-11-26T17:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DEVc-zhGYU-Rq5k02AAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15113400",
            "job_onet_job_zone": "3"
        },
        {
            "job_id": "hrCNGGxIRpCn7JZHAAAAAA==",
            "job_title": "Banking Advisor Intern",
            "employer_name": "Royal Bank of Canada",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQjxu_0uE0HlKgMtr9bhuPLYC9EkSgb9sAlslz-&s=0",
            "employer_website": "http://www.rbc.com/",
            "job_publisher": "RBC Careers",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://jobs.rbc.com/ca/en/job/R-0000107030/Banking-Advisor-Intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "RBC Careers",
                    "apply_link": "https://jobs.rbc.com/ca/en/job/R-0000107030/Banking-Advisor-Intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://emplois.ca.indeed.com/viewjob?jk=495e4dca37ceb23b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/banking-advisor-intern-royal-bank-of-canada-JV_IC2302475_KO0,22_KE23,43.htm?jl=1009542536468&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobillico",
                    "apply_link": "https://www.jobillico.com/en/job-offer/rbc-uiymvf/banking-advisor-intern/14899936?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.com/job-listing/banking-advisor-intern-rbc-JV_IC2302475_KO0,22_KE23,26.htm?jl=1009542536468&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://fr.simplyhired.ca/job/M6xah3R_6g54m4vpA2pXwMNksPiM0nGZDfMZEJ2vBS6E9MVcdoGeyA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "BeBee Canada Meet Opportunities",
                    "apply_link": "https://ca.bebee.com/job/2bcf9fd04c40032665ac192365d76a83?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Summary\n\nJob Description\n\nWhat is the opportunity?\n\nThis unique position calls on your client-focused sales expertise and natural problem-solving skills to maximize each client interaction. Specifically, you help clients with their everyday banking, credit, and investment needs. As an RBC ambassador, you add value in the moments that matter most to clients and collaborate with RBC partners to help clients achieve their goals. Whether you’re demonstrating to a client how to use digital banking, on-boarding a new client, or referring a complex opportunity to a specialist, your expertise will contribute to creating meaningful and memorable client experiences to drive client satisfaction and loyalty.\n\nWhat will you do?\n• Proactively engage with clients in all areas of the branch and in the community, uncovering banking needs, providing help and advice, as well as identifying sales and referral opportunities\n• Focus on client education and demonstration, leveraging technology to deliver a memorable client experience, drive sales, and retain business\n• Respond to client-initiated contact, assisting them with a full range of financial transactions\n• Actively listen and engage clients in conversation to further understand their individual needs\n• Proactively take ownership of resolving and preventing client banking problems\n• Cultivate and maintain relationships with partners to make the most of business opportunities and referrals\n\nWhat do you need to succeed?\n\nMust-have\n• Mutual Funds accreditation (i.e., Investment Funds in Canada or the Canadian Securities Course)\n• Demonstrated passion for putting clients first, as well as success in a hands-on, target-driven sales environment\n• Problem-solving and people skills, with the ability to build strong relationships and proactively connect with clients\n• Flexibility, eagerness to learn, strong personal ethics, and a hunger for success\n• Digital literacy across a broad range of devices (i.e., smartphones, tablets, laptops, etc.)\n• Availability to work all open business hours\n\nNice-to-have\n• Track record in building rapport and maintaining client relationships within the financial or service industry\n\nWhat’s in it for you?\n\nWe thrive on the challenge to be our best, progressive thinking to keep growing, and working together to deliver trusted advice to help our clients thrive and communities prosper. We care about each other, reaching our potential, making a difference to our communities, and achieving success that is mutual.\n• A comprehensive Total Rewards Program including competitive compensation, bonuses, and flexible benefits\n• Continued opportunities for career advancement\n• World-class sales training, coaching, and development opportunities\n• Support from a dynamic, collaborative, progressive, and high performing team, as well as world-class tools and training\n• Opportunity to achieve great success and grow your career with RBC\n\nRBC is committed to supporting flexible work arrangements when and where available. Details to be discussed with Hiring Manager.\n\nJob Skills\nAdvice Based Solutions, Client Centricity, Client Discovery, Communication, Critical Thinking, Curiosity, Data Analysis, Digital Literacy\n\nAdditional Job Details\n\nAddress:\n\n2000 ISLAND HWY N:NANAIMO\n\nCity:\n\nNANAIMO\n\nCountry:\n\nCanada\n\nWork hours/week:\n\n37.5\n\nEmployment Type:\n\nFull time\n\nPlatform:\n\nPERSONAL & COMMERCIAL BANKING\n\nJob Type:\n\nRegular\n\nPay Type:\n\nSalaried\n\nPosted Date:\n\n2024-11-26\n\nApplication Deadline:\n\n2024-12-10\n\nNote: Applications will be accepted until 11:59 PM on the day prior to the application deadline date above\n\nInclusion and Equal Opportunity Employment\n\nAt RBC, we embrace diversity and inclusion for innovation and growth. We are committed to building inclusive teams and an equitable workplace for our employees to bring their true selves to work. We are taking actions to tackle issues of inequity and systemic bias to support our diverse talent, clients and communities.\n​​​​​​​\nWe also strive to provide an accessible candidate experience for our prospective employees with different abilities. Please let us know if you need any accommodations during the recruitment process.\n\nJoin our Talent Community\n\nStay in-the-know about great career opportunities at RBC. Sign up and get customized info on our latest jobs, career tips and Recruitment events that matter to you.\n\nExpand your limits and create a new future together at RBC. Find out how we use our passion and drive to enhance the well-being of our clients and communities at jobs.rbc.com.",
            "job_is_remote": false,
            "job_posted_at": "2 days ago",
            "job_posted_at_timestamp": 1732492800,
            "job_posted_at_datetime_utc": "2024-11-25T00:00:00.000Z",
            "job_location": "Nanaimo, BC",
            "job_city": "Nanaimo",
            "job_state": "British Columbia",
            "job_country": "CA",
            "job_latitude": 49.1658836,
            "job_longitude": -123.94006479999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DhrCNGGxIRpCn7JZHAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13205200",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "Q2DA4ox9TkculVKwAAAAAA==",
            "job_title": "Video graphic designing intern",
            "employer_name": "Cogenters",
            "employer_logo": null,
            "employer_website": null,
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/video-graphic-designing-intern-at-cogenters-4083703543?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/video-graphic-designing-intern-at-cogenters-4083703543?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Description for VIDEO GRAPHIC DESIGNERS’ Internship-\n\nVideo Graphic Designers Internship-\n\n2024 could be the year for exponential growth for you! You can achieve a lot more remotely and make a mark globally with this Podcast internship for Cogent IBS. Please note that there is no stipend in this internship.\n\nDuration: 4 Months (120 days) & Unpaid Internship\n\nEmployment Type: Internship (100% Work from home)\n\nPosition Overview:\n\nAs a Video Graphic Designer Intern, you will work closely with our creative team to produce visually stunning and engaging video content. This internship offers an opportunity to hone your skills, collaborate on exciting projects, and learn about the latest technologies and techniques in video editing and graphic design.\n\nKey Responsibilities:\n• Create compelling video content using Adobe Creative Cloud, including Adobe Premiere Pro, After Effects, and Lightroom.\n• Develop and design Doodle Videos, Augmented Reality experiences, and Cartoon Animations for various projects.\n• Collaborate with the creative team to brainstorm and execute visually appealing video concepts.\n• Ensure the highest quality standards for video and graphics, including colour correction and sound design.\n• Assist in pre-production activities, such as script development and storyboarding.\n• Keep up-to-date with industry trends and emerging technologies in video and graphic design.\n• Contribute to the development of creative and engaging video concepts.\n\nQualifications:\n• Currently pursuing or recently completed a degree in a related field (e.g., graphic design, film production, multimedia design).\n• Proficiency in Adobe Creative Cloud applications, with a strong focus on Adobe Premiere Pro, After Effects, and Lightroom.\n• Knowledge of Doodle Video creation, Augmented Reality, and Cartoon Animation techniques.\n• Strong creativity, attention to detail, and a keen eye for design aesthetics.\n• Good communication and teamwork skills.\n• Enthusiastic, self-motivated, and willing to take initiative.\n• Ability to work effectively in a team and meet deadlines.\n• A strong portfolio showcasing your graphic design and video editing skills (if available).\n\nBenefits:\n\nInternship Completion Certificate.\n\nLetter of Recommendation for best performers.\n\nLinkedIn recommendation.\n\nFlexible timing (US EST time zone)\n\nNote: This is an Unpaid Internship",
            "job_is_remote": false,
            "job_posted_at": "20 hours ago",
            "job_posted_at_timestamp": 1732647600,
            "job_posted_at_datetime_utc": "2024-11-26T19:00:00.000Z",
            "job_location": "Canada",
            "job_city": null,
            "job_state": null,
            "job_country": "CA",
            "job_latitude": 56.130365999999995,
            "job_longitude": -106.34677099999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DQ2DA4ox9TkculVKwAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "27102400",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "mZ43aAaRJDTNUwT6AAAAAA==",
            "job_title": "Sales and Marketing Internship",
            "employer_name": "Canadian Jewellers Technology",
            "employer_logo": null,
            "employer_website": "https://canadianjewellerstech.ca",
            "job_publisher": "Glassdoor",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://www.glassdoor.ca/job-listing/sales-and-marketing-internship-canadian-jewellers-technology-JV_IC2281069_KO0,30_KE31,60.htm?jl=1009541963183&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": true,
            "apply_options": [
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/sales-and-marketing-internship-canadian-jewellers-technology-JV_IC2281069_KO0,30_KE31,60.htm?jl=1009541963183&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://fr.simplyhired.ca/job/VxeUuo8_tRWYKaI_2PMednJXBmRl62BzM6EKklD465lPDaxQ2hHLFg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobs Trabajo.org",
                    "apply_link": "https://ca.trabajo.org/job-2891-3a6eb3f53baf8e55066b78939c67f29f?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Overview\nWe are seeking a motivated and enthusiastic Sales and Marketing Intern to join our dynamic team. This internship offers a unique opportunity to gain hands-on experience in various aspects of marketing, including digital marketing, content creation, and market analysis. The ideal candidate will have a passion for technology and sales, with the ability to analyze market trends and contribute to our business development efforts.\n\nResponsibilities\n• Assist in the development and execution of Sales and Marketing campaigns across various platforms.\n• Conduct market research to identify trends, customer needs, and competitive analysis.\n• Be part of the sales team by providing insights on customer service and technology sales strategies.\n• Meet and Engage with potential customers as a Sales person.\n• Pitch to customers about company's product and services.\n• Help analyze campaign performance metrics to optimize future marketing efforts.\n• Assist in preparing presentations for internal meetings and client pitches.\n\nQualifications\n• Currently pursuing a degree in Sales and Marketing, Business Administration, or a related field.\n• Strong analytical skills with the ability to interpret data effectively.\n• Excellent communication skills, both written and verbal is a MUST\n• Previous experience or coursework in sales or business development is a plus.\n• Familiarity with customer service principles and practices is desirable.\n• Ability to engage in a conversation and negotiate effectively to build relationships with clients.\n• Bilingual or Multilingual is a nice-to-have skill that will enhance communication with diverse clientele.\n• A proactive attitude with a willingness to learn and take on new challenges in a fast-paced environment.\n\nThis internship is an excellent opportunity for individuals looking to kickstart their career in marketing while gaining valuable experience within a supportive team environment.\n\nJob Type: Internship / Co-op\nContract length: 4 months\n\nPay: $500.00 per month\n\nAdditional pay:\n• Commission pay\n\nSchedule:\n• Monday to Friday\n\nAbility to commute/relocate:\n• Toronto, ON M5C 2M6: reliably commute or plan to relocate before starting work (required)\n\nWork Location: In person",
            "job_is_remote": false,
            "job_posted_at": "2 days ago",
            "job_posted_at_timestamp": 1732492800,
            "job_posted_at_datetime_utc": "2024-11-25T00:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DmZ43aAaRJDTNUwT6AAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13116100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "bUgZ35v8rDjUPdbeAAAAAA==",
            "job_title": "Digital Marketing Co-op/Intern -Campaign",
            "employer_name": "Nokia",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR3VQwotUpX75AsBoBjCoEt7J7haXNIj_Nf0x8O&s=0",
            "employer_website": "http://www.nokia.com/",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/digital-marketing-co-op-intern-campaign-at-nokia-4083775632?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/digital-marketing-co-op-intern-campaign-at-nokia-4083775632?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Description\n\nPosition: Digital Marketing Co-op/Intern - Campaign\n\nNumber of Position(s): 2\n\nDuration: 4 Months\n\nDate: 28 April 2025 to 29 August 2025\n\nLocation: Hybrid in Ottawa, Canada\n\nEducation Recommendations\n• Enrolled in a bachelor’s degree or diploma in Marketing, Communications, Business, or a related field with an accredited school in Canada.\n• Alternatively, enroll in an Electrical/Computer Engineering-related program at an accredited Canadian university.\n• Education in both technical and marketing/communications disciplines is advantageous\n\nHow You Will Contribute And What You Will Learn\n\nAs part of our team, you will:\n• Work closely with our program, campaign, and product marketing teams to draft posts and monitor social media presence on LinkedIn and X.\n• Audit and update internal and external web pages to ensure that our marketing content is up-to-date and easy for our sales teams and customers to find.\n• Project manage product collateral, photo shoots, demo videos, and associated event activities.\n• Search for published articles on technical topics to aid in the development of white papers, application notes, and blogs.\n• Competitive analysis of product offerings, marketing messages, and tactics.\n• Assist managers with registration for live events and filtering and analysis of event contacts. Assist with KPI tracking and reporting.\n\nKey Skills And Experience\n\nWhat is Nokia looking for from me:\n\nThe Network Infrastructure Marketing Programs team at Nokia is seeking a co-op student for the position of Digital Marketing Specialist to support the marketing activities of the Network Infrastructure marketing team. This individual will be responsible for supporting the execution and maintenance of our digital marketing programs and campaigns across various tools and platforms, social media campaigns, and integration with our event presence. Together with the Manager, this position will partner with cross-functional teams to shape and deliver technical marketing content, go-to-market collateral to support regional sales, product feature awareness and to execute the multi-channel campaigns with the objective of driving demand generation, engagement, and increased brand awareness.\n• Well organized, able to multitask, and work with cross-functional teams and subjects simultaneously.\n• Be creative and possess strong written communication, and presentation skills.\n• Strong attention to detail.\n• Effective interpersonal skills, adaptability, initiative, reliability, and judgment.\n• Experience with project and content management as a marketing coordinator.\n• Proficiency in Microsoft Office 365 – Word, PowerPoint, Excel, Teams, SharePoint, Outlook.\n\nAbout Us\n\nCome create the technology that helps the world act together\n\nNokia is committed to innovation and technology leadership across mobile, fixed and cloud networks. Your career here will have a positive impact on people’s lives and will help us build the capabilities needed for a more productive, sustainable, and inclusive world.\n\nWe challenge ourselves to create an inclusive way of working where we are open to new ideas, empowered to take risks and fearless to bring our authentic selves to work\n\nWhat we offer\n\nNokia offers continuous learning opportunities, well-being programs to support you mentally and physically, opportunities to join and get supported by employee resource groups, mentoring programs and highly diverse teams with an inclusive culture where people thrive and are empowered.\n\nNokia is committed to inclusion and is an equal opportunity employer\n\nNokia has received the following recognitions for its commitment to inclusion & equality:\n• One of the World’s Most Ethical Companies by Ethisphere\n• Gender-Equality Index by Bloomberg\n• Workplace Pride Global Benchmark\n\nAt Nokia, we act inclusively and respect the uniqueness of people. Nokia’s employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law. We are committed to a culture of inclusion built upon our core value of respect.\n\nJoin us and be part of a company where you will feel included and empowered to succeed.\n\nAdditional Information\n\nUS/Canada Nokia Offers a comprehensive benefits package that includes but is not limited to:\n• Corporate Retirement Savings Plan\n• Health and dental benefits\n• Short-term disability, and long-term disability\n• Life insurance, and AD&D – Company paid 2x base pay\n• Optional or Supplemental life and AD&D insurance (Employee/Spouse/Child)\n• Paid time off for holidays and Vacation\n• Employee Stock Purchase Plan\n• Tuition Assistance Plan\n• Adoption assistance\n• Employee Assistance Program/Work Life Resource Program\n\nThe above benefits exclude students. Disclaimer for US/Canada\n\nNokia Maintains broad annual base salary ranges for its roles in order to account for variations in knowledge, skills, experience and market conditions, and with consideration to internal peer equity.(Check the salary ranges in the job info section for this role)\n\nAll North America job posts will post for a minimum of 7 calendar days and up to 180 days or until candidate/s identified.\n\nAbout The Team\n\nThe pandemic has highlighted how important telecoms networks are to society. Nokia’s Network Infrastructure group is at the heart of a revolution to bring more and faster network capacity to people worldwide through our ambition, innovation, and technical expertise.",
            "job_is_remote": false,
            "job_posted_at": "18 hours ago",
            "job_posted_at_timestamp": 1732654800,
            "job_posted_at_datetime_utc": "2024-11-26T21:00:00.000Z",
            "job_location": "Ontario",
            "job_city": null,
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 51.253775,
            "job_longitude": -85.323214,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DbUgZ35v8rDjUPdbeAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15119900",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "e1mPj78UmSuyPERkAAAAAA==",
            "job_title": "Client Advisor Intern",
            "employer_name": "Royal Bank of Canada",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQjxu_0uE0HlKgMtr9bhuPLYC9EkSgb9sAlslz-&s=0",
            "employer_website": "http://www.rbc.com/",
            "job_publisher": "RBC Careers",
            "job_employment_type": "Part-time",
            "job_employment_types": [
                "PARTTIME"
            ],
            "job_apply_link": "https://jobs.rbc.com/ca/en/job/R-0000107105/Client-Advisor-Intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "RBC Careers",
                    "apply_link": "https://jobs.rbc.com/ca/en/job/R-0000107105/Client-Advisor-Intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=56a5b360a1019856&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/client-advisor-intern-royal-bank-of-canada-JV_IC2295053_KO0,21_KE22,42.htm?jl=1009542536474&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobillico",
                    "apply_link": "https://www.jobillico.com/en/job-offer/rbc-uiymvf/client-advisor-intern/14899942?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/txX4VP1XwfJLYUVaaMrmKnfu817MOHJh8VNuRn1CXadzQieAIhLmvA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jooble",
                    "apply_link": "https://ca.jooble.org/jdp/-3808673130251582851?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "CAYOP",
                    "apply_link": "https://www.cayop.ca/jobs/82044174-client-advisor-intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Summary\n\nJob Description\n\nAs an RBC Ambassador inside our branches, you will put clients first and find solutions to their individual needs. You will champion the RBC brand and drive business by supporting new client acquisition and deepening existing relationships. If you have the self-motivation to deliver exceptional customer service and are excited to help clients embrace our digital capabilities,, you can build a great career with us as a future Account Manager/Banking Advisor.\n\nWhat will you do?\n• Proactively engage with clients in the branch and deliver an outstanding service experience through completing transactions and by identifying opportunities for advice, solutions, digital enablement and partner introductions\n• Focus on education and demonstration, leverage technology to deliver a memorable client experience, drive solutions and retain business\n• Contribute to team results by listening and spotting opportunities to offer additional advice, introduce clients to the capability of RBC partners, or personally fulfil client solutions\n• Proactively take ownership of resolving and preventing client banking problems\n• Cultivate and maintain relationships with partners to work as one RBC team\n• Manage risks by adhering to compliance routines, processes, and controls to protect client and shareholder interests while completing transactions\n\nWhat do you need to succeed?\n\nMust-have\n• Goal-oriented individual with a demonstrated passion for putting clients first.\n• Drive and self-motivation, as well as excellent communication skills and emotional intelligence\n• Digital literacy across a broad range of devices (i.e., smartphones, tablets, laptops, etc.)\n• Personal flexibility to work flex hours\n• Eagerness to learn and determination to succeed\n• Confidence and ability to learn financial concepts and willingness to obtain the Investment Funds in Canada or the Canadian Securities Course\n\nNice-to-have\n• Track record in building rapport and maintaining client relationships within the financial, service or retail industry\n• Mutual Funds accreditation\n\nWhat’s in it for you?\n\nWe thrive on the challenge to be our best, progressive thinking to keep growing, and working together to deliver trusted advice to help our clients thrive and communities prosper. We care about each other, reaching our potential, making a difference to our communities, and achieving success that is mutual.\n• A comprehensive Total Rewards Program including bonuses and flexible benefits, competitive compensation, commissions, and stock where applicable\n• A world-class training program in financial services\n• Excellent career development and access to a variety of job opportunities across business and geographies\n• Leaders who support your development through coaching and managing opportunities\n• Work in a dynamic, collaborative, progressive, and high-performing team\n\nJob Skills\nAdaptability, Advice Based Solutions, Client Centricity, Client Discovery, Communication, Curiosity, Data Analysis, Digital Literacy\n\nAdditional Job Details\n\nAddress:\n\n540 MAIN ST:WOODSTOCK\n\nCity:\n\nWOODSTOCK\n\nCountry:\n\nCanada\n\nWork hours/week:\n\n20\n\nEmployment Type:\n\nPart time\n\nPlatform:\n\nPERSONAL & COMMERCIAL BANKING\n\nJob Type:\n\nRegular – Trainee (Trainee)\n\nPay Type:\n\nSalaried\n\nPosted Date:\n\n2024-11-26\n\nApplication Deadline:\n\n2024-12-09\n\nNote: Applications will be accepted until 11:59 PM on the day prior to the application deadline date above\n\nInclusion and Equal Opportunity Employment\n\nAt RBC, we embrace diversity and inclusion for innovation and growth. We are committed to building inclusive teams and an equitable workplace for our employees to bring their true selves to work. We are taking actions to tackle issues of inequity and systemic bias to support our diverse talent, clients and communities.\n​​​​​​​\nWe also strive to provide an accessible candidate experience for our prospective employees with different abilities. Please let us know if you need any accommodations during the recruitment process.\n\nJoin our Talent Community\n\nStay in-the-know about great career opportunities at RBC. Sign up and get customized info on our latest jobs, career tips and Recruitment events that matter to you.\n\nExpand your limits and create a new future together at RBC. Find out how we use our passion and drive to enhance the well-being of our clients and communities at jobs.rbc.com.",
            "job_is_remote": false,
            "job_posted_at": "2 days ago",
            "job_posted_at_timestamp": 1732492800,
            "job_posted_at_datetime_utc": "2024-11-25T00:00:00.000Z",
            "job_location": "Woodstock, NB",
            "job_city": "Woodstock",
            "job_state": "New Brunswick",
            "job_country": "CA",
            "job_latitude": 46.150265999999995,
            "job_longitude": -67.6033952,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3De1mPj78UmSuyPERkAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "19309400",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "UfCJxdbYqUyKKAjkAAAAAA==",
            "job_title": "Large Commercial Canada Intern",
            "employer_name": "AXA Group",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTW9X_BwAvBsQOuwoZVPFybsunAajI2SIMe1uyp&s=0",
            "employer_website": "http://www.axa.com/",
            "job_publisher": "Careers At AXA",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://careers.axa.com/global/en/job/AXGRGLOBAL11007663D20241030MYHRTALEOENEXTERNALENGLOBAL/Large-Commercial-Canada-Intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Careers At AXA",
                    "apply_link": "https://careers.axa.com/global/en/job/AXGRGLOBAL11007663D20241030MYHRTALEOENEXTERNALENGLOBAL/Large-Commercial-Canada-Intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=4c03075cd671df51&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/large-commercial-canada-intern-axa-JV_IC2281069_KO0,30_KE31,34.htm?jl=1009520474420&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "JobScout24",
                    "apply_link": "https://www.jobscout24.ch/fr/job/large-commercial-canada-intern/116340835/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/lpumenFJLovNZF4SIY3XDpFDG4W498yYFROOX3XiLMqJFikkhCRh5w?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jooble",
                    "apply_link": "https://ca.jooble.org/jdp/6680819545354729939?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Adzuna",
                    "apply_link": "https://www.adzuna.ca/details/4933463545?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Monster.ca",
                    "apply_link": "https://www.monster.ca/job-openings/large-commercial-canada-intern-toronto-on--766f4f97-18b0-4f19-9804-2cecfa9cefda?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "AXA XL Large Commercial Intern, Americas\n\nToronto, ON I Canada\n\nAXA XL offers property, casualty, financial lines and specialty insurance and reinsurance solutions for mid-sized companies through to large multinationals globally. We blend underwriting discipline, analytic excellence, and a compelling market focus to create excellent partnerships with clients and brokers.\n\nSharpen your skills while gaining insight into the insurance industry. During our 10-week paid internship, you’ll work on meaningful projects alongside diverse and highly skilled professionals as well as widely known leaders in a non-vertical structure that has learning and development in its DNA.\n\nDuring this program, you will join a specific team to learn about their function and the work they do. This opportunity gives you the chance to develop new skills, gain new experiences and interact with technical specialists and company management, which will be key to your future career development. You will be exposed to various areas of our business through intern events and activities.\n\nDISCOVER your opportunity\n\nWhat will your essential responsibilities include?\n\n· Gain insight into the role of insurance professionals (Underwriting, Claims, Finance, Human Resources).\n\n· Develop an understanding of AXA XL’s insurance and reinsurance business.\n\n· Complete cross-functional team project culminating in a final presentation to Senior Leadership.\n\n· Network with leaders across the enterprise\n\n· Engage in a highly collaborative, entrepreneurial work environment\n\nYou will report to Large Commercial Manager.\n\nSHARE your talent\n\nWe’re looking for someone who has these abilities and skills:\n\n· Excellent verbal and written communication and interpersonal skills.\n\n· Demonstrated leadership experience with a drive for results.\n\n· A high level of intellectual capability and curiosity.\n\n· Passion for solving problems through collaboration and innovation.\n\n· Robust sense of ethics and accountability.\n\n· Willing to take on challenges, open to feedback, and ready to act.\n\n· Legal authorization to work in the country in which the position is posted.\n\nFIND your future\n\nAXA XL, the P&C and specialty risk division of AXA, is known for solving complex risks. For mid-sized companies, multinationals and even some inspirational individuals we don’t just provide re/insurance, we reinvent it.\n\nHow? By combining a comprehensive and efficient capital platform, data-driven insights, leading technology, and the best talent in an agile and inclusive workspace, empowered to deliver top client service across all our lines of business − property, casualty, professional, financial lines and specialty.\n\nWith an innovative and flexible approach to risk solutions, we partner with those who move the world forward.\n\nLearn more at axaxl.com\n\nInclusion & Diversity\n\nAXA XL is committed to equal employment opportunity and will consider applicants regardless of gender, sexual orientation, age, ethnicity and origins, marital status, religion, disability, or any other protected characteristic.\n\nAt AXA XL, we know that an inclusive culture and a diverse workforce enable business growth and are critical to our success. That’s why we have made a strategic commitment to attract, develop, advance and retain the most diverse workforce possible, and create an inclusive culture where everyone can bring their full selves to work and can reach their highest potential. It’s about helping one another — and our business — to move forward and succeed.\n• Five Business Resource Groups focused on gender, LGBTQ+, ethnicity and origins, disability and inclusion with 20 Chapters around the globe\n• Robust support for Flexible Working Arrangements\n• Enhanced family friendly leave benefits\n• Named to the Diversity Best Practices Index\n• Signatory to the UK Women in Finance Charter\n\nLearn more at axaxl.com/about-us/inclusion-and-diversity. AXA XL is an Equal Opportunity Employer.\n\nSustainability\n\nAt AXA XL, Sustainability is integral to our business strategy. In an ever-changing world, AXA XL protects what matters most for our clients and communities. We know that sustainability is at the root of a more resilient future. Our 2023-26 Sustainability strategy, called “Roots of resilience,” focuses on protecting natural ecosystems, addressing climate change, and embedding sustainable practices across our operations.\n\nOur Pillars:\n• Valuing nature: How we impact nature affects how nature impacts us. Resilient ecosystems - the foundation of a sustainable planet and society – are essential to our future. We’re committed to protecting and restoring nature – from mangrove forests to the bees in our backyard – by increasing biodiversity awareness and inspiring clients and colleagues to put nature at the heart of their plans.\n• Addressing climate change: The effects of a changing climate are far reaching and significant. Unpredictable weather, increasing temperatures, and rising sea levels cause both social inequalities and environmental disruption. We're building a net zero strategy, developing insurance products and services, and mobilizing to advance thought leadership and investment in societal-led solutions.\n• Integrating ESG: All companies have a role to play in building a more resilient future. Incorporating ESG considerations into our internal processes and practices builds resilience from the roots of our business. We’re training our colleagues, engaging our external partners, and evolving our sustainability governance and reporting.\n• AXA Hearts in Action: We have established volunteering and charitable giving programs to help colleagues support causes that matter most to them, known as AXA XL’s “Hearts in Action” programs. These include our Matching Gifts program, Volunteering Leave, and our annual volunteering day – the Global Day of Giving.\n\nFor more information, please see Sustainability at AXA XL.\n\nThe Canada pay range for this position is 23/Hour. Actual pay will be determined based upon the individual’s skills, experience, and location. We strive for market alignment and internal equity with our colleagues’ pay.",
            "job_is_remote": false,
            "job_posted_at": "15 hours ago",
            "job_posted_at_timestamp": 1732665600,
            "job_posted_at_datetime_utc": "2024-11-27T00:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DUfCJxdbYqUyKKAjkAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "55301800",
            "job_onet_job_zone": null
        },
        {
            "job_id": "ixYnwbFId9osjcp8AAAAAA==",
            "job_title": "Product Manager Intern",
            "employer_name": "Leap Event Technology",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTeOvTMIXFUaedsTSpkFsGLmxuWxXp6A_JdkCTO&s=0",
            "employer_website": "http://patrontechnology.com/",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/product-manager-intern-at-leap-event-technology-4085839090?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/product-manager-intern-at-leap-event-technology-4085839090?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=988405b8bd76346a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "Leap Event Technology",
                    "apply_link": "https://leapeventtech.recruitee.com/o/product-manager-intern-2?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/product-manager-intern-leap-event-technology-JV_IC2296722_KO0,22_KE23,44.htm?jl=1009542433382&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.com/job-listing/product-manager-intern-leap-event-technology-JV_IC2296722_KO0,22_KE23,44.htm?jl=1009542433382&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/nnFvHT_34CkuOJitkEvHTd9Ve-HO4RlnFd1S9o5PB4jW5rZUDGm3gA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Who We Are\n\nLeap is revolutionizing the event technology industry by empowering organizers to create experiences that are more engaging, more thrilling, and more impactful than ever before. Our all-in-one suite of ticketing, mobile apps, experiential marketing, and patron management tools, combined with our expert marketing services, allows organizers to drive nonstop engagement and capture all customer data from their entire event. That’s why iconic brands like New York Comic Con, Bonnaroo, Illuminarium, and the NHL choose us to power their events.\n\nWe are a diverse and passionate team of event experts and fans who are dedicated to helping organizers transform their event experiences. Like our clients, we live and breathe events. We take our passion, knowledge, and hands-on experience and apply it to our work every single day. With offices in Dallas, Montreal, and Sydney, and an expansive remote workforce across the globe, our diverse backgrounds give us the experience needed to create incredible events for any industry, anywhere in the world.\n\nLeap Event Technology is recognized and certified as a Top Workplace and Great Place to Work Canada.\n\nAbout Our Internship Program\n\nOur 3 month program is an opportunity for students enrolled in a post-secondary education program to gain hands-on experience in the live event technology industry. This is a paid internship with a 32 hour a week schedule. Interns will work a hybrid schedule from one of our physical locations (Dallas or Montreal).\n\nThe program is set to start on\n\nJanuary 6, 2025 and end on March 28, 2025. As with all of our new hires, we look for motivated people who exemplify our core values to join our team.\n\nAs a Leap Event Technology Intern, You Will\n• Take part in our mentorship program: Be paired with an experienced member of our team\n• Participate in weekly intern cohort activities and events (social, team building, training)\n• Connect with Senior Leadership: One-on-one conversation with your department head and a Q&A session with our CEO\n• Have access to Udemy Business: a world-class learning and development platform offering over 14,000 training courses\n• Set goals: Work with your manager to determine what you want to accomplish during the program and receive feedback on your performance\n\nAs a Product Manager Intern, You Will\n• Assisting in translating requests into product specifications, collaborating with Design and Engineering teams to create scalable solutions.\n• Learning to write clear product specs that outline problems, user stories, business reasons, and requirements for desired solutions.\n• Supporting the team by responding to questions about the specs and updating them as needed.\n• Helping convert product specs into JIRA tickets and tracking features through their lifecycle.\n• Writing basic documentation for features when necessary.\n• Reviewing product features against specifications and working with the team to resolve any discrepancies.\n• Measuring impact and gathering user feedback to help iterate on solutions.\n• Learning to communicate effectively with various stakeholders, including clients, sales teams, developers, and designers.\n• Collaborating with customer-facing teams and other Product Managers to understand customer needs and help shape the product roadmap.\n\nExperience & Skills\n• Currently pursuing a degree in a related field (e.g., Business, Marketing, Computer Science).\n• Interest in product management and mobile app development.\n• Strong analytical skills with a willingness to learn how to track outcomes and inform decisions.\n• Ability to work collaboratively in a team environment.\n• Good verbal and written communication skills.\n• Adaptability and a problem-solving mindset.\n• Enthusiasm for learning and growing in the field of product management.",
            "job_is_remote": false,
            "job_posted_at": "17 hours ago",
            "job_posted_at_timestamp": 1732658400,
            "job_posted_at_datetime_utc": "2024-11-26T22:00:00.000Z",
            "job_location": "Montreal, Quebec",
            "job_city": "Montreal",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 45.501886899999995,
            "job_longitude": -73.56739189999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DixYnwbFId9osjcp8AAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "11202100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "m5KYGxUr86E3jmcFAAAAAA==",
            "job_title": "Consultant, Internship, Canadian Campuses, Canada",
            "employer_name": "Boston Consulting Group",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQxMy3OJRSwXcqB_s6dIHtI8zYYudxFVfaOcfGQ&s=0",
            "employer_website": "http://www.bcg.com/",
            "job_publisher": "Boston Consulting Group",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://careers.bcg.com/global/en/job/51136/Consultant-Internship-Canadian-Campuses-Canada?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Boston Consulting Group",
                    "apply_link": "https://careers.bcg.com/global/en/job/51136/Consultant-Internship-Canadian-Campuses-Canada?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/consultant-internship-international-campuses-canada-at-boston-consulting-group-bcg-4076246014?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Salary.com",
                    "apply_link": "https://www.salary.com/ca-job/boston-consulting-group-bcg/consultant-internship-international-campuses-canada/j202411190851278232684?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Locations: Toronto | Montreal | Calgary\n\nWho We Are\n• **To submit an application in French, please go to your settings at the top of the page and select French as your language preference. This will enable you to view the portal and application questions in French.***\n• **Pour soumettre une candidature en français, veuillez accéder à vos paramètres en haut de la page et sélectionner le français comme langue de préférence. Cela vous permettra de consulter le portail et les questions relatives à la candidature en français.***\n\nWho We Are\nBoston Consulting Group partners with leaders in business and society to tackle their most important challenges and capture their greatest opportunities. BCG was the pioneer in business strategy when it was founded in 1963. Today, we help clients with total transformation-inspiring complex change, enabling organizations to grow, building competitive advantage, and driving bottom-line impact.\n\nEligibility\nWe are interested in meeting MBA and Advanced Degree Candidate students (PhD, MD, JD, Post-docs) from Canadian schools scheduled to graduate in 2026 who are available for an internship during the summer of 2025.\n\nApplication Deadline\nThe deadline for Summer Consultant applications is Sunday December 8th, 2024 at 11:59 PM ET.\n\nLanguage of work for positions permanently located in Quebec\nKnowledge of French is required for positions permanently located in Quebec so incumbents can communicate with their colleagues and suppliers in Quebec as necessary. French-language training is offered to all incumbents in permanent positions in Quebec who do not have a good knowledge of French.\n\nOther language requirement\nFluent English is required for this position in order to communicate with clients, partners and colleagues, who are predominantly located outside Quebec.\n\nHow to Apply\n\nCandidates interested in applying must submit an application including a cover letter, resume and most recent unofficial transcript. All required documents should be uploaded in one single file without password protection. Additional documents may be added to the \"My Profile\" tab at any time in the section titled \"Resumes and Other Documents\"\n\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nQui sommes-nous\nLe Boston Consulting Group s'associe aux leaders du monde des affaires et de la société pour relever leurs défis les plus importants et saisir leurs plus grandes opportunités. Le BCG a été le pionnier de la stratégie d'entreprise lors de sa création en 1963. Aujourd'hui, nous aidons nos clients à opérer une transformation totale - en inspirant des changements complexes, en permettant aux organisations de se développer, en créant un avantage concurrentiel et en produisant un impact sur les résultats.\n\nCritères d'admissibilité\nNous souhaitons rencontrer des étudiants en MBA et des candidats à un diplôme d'études supérieures (PhD, MD, JD, Post-docs) d'écoles canadiennes qui devraient obtenir leur diplôme en 2026 et qui sont disponibles pour un stage au cours de l'été 2025.\n\nDate limite de dépôt des candidatures\nLa date limite pour les candidatures de consultants pour un poste de stage d’été est le 8 décembre 2024 à 23h59 HE.\n\nLangue de travail pour les postes situés en permanence au Québec\nLa connaissance du français est requise pour les postes situés en permanence au Québec afin que le titulaire puisse communiquer au besoin avec ses collègues et les fournisseurs au Québec. Une formation en français est offerte à tout titulaire d’un poste permanent au Québec qui ne possède pas une bonne connaissance du français.\n\nAutre exigence linguistique\n\nLa maîtrise de l’anglais est requise pour ce poste afin de pouvoir communiquer avec les clients, partenaires et collègues qui sont majoritairement situés à l’extérieur du Québec.\n\nComment postuler\nLes candidats intéressés doivent soumettre une candidature comprenant une lettre de motivation, un curriculum vitae et le plus récent relevé de notes non officiel. Tous les documents requis doivent être téléchargés dans un seul fichier sans protection par mot de passe. Des documents supplémentaires peuvent être ajoutés à l'onglet « Mon profil » à tout moment dans la section intitulée « CV et autres documents\n\n#LI-DNI\n\nBoston Consulting Group is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, age, religion, sex, sexual orientation, gender identity / expression, national origin, disability, protected veteran status, or any other characteristic protected under national, provincial, or local law, where applicable, and those with criminal histories will be considered in a manner consistent with applicable state and local laws.\n\nBCG is an E - Verify Employer. Click here for more information on E-Verify.\n#LI-DNI",
            "job_is_remote": false,
            "job_posted_at": "15 hours ago",
            "job_posted_at_timestamp": 1732665600,
            "job_posted_at_datetime_utc": "2024-11-27T00:00:00.000Z",
            "job_location": "Calgary, AB",
            "job_city": "Calgary",
            "job_state": "Alberta",
            "job_country": "CA",
            "job_latitude": 51.044733099999995,
            "job_longitude": -114.0718831,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dm5KYGxUr86E3jmcFAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "21101200",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "dRQBY8opC5gauluAAAAAAA==",
            "job_title": "Summer Intern",
            "employer_name": "College Pro",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR_TLg6PAUMEsTaA7jwyII5vP0iSlqaeTS8rNAZ&s=0",
            "employer_website": "https://collegepro.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/summer-intern-at-college-pro-4082619002?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/summer-intern-at-college-pro-4082619002?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobs Trabajo.org",
                    "apply_link": "https://ca.trabajo.org/job-2891-d4feebb6460e4ba44dd581df9cbccda0?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Summer 2025 Business Management Position\n\nWe are an organization that specializes in providing real-world business experience through summer positions that are challenging, rewarding, and a ton of fun. We are very excited to be expanding our operations to service more customers in Ontario! We have 50 exclusive management positions on our Summer 2025 team, we are looking for candidates that are tenacious, competitive, creative, and ready for a challenge.\n\nWhat does the position entail?\n\nThis is a hands-on business internship. In this position you will be responsible for managing the operations and marketing for a division of a residential home servicing business for the summer 2025 season. This is a challenging position, but for those who are ready to take it on and work hard, you will learn a lot of valuable business skills, meet new people across our talented network, and make great money!\n\nThe main tasks of the role include:\n• Interview, select, and lead a team of 2 other team members.\n• Manage the operations of a home servicing business in a specified region.\n• Lead the team performing home services including window cleaning, gutter cleaning, and power-washing.\n• Generate customers by leading a door-to-door sales team, as well as via referrals, social media, and digital marketing.\n• Collect and submit customer payments.\n• Maintain high levels of customer service excellence.\n• Take part in coaching meetings and skill-development sessions.\n\nWhat will you get out of this?\n• Real world management experience.\n• An impressive skill set with skill development in areas such as leadership, time-management skills, interpersonal skills, problem-solving skills, etc.\n• A chance to meet and network with a large group of high-performing students from schools across the country.\n• Opportunities to grow and take on more responsibility in following seasons.\n\nWhat do you need / Qualifications?\n• A valid driver's license and full-time access to a vehicle for the summer of 2025.\n• Full-time availability for the summer of 2025, with space to take vacation in July/August.\n• You will get coaching on all the skills you need to be successful in this role, but you need to be ready to work hard and be up for a challenge!\n\nEarning:\n• $21 per hour\n• Gas & Cell allowance\n• Paid training\n• Most Managers make between $12,000 and $18,000 in the summer season depending on performance in the role, with top performing managers earning much more!\n\nWe will be connecting with candidates and are looking to have our full team hired by April 1st. If you are interested in learning more, and getting relevant work experience apply here!",
            "job_is_remote": false,
            "job_posted_at": "2 days ago",
            "job_posted_at_timestamp": 1732492800,
            "job_posted_at_datetime_utc": "2024-11-25T00:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DdRQBY8opC5gauluAAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "11103100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "pGd9e7Zl5BYTZ6UBAAAAAA==",
            "job_title": "Digital Marketing and Content Creation (Photography) Internship",
            "employer_name": "Canadian Jewellers Technology",
            "employer_logo": null,
            "employer_website": "https://canadianjewellerstech.ca",
            "job_publisher": "Glassdoor",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://www.glassdoor.ca/job-listing/digital-marketing-and-content-creation-photography-internship-canadian-jewellers-technology-JV_IC2281069_KO0,61_KE62,91.htm?jl=1009541937211&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": true,
            "apply_options": [
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/digital-marketing-and-content-creation-photography-internship-canadian-jewellers-technology-JV_IC2281069_KO0,61_KE62,91.htm?jl=1009541937211&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://fr.simplyhired.ca/job/cde8ZsmcN-esEbl0e7yelBGHFpWYMzjeJvCxWh56WP8kT2y6HNWkVw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobs Trabajo.org",
                    "apply_link": "https://ca.trabajo.org/job-2891-cd4fd5d5b2019d3bd4c37ddf23ff69ef?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Summary\nWe are seeking a motivated and creative Digital Marketing Internship to join our dynamic team. This internship offers a unique opportunity to gain hands-on experience in various aspects of marketing, including digital marketing strategies, content creation, and market research. The ideal candidate will be eager to learn, possess strong communication skills, and have a passion for Digital Marketing and Content Creation.\n\nDuties\n• Assist in the development and execution of marketing campaigns across multiple channels.\n• Conduct thorough research on industry trends, competitor analysis, and customer preferences.\n• Create engaging content for social media platforms, blogs, and newsletters.\n• Support the management of websites using Shopify, WordPress, ensuring content is up-to-date and optimized for SEO.\n• Collaborate with the team to design graphics and promotional materials with the ability to take photos for content creation.\n• Analyze data from Google Ads and other digital marketing tools to assess campaign performance.\n• Help maintain e-commerce platforms by updating product listings and optimizing user experience.\n• Participate in brainstorming sessions to generate innovative marketing ideas.\n\nRequirements\n• Currently pursuing a Degree in Digital Marketing, Communications, Business, Content Photography or a related field.\n• Photography for content creation is an asset.\n• Familiarity with Adobe Creative Suite (Photoshop, Illustrator) is preferred\n• Basic knowledge of HTML, CSS, APIs, Shopify, Wordpress is preferred\n• Experience in SEO principles and Google Ads is a must\n• Experience with JavaScript or WordPress will be considered an asset.\n• Strong research skills and attention to detail.\n• Excellent written and verbal communication skills.\n• Ability to work independently as well as part of a team in a fast-paced environment.\n\nThis internship provides an excellent platform for personal growth and professional development within the marketing field. We look forward to welcoming enthusiastic candidates who are ready to contribute their skills while learning from our experienced team.\n\nJob Type: Internship / Co-op\nContract length: 4 months\n\nPay: $500.00 per month\n\nSchedule:\n• Monday to Friday\n\nAbility to commute/relocate:\n• Toronto, ON M5C 2M6: reliably commute or plan to relocate before starting work (required)\n\nApplication question(s):\n• Do you own a professional camera for Content Creation with Photography?\n\nWork Location: In person\n\nApplication deadline: 2024-11-30",
            "job_is_remote": false,
            "job_posted_at": "2 days ago",
            "job_posted_at_timestamp": 1732492800,
            "job_posted_at_datetime_utc": "2024-11-25T00:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DpGd9e7Zl5BYTZ6UBAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "27402100",
            "job_onet_job_zone": "3"
        },
        {
            "job_id": "4jLK1ehiKzWz8qufAAAAAA==",
            "job_title": "Manager, Financial Planning Intern",
            "employer_name": "Royal Bank of Canada",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQjxu_0uE0HlKgMtr9bhuPLYC9EkSgb9sAlslz-&s=0",
            "employer_website": "http://www.rbc.com/",
            "job_publisher": "RBC Careers",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://jobs.rbc.com/ca/en/job/R-0000106680/Manager-Financial-Planning-Intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "RBC Careers",
                    "apply_link": "https://jobs.rbc.com/ca/en/job/R-0000106680/Manager-Financial-Planning-Intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://emplois.ca.indeed.com/viewjob?jk=2d9c0891da43d11c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/Royal-Bank-of-Canada/Job/Manager,-Financial-Planning-Intern/-in-Brossard,QC?jid=b748b9cc34fd2c9a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/manager-financial-planning-intern-rbc-JV_IC2299732_KO0,33_KE34,37.htm?jl=1009541420083&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobillico",
                    "apply_link": "https://www.jobillico.com/en/job-offer/rbc-uiymvf/manager-financial-planning-intern/14896903?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/manager-financial-planning-intern-en-at-rbc-4085458282?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.com/job-listing/manager-financial-planning-intern-rbc-JV_IC2299732_KO0,33_KE34,37.htm?jl=1009541420083&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "BeBee Canada Meet Opportunities",
                    "apply_link": "https://ca.bebee.com/job/f0b1a44fe5f0caa48c7c46062d47dc1a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Summary\n\nJob Description\n\nWhat is the opportunity?\n\nYou will coach and develop an effective, adaptable financial planning sales team to maximize revenue and capitalize on opportunities. As a leader you reinforce with your team to achieve a superior client experience and enhance employee capability and engagement while leveraging full RBC capabilities, in platform and across the enterprise to deepen client relationships.\n\nWhat will you do?\n• Achieve business results through sales and market leadership, implementation of strategic direction and representation in the local marketplace\n• Work in partnership with Regional Sales teams to implement strategies, processes and disciplines to ensure a high level of financial advice and relationship management for clients with sophisticated financial needs\n• Develop an effective, adaptable sales team to ensure a differentiated experience for our clients\n• Champions sales management practices and leads in the implementation of strategic initiatives\n• Enhance employee commitment, capability and customer loyalty while leveraging full RBC Financial Group capabilities, including specialized sales forces, alternate delivery channels and service partners\n\nWhat do you need to succeed?\n\nMust-have\n• Minimum of 3 years leadership experience with a proven track record of managing a sales team of investment professionals\n• Proven application of business acquisition, establishing community and client relationships with success in business growth\n• Experience with emerging communications and technology (i.e. web based meetings, social media, Digital Banking and Mobile Applications)\n• Financial Planning Designation (IPF)\n• Mutual Funds License (IFIC or CSC)\n• Bilingualism (English and French) required, as you will regularly serve our clients with English and French-speaking needs.\n\nNice-to-have\n• Role model for relationship building, partnering and collaboration\n• Well-developed Impact and Influence competency - ability to work with a wide variety of business partners to achieve success within a market place\n• Expert knowledge of coaching and be a change management leader\n• Strong organizational skills with the ability to manage a geographically diverse and mobile team\n• A post-secondary diploma/degree, ideally in Commerce, Business Administration or related experience is required\n\nWhat’s in it for you?\n\nWe thrive on the challenge to be our best, progressive thinking to keep growing, and working together to deliver trusted advice to help our clients thrive and communities prosper. We care about each other, reaching our potential, making a difference to our communities, and achieving success that is mutual.\n• A comprehensive Total Rewards Program including performance based bonuses, flexible benefits and competitive compensation\n• Leaders who support your development through coaching and managing opportunities\n• A collaborative dynamic culture where personal initiative and hard work are recognized and rewarded\n• A unique opportunity for personal and professional growth\n\nJob Skills\nBuilding Talent, Business Development, Inspiring, Long Term Planning\n\nAdditional Job Details\n\nAddress:\n\n1 PLACE VILLE MARIE:MONTRÉAL\n\nCity:\n\nMONTRÉAL\n\nCountry:\n\nCanada\n\nWork hours/week:\n\n37.5\n\nEmployment Type:\n\nFull time\n\nPlatform:\n\nPERSONAL & COMMERCIAL BANKING\n\nJob Type:\n\nRegular\n\nPay Type:\n\nSalaried\n\nPosted Date:\n\n2024-11-25\n\nApplication Deadline:\n\nNote: Applications will be accepted until 11:59 PM on the day prior to the application deadline date above\n\nInclusion and Equal Opportunity Employment\n\nAt RBC, we embrace diversity and inclusion for innovation and growth. We are committed to building inclusive teams and an equitable workplace for our employees to bring their true selves to work. We are taking actions to tackle issues of inequity and systemic bias to support our diverse talent, clients and communities.\n​​​​​​​\nWe also strive to provide an accessible candidate experience for our prospective employees with different abilities. Please let us know if you need any accommodations during the recruitment process.\n\nJoin our Talent Community\n\nStay in-the-know about great career opportunities at RBC. Sign up and get customized info on our latest jobs, career tips and Recruitment events that matter to you.\n\nExpand your limits and create a new future together at RBC. Find out how we use our passion and drive to enhance the well-being of our clients and communities at jobs.rbc.com.",
            "job_is_remote": false,
            "job_posted_at": "2 days ago",
            "job_posted_at_timestamp": 1732492800,
            "job_posted_at_datetime_utc": "2024-11-25T00:00:00.000Z",
            "job_location": "Laval, Quebec",
            "job_city": "Laval",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 45.6066487,
            "job_longitude": -73.712409,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D4jLK1ehiKzWz8qufAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "11303100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "xmxZj59PnVjjgjtnAAAAAA==",
            "job_title": "2025 Summer Sales Intern",
            "employer_name": "Vantage Marketing Canada",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRUy2nrMvcw5mOb368JlBJrr4oABTNYpHk-oJGB&s=0",
            "employer_website": "https://www.vantagemarketingcanada.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/2025-summer-sales-intern-at-vantage-marketing-canada-4071675282?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/2025-summer-sales-intern-at-vantage-marketing-canada-4071675282?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "2025 Summer Sales Intern - Vantage Marketing Canada\n\nTransform Your Summer: Learn, Earn, and Grow with Vantage\n\nAre you ready to jumpstart your career with a summer experience that combines intensive learning with exceptional earning potential? Vantage Marketing Canada offers you the opportunity to develop crucial professional skills, earn an impressive income, and enjoy an unforgettable summer in some of Canada's most vibrant cities.\n\nAbout Us\n\nVantage Marketing Canada, established in 2009, has revolutionized the pest control industry by creating an innovative marketing strategy for residential homeowners. Today, we're proud to be Canada's #1 summer sales experience, having employed over 1,500 students across seven provinces coast-to-coast.\n\nThe Role: Summer Sales Intern\n\nAs a Summer Sales Intern, you'll be immersed in a dynamic learning environment, representing Insight Pest Solutions - Canada's largest residential pest control company. This role is designed to challenge you and accelerate your professional growth:\n• Master the art of sales through hands-on experience\n• Develop high-level communication and negotiation skills\n• Enhance your critical thinking and problem-solving abilities\n• Participate in a comprehensive sales boot camp covering topics like persuasion, body language, and non-verbal communication\n\nWhat We Offer\n• Exceptional Learning Environment: Our program is structured as an intensive sales boot camp with continuous on-the-job training\n• Impressive Earning Potential: 80% of our representatives earn between $15,000-$25,000 during the summer, with top-performing first-year representatives earning over $100,000 (you read that right!)\n• Commission Structure: First-year reps start at 20% and have the ability to work up to 40%\n• Free Housing: Enjoy rent-free living from May to August in your chosen city, or stay at home\n• Comprehensive Training: Benefit from our sales curriculum, morning sales meetings, and one-on-one coaching\n• Mentorship: Receive guidance from experienced sales managers\n• Exciting Culture: Work hard and play harder with team activities, incentives, and competitions\n• Top Performers Trip: An exclusive opportunity for our best sellers in August\n\nWho We're Looking For\n\nThe ideal candidate:\n• Has a competitive background (sports, debate, etc.)\n• Is intrinsically motivated and eager to learn\n• Possesses outstanding people skills and is outgoing\n• Is driven by personal and professional growth\n• Enjoys challenges and new experiences\n\nA Day in Life\n• Mornings: Gym, meditation, or any other personal routine you have!\n• Noon: Team sales meeting and training session, drive to the assigned area for the day\n• 2 PM until dark: Begin door-to-door sales, applying your learned skills\n• Six-day work week with half-day Saturdays and Sundays off\n\nWhy Choose Vantage for Your Summer of Growth?\n• Accelerated Skill Development: Gain invaluable sales and marketing skills applicable to any career path\n• Financial Literacy: Learn to earn and manage substantial income\n• Personal Growth: Challenge yourself, build confidence, and develop a strong work ethic\n• Networking: Connect with like-minded peers and industry professionals\n• Practical Business Education: Experience real-world application of business principles\n\nReady to transform your summer into an intensive learning experience with exceptional earning potential? Apply and let’s find out if we’re a good fit!",
            "job_is_remote": false,
            "job_posted_at": "2 days ago",
            "job_posted_at_timestamp": 1732492800,
            "job_posted_at_datetime_utc": "2024-11-25T00:00:00.000Z",
            "job_location": "Hamilton, ON",
            "job_city": "Hamilton",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.2557206,
            "job_longitude": -79.8711024,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DxmxZj59PnVjjgjtnAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "55301800",
            "job_onet_job_zone": null
        },
        {
            "job_id": "VxTvr4JjPLaRKBJbAAAAAA==",
            "job_title": "Student, Transporation Accounting Co-op/Intern",
            "employer_name": "Inter Pipeline",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS-7f0lE-5bx0A1FrjixZnSRBLQTvahS0oWwkwg&s=0",
            "employer_website": "http://interpipeline.com/",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/student-transporation-accounting-co-op-intern-at-inter-pipeline-4083399955?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/student-transporation-accounting-co-op-intern-at-inter-pipeline-4083399955?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://emplois.ca.indeed.com/viewjob?jk=bafd260cae6ea4d0&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Eluta.ca",
                    "apply_link": "https://www.eluta.ca/spl/student-transporation-accounting-co-op-intern-6c597335e25414a45b2c0daa13b6567a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://fr.glassdoor.ca/job-listing/student-transporation-accounting-co-op-intern-inter-pipeline-JV_IC2275123_KO0,45_KE46,60.htm?jl=1009542057320&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.com/job-listing/student-transporation-accounting-co-op-intern-inter-pipeline-JV_IC2275123_KO0,45_KE46,60.htm?jl=1009542057320&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/48edRgfPPsIcL7hTCNvwL8MHZCt9AP6JZVI5IvMgwQIHYzld0K9NGg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "BeBee Canada Meet Opportunities",
                    "apply_link": "https://ca.bebee.com/job/e4380c8cc2c0ee0a3b3ec63d8dbb77bf?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "At Inter Pipeline, we are building a team of innovators and problem solvers with diverse backgrounds and skill sets. We cultivate opportunities to get to know each other better and collaborate more effectively. In every part of our organization, you will find people with a sense of purpose and a shared ethos - motivated, engaged, exploring new ideas and pushing for continuous improvements in everything we do. We believe teamwork is core to our success, and in that spirit you will work closely with leaders and team members. This is a great opportunity to amplify your purpose and contribute to meaningful, challenging work at the forefront of the energy sector.\n\nBring your passion, your ideas, and let's do this.\n\nDescription\n\nLocated out of our Calgary office, the individual in the Accounting Co-op Student/Intern role will report to the Manager, Transportation Finance. The successful candidate will be a member of the team assisting with Transportation Accounting functions.\n\nKey Activities And Responsibilities\n• Preparing account reconciliations\n• Assisting with clearing costs in our financial system (SAP)\n• Preparing and posting journal entries\n• Communicating with internal and external stakeholders\n• Provide support in pulling evidence for ongoing audits\n• Assist in creating billing invoices to be sent to customers\n• Assisting with reporting tasks and KPI creation\n• Other projects as assigned\n\nEducation, Skills & Experience\n• Post-secondary student who has completed their 2nd or 3rd year in university or college from a Business, Finance or Accounting program\n• Strong attention to detail and accuracy, communication and organizational skills\n• Well-developed interpersonal, team, and customer service communication skills (both written and verbal)\n• Intermediate to advanced MS Office Suite computer skills\n• Ability to set and meet deadlines and work independently\n• Ability to work well in a fast-paced, deadline oriented, growth environment\n\nHours\n\nFull time: Monday to Friday; 40 hours per week\n\nStart Date: May 1st, 2025 for 8 months with opportunity to extend\n\nAs this position is identified as security sensitive, employment of a final candidate will be conditional upon completion of pre-employment criminal background check assessment with satisfactory results.\n\nWhile diversity is a fact, inclusion is the act of recognizing the value of our differences and leveraging them for the betterment of our organization. At Inter Pipeline, we are dedicated to building an inclusive and equitable workplace that values, represents, and supports the communities in which we work. We are committed to maintaining a respectful workplace and we are building a culture that supports the diverse needs of our employees. We welcome applications from all individuals including those who are Indigenous, racialized, of varied abilities and ethnicities, members of gender and sexually diverse communities, as well as with any other dimension of diversity.",
            "job_is_remote": false,
            "job_posted_at": "20 hours ago",
            "job_posted_at_timestamp": 1732647600,
            "job_posted_at_datetime_utc": "2024-11-26T19:00:00.000Z",
            "job_location": "Calgary, AB",
            "job_city": "Calgary",
            "job_state": "Alberta",
            "job_country": "CA",
            "job_latitude": 51.044733099999995,
            "job_longitude": -114.0718831,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DVxTvr4JjPLaRKBJbAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13201100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "-qPrRBdC3XDseugRAAAAAA==",
            "job_title": "Software Engineer Intern (Toronto) - Summer 2025",
            "employer_name": "Snowflake",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQSpLqaY5bhser3M_0CNtOLHRqhfh6VYSZ_gF1p&s=0",
            "employer_website": "https://www.snowflake.com",
            "job_publisher": "Snowflake Careers",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://careers.snowflake.com/us/en/job/SNCOUSD38DF19E64C1405CA3A1ADC24F5ADB9EEXTERNALENUS152B293DEC65486289577F50089728AC/Software-Engineer-Intern-Toronto-Summer-2025?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Snowflake Careers",
                    "apply_link": "https://careers.snowflake.com/us/en/job/SNCOUSD38DF19E64C1405CA3A1ADC24F5ADB9EEXTERNALENUS152B293DEC65486289577F50089728AC/Software-Engineer-Intern-Toronto-Summer-2025?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=787d3f1fcf1fec99&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/software-engineer-intern-toronto-summer-2025-snowflake-JV_IC2281069_KO0,44_KE45,54.htm?jl=1009498546341&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "The Muse",
                    "apply_link": "https://www.themuse.com/jobs/snowflake/software-engineer-intern-toronto-summer-2025-a5cda2?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/03epF4jmPwDutsVVPTSBYwvGafcV7Cp8aHW7pWqamKBwfK0orMukRw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Simplify Jobs",
                    "apply_link": "https://simplify.jobs/p/6a1f18c7-a96d-4d28-abbc-37e66769a113/Software-Engineer-Intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Fairygodboss",
                    "apply_link": "https://fairygodboss.com/jobs/snowflake/software-engineer-intern-toronto-summer-2025-efdfae4289cc37b5a7956fce8a36b3a8?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Build the future of the AI Data Cloud. Join the Snowflake team.\n\nSnowflake started with a clear vision: develop a cloud data platform that is effective, affordable, and accessible to all data users. Snowflake developed an innovative new product with a built-for-the-cloud architecture that combines the power of data warehousing, the flexibility of big data platforms, and the elasticity of the cloud at a fraction of the cost of traditional solutions. We are now a global, world-class organization with offices in more than a dozen countries and serving many more.\n\nWe’re looking for dedicated students who share our passion for ground-breaking technology and want to create a lasting future for you and Snowflake.\nWHAT WE OFFER:\n• Paid, full-time internships in the heart of the software industry\n• Post-internship career opportunities (full-time and/or additional internships)\n• Exposure to a fast-paced, fun and inclusive culture\n• A chance to work with world-class experts on challenging projects\n• Opportunity to provide meaningful contributions to a real system used by customers\n• High level of access to supervisors (manager and mentor), detailed direction without micromanagement, feedback throughout your internship, and a final evaluation\n• Stuff that matters: treated as a member of the Snowflake team, included in company meetings/activities, flexible hours, casual dress code, accommodations to work from home, swag and much more\n• When return to office in effect, catered lunches, access to gaming consoles, recreational games, happy hours, company outings, and more\n\nWHAT WE EXPECT:\n• Desired class level: 3rd/4th year Undergraduates, Masters, or PhD\n• Desired majors: Computer Science, Computer Engineering, Software Engineering, or related field\n• Required coursework: algorithms, data structures, and operating systems\n• Recommended coursework: cloud computing, database systems, distributed systems, and real-time programming\n• Bonus experience: working experience, research or publications in databases or distributed systems, and contributions to open source\n• When: Summer 2025 (April - September 2025)\n• Duration: 12 week minimum, 12-16 weeks recommended\n• Excellent programming skills in C++ or Java\n• Knowledge of data structures and algorithms\n• Strong problem solving and ability to learn quickly in a dynamic environment\n• Experience with working as a part of a team\n• Dedication and passion for technology\n\nWHAT YOU WILL LEARN/GAIN:\n• How to build enterprise grade, reliable, and trustworthy software/services\n• Exposure to SQL or other database technologies\n• Understanding of database internals, large-scale data processing, transaction processing, distributed systems, and data warehouse design\n• Implementation, testing of features in query compilation, compiler design, query execution\n• Experience working with cloud infrastructure, AWS, Azure, and/or Google Cloud in particular\n• Learning about cutting edge database technology and research\n\nPOSSIBLE TEAMS/WORK FOCUS AREAS:\n• Data Applications Infrastructure, Data Marketplace, Data Privacy, Data Sharing\n• High performance large-scale data processing\n• Large-scale distributed systems\n• Software-as-a-Service platform\n• Software frameworks for stability and performance testing\n\nEvery Snowflake employee is expected to follow the company’s confidentiality and security standards for handling sensitive data. Snowflake employees must abide by the company’s data security plan as an essential part of their duties. It is every employee's duty to keep customer information secure and confidential.\n\nSnowflake is growing fast, and we’re scaling our team to help enable and accelerate our growth. We are looking for people who share our values, challenge ordinary thinking, and push the pace of innovation while building a future for themselves and Snowflake.\n\nHow do you want to make your impact?",
            "job_is_remote": false,
            "job_posted_at": "2 days ago",
            "job_posted_at_timestamp": 1732492800,
            "job_posted_at_datetime_utc": "2024-11-25T00:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D-qPrRBdC3XDseugRAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15113100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "XSyVnWrvba8vMNm_AAAAAA==",
            "job_title": "Banking Advisor Intern",
            "employer_name": "Royal Bank of Canada",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQjxu_0uE0HlKgMtr9bhuPLYC9EkSgb9sAlslz-&s=0",
            "employer_website": null,
            "job_publisher": "RBC Careers",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://jobs.rbc.com/ca/en/job/R-0000106979/Banking-Advisor-Intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "RBC Careers",
                    "apply_link": "https://jobs.rbc.com/ca/en/job/R-0000106979/Banking-Advisor-Intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=d8b50fc6c9e061aa&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/Royal-Bank-of-Canada/Job/Banking-Advisor-Intern/-in-Abbotsford,BC?jid=69a55c35940acf11&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/banking-advisor-intern-rbc-JV_IC2278191_KO0,22_KE23,26.htm?jl=1009541420106&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobillico",
                    "apply_link": "https://www.jobillico.com/en/job-offer/rbc-uiymvf/banking-advisor-intern/14893405?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobs.ca",
                    "apply_link": "https://www.jobs.ca/offer/banking-advisor-intern/a302c6c7-f4d4-4e28-ada9-ba635dfd28ce_en/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Talentify",
                    "apply_link": "https://www.talentify.io/job/banking-advisor-intern-abbotsford-british-columbia-ca-rbc-r-0000106979?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "BeBee Canada Meet Opportunities",
                    "apply_link": "https://ca.bebee.com/job/fd03c3c9826a3eb796aaf0fba1c71bb7?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Summary\n\nWhat is the opportunity?\nThis unique position calls on your client-focused sales expertise and natural problem-solving skills to maximize each client interaction. Specifically, you help clients with their everyday banking, As an RBC ambassador, you add value in the moments that matter most to clients and collaborate with RBC partners to help clients achieve their goals. Whether you’re demonstrating to a client how to use digital banking, on-boarding a new client, or referring a complex opportunity to a specialist, your expertise will contribute to creating meaningful and memorable client experiences to drive client satisfaction and loyalty.\n\nWhat will you do?\n• Proactively engage with clients in all areas of the branch and in the community, uncovering banking needs, providing help and advice, as well as identifying sales and referral opportunities\n• Focus on client education and demonstration, leveraging technology to deliver a memorable client experience, drive sales, and retain business\n• Respond to client-initiated contact, assisting them with a full range of financial transactions\n• Actively listen and engage clients in conversation to further understand their individual needs\n• Proactively take ownership of resolving and preventing client banking problems\n• Cultivate and maintain relationships with partners to make the most of business opportunities and referrals\n\nWhat do you need to succeed?\nMust-have\n• Demonstrated passion for putting clients first, as well as success in a hands-on, target-driven sales environment\n• Problem-solving and people skills, with the ability to build strong relationships and proactively connect with clients\n• Flexibility, eagerness to learn, strong personal ethics, and a hunger for success\n• Digital literacy across a broad range of devices (i.e., smartphones, tablets, laptops, etc.)\n• Must be able to work all business hours\n\nNice-to-have\n• Track record in building rapport and maintaining client relationships within the financial or service industry\n• Mutual Funds accreditation (i.e., Investment Funds in Canada or the Canadian Securities Course)\n\nWhat’s in it for you?\nWe thrive on the challenge to be our best, progressive thinking to keep growing, and working together to deliver trusted advice to help our clients thrive and communities prosper. We care about each other, reaching our potential, making a difference to our communities, and achieving success that is mutual.\n• A comprehensive Total Rewards Program including competitive compensation, bonuses, and flexible benefits\n• Continued opportunities for career advancement\n• World-class sales training, coaching, and development opportunities\n• Support from a dynamic, collaborative, progressive, and high performing team, as well as world-class tools and training\n• Opportunity to achieve great success and grow your career with RBC\n\nRBC is committed to supporting flexible work arrangements when and where available. Details to be discussed with Hiring Manager.\n\nPCBADV\n\nJob Description\n\nJob Skills\n\nAdditional Job Details\n\nAddress:\n\n31975 SOUTH FRASER WAY:ABBOTSFORD\n\nCity:\n\nABBOTSFORD\n\nCountry:\n\nCanada\n\nWork hours/week:\n\n37.5\n\nEmployment Type:\n\nFull time\n\nPlatform:\n\nPERSONAL & COMMERCIAL BANKING\n\nJob Type:\n\nRegular\n\nPay Type:\n\nSalaried\n\nPosted Date:\n\n2024-11-25\n\nApplication Deadline:\n\n2024-12-02\n\nNote: Applications will be accepted until 11:59 PM on the day prior to the application deadline date above\n\nInclusion and Equal Opportunity Employment\n\nAt RBC, we embrace diversity and inclusion for innovation and growth. We are committed to building inclusive teams and an equitable workplace for our employees to bring their true selves to work. We are taking actions to tackle issues of inequity and systemic bias to support our diverse talent, clients and communities.\n​​​​​​​\nWe also strive to provide an accessible candidate experience for our prospective employees with different abilities. Please let us know if you need any accommodations during the recruitment process.\n\nJoin our Talent Community\n\nStay in-the-know about great career opportunities at RBC. Sign up and get customized info on our latest jobs, career tips and Recruitment events that matter to you.\n\nExpand your limits and create a new future together at RBC. Find out how we use our passion and drive to enhance the well-being of our clients and communities at jobs.rbc.com.",
            "job_is_remote": false,
            "job_posted_at": "3 days ago",
            "job_posted_at_timestamp": 1732406400,
            "job_posted_at_datetime_utc": "2024-11-24T00:00:00.000Z",
            "job_location": "Abbotsford, BC",
            "job_city": "Abbotsford",
            "job_state": "British Columbia",
            "job_country": "CA",
            "job_latitude": 49.050437699999996,
            "job_longitude": -122.3044697,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DXSyVnWrvba8vMNm_AAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13205200",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "tbdsyKOxKwbzQMDAAAAAAA==",
            "job_title": "Intern, Process Management - Summer",
            "employer_name": "Capital One",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQNPQG7Z0uAoU6YEi5nN-newYRN5u6-jG1rDEyp&s=0",
            "employer_website": "https://www.capitalone.com",
            "job_publisher": "Learn4Good",
            "job_employment_type": "Full-time, Part-time and Internship",
            "job_employment_types": [
                "FULLTIME",
                "PARTTIME",
                "INTERN"
            ],
            "job_apply_link": "https://www.learn4good.com/jobs/toronto/canada/finance/3766872824/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Learn4Good",
                    "apply_link": "https://www.learn4good.com/jobs/toronto/canada/finance/3766872824/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Position: Intern, Process Management - Summer 2025\n161 bay street (93021), canada, toronto,toronto, ontario,intern, process management - summer 2025must include your cover letter, resume and unofficial transcript in one pdf document in the attachment section when you create your profile to apply.our capital one process management team.yes, we’re a credit card company. But we’re more than that too. We’re driven by what our customers want, and how to make their lives simpler.\n\nAs the pioneers of big data in the financial industry, we thrive on using data analysis to solve complex problems and build a world class business. We offer exciting opportunities for innovation as the industry becomes increasingly focused on digital technology, and the amount of data available to ground our strategies continues to grow. With your help, we will build the next generation of banking in canada based on customer-focused values, compelling products, and great engineering.working\n\nwith ushow do we do things at capital one canada? We listen — to our people, and to our customers. We change with the times and have adopted a hybrid model . A hybrid working model is one that creates the opportunity to match the work that we do to the environment that best supports that work. Associates working in the hybrid model are expected to come into the office 3 days a week across tuesdays and thursdays, reserving mondays and fridays as company-wide virtual days.\n\nAs was true before the pandemic, expectations of being in the office will be balanced with personal life flexibility.at capital one we’re committed to diversity, inclusion and belonging. We strive to build a culture where diverse perspectives are valued, innovative ideas are encouraged and inclusive behaviours are embedded in everything we do to positively impact associates. Strive to build a culture where diverse perspectives are valued, innovative ideas are encouraged and to help challenge the status quo and create the best outcomes for everyone.\n\nCapital one canada is an equal opportunity employer committed to fostering a diverse and inclusive work environment. We consider all qualified applicants and will meet the needs of those requiring reasonable accommodations.",
            "job_is_remote": false,
            "job_posted_at": "3 days ago",
            "job_posted_at_timestamp": 1732406400,
            "job_posted_at_datetime_utc": "2024-11-24T00:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DtbdsyKOxKwbzQMDAAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13108200",
            "job_onet_job_zone": null
        },
        {
            "job_id": "vARLxsg_rL9AJViIAAAAAA==",
            "job_title": "Business analytics Training & Internships",
            "employer_name": "Oeson™",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRndWARhy5pgzsFFFBtOGq2ZbEkbu2uGHJeVO2M&s=0",
            "employer_website": null,
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/business-analytics-training-internships-at-oeson%E2%84%A2-4082854982?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/business-analytics-training-internships-at-oeson%E2%84%A2-4082854982?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "BeBee Canada Meet Opportunities",
                    "apply_link": "https://ca.bebee.com/job/0dec36a7772f0eb209e5c9d689fbfe21?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                }
            ],
            "job_description": "About the Company:\n\nOeson is a leading IT corporation globally recognized for its expertise in providing top-notch IT and Ed-tech services. Specializing in digital marketing, data science, data analytics, business analytics, cyber security, UI-UX design, web development, and app development, we are dedicated to innovation, excellence, and empowering talents worldwide.\n\nJob Summary:\n\nOeson is seeking enthusiastic individuals who are looking to learn with us in the field of Business Analytics while working on live projects internationally. We are not just offering a flexible work environment but also offering to work with people in a global team.\n\nProjects You Will Work On:\n• Visualizing hospital dataset using Excel\n• Analyzing live stock price data for studying company stock behavior\n• Applying EDA techniques in risk analytics for minimizing lending risk\n• Analyzing bike-sharing data and usage patterns\n• Analyzing data from the Indian Premier League (IPL) cricket tournament\n• Communicating data findings and insights\n• Planning for the global release of a movie in 2024 by RSVP Movies\n\nRoles & Responsibilities:\n• Collaborating with data science experts to collect, clean, and analyze extensive datasets\n• Using machine learning and data mining techniques for insights extraction\n• Applying Python for Exploratory Data Analysis (EDA) in real business scenarios\n• Designing scientific tests and optimizing model performance\n• Building machine learning pipelines for diverse use cases\n• Exploring business data, formulating hypotheses, and measuring strategy impacts\n• Developing innovative solutions using modeling technologies\n\nQualifications:\n• Currently pursuing any degree showing commitment to continuous learning\n• Exceptional written and verbal communication skills\n• Ability to work independently and as part of a team\n• Adaptability and strong teamwork capabilities\n\nNote:\n\nThis position is part of our unpaid. Upon application, our team will contact you to proceed with the application details and joining process.\n\nLocation:\n\nRemote, Canada\n\nContact:\n\nTo explore the exciting world of Business Analytics with us, please contact us here.",
            "job_is_remote": false,
            "job_posted_at": "1 day ago",
            "job_posted_at_timestamp": 1732579200,
            "job_posted_at_datetime_utc": "2024-11-26T00:00:00.000Z",
            "job_location": "Canada",
            "job_city": null,
            "job_state": null,
            "job_country": "CA",
            "job_latitude": 56.130365999999995,
            "job_longitude": -106.34677099999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DvARLxsg_rL9AJViIAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15119900",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "rldUP8QEnbLPJGiHAAAAAA==",
            "job_title": "Consultant, Internship, (International Campuses) Canada",
            "employer_name": "Boston Consulting Group",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQxMy3OJRSwXcqB_s6dIHtI8zYYudxFVfaOcfGQ&s=0",
            "employer_website": null,
            "job_publisher": "Boston Consulting Group",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://careers.bcg.com/global/en/job/36339/Consultant-Internship-International-Campuses-Canada?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Boston Consulting Group",
                    "apply_link": "https://careers.bcg.com/global/en/job/36339/Consultant-Internship-International-Campuses-Canada?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Eluta.ca",
                    "apply_link": "https://www.eluta.ca/spl/consultant-internship-canadian-campuses-canada-1f5bb38c7a0c068dea9589199428ebfa?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/consultant-internship-international-campuses-canada-at-boston-consulting-group-bcg-4075862563?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Ca.bebee.com",
                    "apply_link": "https://ca.bebee.com/job/734f4ffb5e395545dd9779fa80d17a72?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobs Trabajo.org",
                    "apply_link": "https://ca.trabajo.org/job-850-1592e8cd82a260e07d5697202f3df7c7?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Who We Are\n• **To submit an application in French, please go to your settings at the top of the page and select French as your language preference. This will enable you to view the portal and application questions in French.***\n• **Pour soumettre une candidature en français, veuillez accéder à vos paramètres en haut de la page et sélectionner le français comme langue de préférence. Cela vous permettra de consulter le portail et les questions relatives à la candidature en français.***\n\nWe seek people with drive, energy, first-rate minds, and ability to lead and persuade. In selecting people to join the firm, we carry out an intensive interviewing process. Candidates should demonstrate success in their academic and extracurricular activities, whether that be through volunteer work, professional experiences, or through personal initiatives. Compensation for associates entering the firm is extremely competitive and grows rapidly with strong performance.\n\nEligibility\nWe are interested in meeting MBA and Advanced Degree Candidate students (PhD, MD, JD, Post-docs) from Canadian schools scheduled to graduate in 2026 who are available for an internship during the summer of 2025.\n\nLanguage of work for positions permanently located in Quebec\nKnowledge of French is required for positions permanently located in Quebec so incumbents can communicate with their colleagues and suppliers in Quebec as necessary. French-language training is offered to all incumbents in permanent positions in Quebec who do not have a good knowledge of French.\n\nOther language requirement\nFluent English is required for this position in order to communicate with clients, partners and colleagues, who are predominantly located outside Quebec.\n\nHow to Apply\n\nCandidates interested in applying must submit an application including a cover letter, resume and most recent unofficial transcript. All required documents should be uploaded in one single file without password protection. Additional documents may be added to the \"My Profile\" tab at any time in the section titled \"Resumes and Other Documents\"\n\nBoston Consulting Group (BCG) is a global management consulting firm and the world’s leading advisor on business strategy. We partner with clients from the private, public, and not-for-profit sectors in all regions to identify their highest-value opportunities, address their most critical challenges, and transform their enterprises. Our customized approach combines deep insight into the dynamics of companies and markets with close collaboration at all levels of the client organization. This ensures that our clients achieve sustainable competitive advantage, build more capable organizations, and secure lasting results. Founded in 1963, BCG is a private company with offices in more than 90 cities in 50 countries. For more information, please visit bcg.com.\n\nBCG’s clients are the world’s top business leaders. From computers to retailing, our professional expertise spans over 50 industries. The vast majority of our clients rank among the 500 largest companies in each of our three major regions–Americas (North and South), Europe Middle East and Africa, and Asia Pacific. Additionally, we work with a number of small- to medium-sized companies, both public and private.\n\nThe success of our assignments routinely leads our clients to maintain long-term relationships with us. Over 85 percent of our revenues come from clients who continue to work with us from one year to the next to maintain the momentum for change and to continually improve bottom-line results they have achieved with our help.\n\nWe pride ourselves on our fresh thinking. Our evolving ideas profoundly change the way most businesses think about competition. Many leading business concepts over the past three decades originated with BCG–including, experience curve, time-based competition, Segment-of-One® marketing, deconstruction, and trading up. Our recent Collateral Damage publication series has addressed the implications for managers of the on-going financial crisis.\n\nWe believe that no other consulting organization has concentrated as thoroughly on understanding business competition and helping companies make the changes necessary to succeed in increasingly competitive markets.\n\n---------------------------------------------------------------------------------\n\nNous recherchons des personnes ambitieuses, énergiques, avec de la capacité intellectuelle à mener au bout des projets et à persuader. En choisissant des personnes à se joindre à l'entreprise, nous procédons à un processus intensif d'entrevue.\n\nLes candidats doivent démontrer leur succès dans leurs activités universitaires ou parascolaires, que ce soit par un travail bénévole, des stages professionnels ou encore des initiatives personnelles. La rémunération pour les analystes qui se joignent à l'entreprise est extrêmement concurrentielle et augmente rapidement en fonction de performance.\n\nCritères d'admissibilité\nNous souhaitons rencontrer des étudiants en MBA et des candidats à un diplôme d'études supérieures (PhD, MD, JD, Post-docs) d'écoles canadiennes qui devraient obtenir leur diplôme en 2026 et qui sont disponibles pour un stage au cours de l'été 2025.\n\nLangue de travail pour les postes situés en permanence au Québec\nLa connaissance du français est requise pour les postes situés en permanence au Québec afin que le titulaire puisse communiquer au besoin avec ses collègues et les fournisseurs au Québec. Une formation en français est offerte à tout titulaire d’un poste permanent au Québec qui ne possède pas une bonne connaissance du français.\n\nAutre exigence linguistique\nLa maîtrise de l’anglais est requise pour ce poste afin de pouvoir communiquer avec les clients, partenaires et collègues qui sont majoritairement situés à l’extérieur du Québec.\n\nComment postuler?\n\nLes candidats intéressés à postuler un poste d'analyste à l'un de nos bureaux canadiens du BCG doivent soumettre une demande, qui consiste en une lettre de présentation, un curriculum vitae, et un relevé de notes le plus récent, en remplissant une candidature en ligne.\n\nLa réputation mondiale du cabinet de conseil en gestion Boston Consulting Group (BCG), comme l'un des meilleurs en gestion, découle de plus de cinquante années d'expérience à aider les cadres supérieurs à découvrir et réaliser tout le potentiel de leur entreprise. Notre mission consiste à appuyer nos clients à réaliser des avantages concurrentiels durables en offrant des solutions personnalisées. Nous croyons fermement qu'il faut travailler avec nos clients, pas à leurs dépens. Nous collaborons avec chaque client pour l'aider à prendre une direction et à faire face aux défis organisationnels et opérationnels.\n\nFondé en 1963, BCG compte maintenant plus de 11,000 experts-conseils, et ce, dans plus de 90 bureaux dans le monde entier. Les clients du BCG sont les dirigeants des plus importantes entreprises du monde. Des ordinateurs jusqu'à la vente au détail, notre expertise professionnelle s'étend à plus de 50 industries. La grande majorité de nos clients figurent parmi les 500 plus grandes entreprises dans chacune de nos trois régions principales – Les Amériques (nord et sud), l'Europe (incluant le Moyen-Orient et l'Afrique) et l'Asie-Pacifique. De plus, nous travaillons avec un certain nombre de petites et moyennes entreprises, tant publiques que privées.\n\nNotre succès, provenant des mandats qui nous sont assignés, nous permet d'établir des relations à long terme avec nos clients. Plus de 85 pourcents de nos revenus proviennent de clients qui continuent à travailler avec nous d'une année à l'autre pour conserver l'élan de changement et pour améliorer continuellement les résultats nets qu'ils ont réalisés grâce à notre aide.\n\nNous sommes fiers de notre approche innovatrice. Nos idées évolutives changent profondément la manière dont la plupart des entreprises considèrent la concurrence. Plusieurs des principaux concepts d'affaires, au cours des trois dernières décennies, ont commencé avec BCG, y compris la courbe d'apprentissage, la concurrence calculée sur le temps, le marketing Segment-of-One®, le démantèlement et l'extension ascendante. Nos récentes publications de la série Collateral Damage ont traité de l'implication des dirigeants face à la crise financière en cours.\n\nNous croyons qu'aucune autre organisation de conseil en gestion ne s'est concentrée aussi attentivement à la compréhension de la concurrence en affaires et à aider les entreprises à effectuer les changements nécessaires pour réussir sur des marchés de plus en plus compétitifs.\n\n--------------------------------------------------------------------\n• #L\n\nBoston Consulting Group is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, age, religion, sex, sexual orientation, gender identity / expression, national origin, disability, protected veteran status, or any other characteristic protected under national, provincial, or local law, where applicable, and those with criminal histories will be considered in a manner consistent with applicable state and local laws.\n\nBCG is an E - Verify Employer. Click here for more information on E-Verify.",
            "job_is_remote": false,
            "job_posted_at": "15 hours ago",
            "job_posted_at_timestamp": 1732665600,
            "job_posted_at_datetime_utc": "2024-11-27T00:00:00.000Z",
            "job_location": "Calgary, AB",
            "job_city": "Calgary",
            "job_state": "Alberta",
            "job_country": "CA",
            "job_latitude": 51.044733099999995,
            "job_longitude": -114.0718831,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DrldUP8QEnbLPJGiHAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "21101200",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "p4YTjrEuiwe2O1ZQAAAAAA==",
            "job_title": "Summer 2024 Co-op - Technical Writer (Technical Publications Team)",
            "employer_name": "Lockheed Martin Canada",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSPyZZMabgH5mUkubPWYKJqz_hISfHI0AC3Kh1H&s=0",
            "employer_website": "https://www.lockheedmartin.com",
            "job_publisher": "Jobs.ca",
            "job_employment_type": null,
            "job_employment_types": [],
            "job_apply_link": "https://www.jobs.ca/offer/summer-2024-co-op-technical-writer-technical-publications-team/56317122-5633-4eac-b2f2-30e488032f65_en/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Jobs.ca",
                    "apply_link": "https://www.jobs.ca/offer/summer-2024-co-op-technical-writer-technical-publications-team/56317122-5633-4eac-b2f2-30e488032f65_en/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Summerjobs.ca",
                    "apply_link": "https://www.summerjobs.ca/offer/on/ottawa/summer-2024-co-op-technical-writer-technical-publications-team/56317122-5633-4eac-b2f2-30e488032f65_en/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "About the role\n\nThe candidate will join the Technical Publications team as a technical writer supporting all of the different programs within Lockheed Martin Canada (LMCa) and responsible for developing technical documentation in collaboration with other team members and members of other groups within LMCa, including Graphic Design, Integrated Logistics Support, and Engineering.\n\nThe candidate will participate in technical publication activities including, but not limited to:\n• Authoring procedures and maintenance documentation for inclusion into various technical documents.\n• Performing impact analyses to assess the ramifications of change requests to existing documentation and incorporating changes as necessary.\n• Performing data conversion tasks to structure legacy data in Lockheed Martin structured XML format.\n• Collaborating with team members to improve internal processes and documenting any changes.\n\nWhat you bring to the role\n• Pursuing a degree or diploma in a technical field (engineering, computer science etc.) or in technical writing or technical communication.\n• Understanding of basic technical writing rules and style.\n• Ability to work productively in both an individual and team environment.\n• Ability to comfortably write clear and concise instructions in English.\n• Eligibility for NATO Secret clearance\n\nAdditional skills desired for the role\n• Familiar with XML and software used for XML authoring.\n• Comfortable reading engineering drawings, bill of materials, test specifications etc.\n• Comfortable adapting to new software and learning new processes.\n• Ability to adapt to changing priorities.\n• Communicate effectively with technical and non-technical members of the team.\n\nWhat we offer you\n\nWe walk our talk when it comes to work/life balance! Your physical, mental and financial wellbeing matters to us. On top of working in a highly supportive, friendly, respectful environment, this is what you can expect when you join our team as a Regular Full-Time employee:\n• Flexible, compressed work schedules, depending on business requirements, where you have the option of Fridays off, as well as the possibility to work remote part-time\n• Competitive compensation\n• Time to recharge with vacation, personal days, holidays, and parental leaves\n• Comprehensive Family Medical, Dental and Vision coverage available on your first day of employment, along with:\n• Virtual Health Care (24/7 access to medical professionals)\n• A Wellness Spending Account to aid in your wellness journey\n• Employee & Family Assistance Program (EFAP) which includes free face to face counselling sessions\n• Medical Travel Insurance\n• Onsite fitness facilities at our main office locations\n• A Registered Retirement Savings Plan that includes matching company contributions on your first day of employment, that also includes access to Financial Advisors providing investment advice and comprehensive financial planning\n• Employee discounts to save on goods, services and various recreational activities\n• Access to a robust spectrum of development resources to enhance your skills and/or advance your career including:\n• Free learning resources through a modern and engaging platform\n• Education Assistance Program\n• Reimbursement for a professional membership\n• Self-directed Mentoring\n\nAbout us\n\nLockheed Martin Canada is the Canadian-based arm of Lockheed Martin Corporation, a global security and aerospace company employing 115,000 people worldwide, including more than 1,300 Canadians. By applying innovative approaches of our highly skilled and experienced Canadian workforce, we have been Canada's trusted defence and aerospace partner for over 80 years. We operate major facilities in Ottawa, Montreal, Halifax, Calgary and Victoria and work on a wide range of programs from advanced naval technology products and unmanned systems software to providing delivery and in-service support of the latest military aircraft to commercial engine repair and overhaul capabilities. This position is part of the Rotary and Mission Systems business area, where employees across Canada support engineering, systems integration, training, sustainment and in-service support programs for Canadian and international military customers across land, air and sea.",
            "job_is_remote": false,
            "job_posted_at": "2 days ago",
            "job_posted_at_timestamp": 1732492800,
            "job_posted_at_datetime_utc": "2024-11-25T00:00:00.000Z",
            "job_location": "Ottawa, ON",
            "job_city": "Ottawa",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 45.420057199999995,
            "job_longitude": -75.7003397,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dp4YTjrEuiwe2O1ZQAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "27304200",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "j0nmzX_OKH2-ZzbAAAAAAA==",
            "job_title": "Summer Sales Intern",
            "employer_name": "Aruza Marketing LLC",
            "employer_logo": null,
            "employer_website": null,
            "job_publisher": "Learn4Good",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://www.learn4good.com/jobs/vancouver/canada/sales/3766875408/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Learn4Good",
                    "apply_link": "https://www.learn4good.com/jobs/vancouver/canada/sales/3766875408/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Position: Summer Sales Intern 2024\nThe Aruza Marketing Internship provides individuals the opportunity to learn vital skills in sales, persuasion, work ethic, and professional communication. Upon completion of the internship you will be able to bolster your resume with experiences and tangible numbers you’ve produced over the summer as well as demonstrate the skills you’ve learned when step into your careers. Get a jumpstart in your future careers today!\n\nInternship Job Expectation:\n• Develop, refine, and enhance sales skills in order to produce revenue\n• Promote like-minded success through friendly competition and growth mindsets\n• Remain coachable and share ideas to strengthen your team\n• Engages with customers or clients and provides service and/or sales.\n• Provide suggestions to teams for improving customer service and internal processes.\n• Successfully demonstrate skills learned to reach higher tiers of success\n• Effectively use technology provided to streamline efficiency.\n\nEarnings and Benefits\n• Base pay of $3,600\n• Average First Year Intern earns $10,000-$15,000 in commission (Realistic opportunity to make more)\n• Average returning intern improves commission by 40%\n• Multiple extra bonuses, competitions, and opportunities are available\n• Housing/furniture set up in our markets upon internship offer acceptance\n• Networking Intern Qualifications /\n\nSkills:\n• Verbal communication\n• Organization* Scheduling\n• Professionalism* Customer focus\n\nFor more Information visit",
            "job_is_remote": false,
            "job_posted_at": "3 days ago",
            "job_posted_at_timestamp": 1732406400,
            "job_posted_at_datetime_utc": "2024-11-24T00:00:00.000Z",
            "job_location": "Vancouver, BC",
            "job_city": "Vancouver",
            "job_state": "British Columbia",
            "job_country": "CA",
            "job_latitude": 49.2827291,
            "job_longitude": -123.12073749999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dj0nmzX_OKH2-ZzbAAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": "MONTH",
            "job_highlights": {},
            "job_onet_soc": "55301800",
            "job_onet_job_zone": null
        },
        {
            "job_id": "sZFD-Zecgie-LmPkAAAAAA==",
            "job_title": "Data Science Intern",
            "employer_name": "CONNECTMETA.AI",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTM_C8WErjs2Tvf9SUQCs4VNHySHXuPDs3-zo9i&s=0",
            "employer_website": null,
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/data-science-intern-at-connectmeta-ai-4082883543?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/data-science-intern-at-connectmeta-ai-4082883543?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Karkidi",
                    "apply_link": "https://www.karkidi.com/job-details/40450-data-science-intern-job?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Simplify Jobs",
                    "apply_link": "https://simplify.jobs/p/44b76292-ef7e-4dbb-aa99-d79a75573d89/Data-Science-Intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobdash.ca",
                    "apply_link": "https://jobdash.ca/job/data-science-intern-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                }
            ],
            "job_description": "About the Company: Oeson is a leading IT corporation globally recognized for its expertise in providing top-notch IT and Ed-tech services. Specializing in digital marketing, data science, data analytics, UI-UX design, web development, and app development, we are dedicated to innovation, excellence, and empowering talents worldwide.\n\nLearn More: www.oesonlearning.com\n\nJob Summary:\n\nOeson is seeking enthusiastic individuals who are looking to learn with us in the field of Data Science while working on live projects internationally. We are not just offering a flexible work environment but also offering to work with people in a global team.\n\nProjects You Will Work On:\n\n- Finance Fraud Detection: Develop advanced fraud detection algorithms leveraging financial data analysis.\n\n- Recommender System: Contribute to personalized recommendation systems, enhancing user experiences across platforms.\n\n- Sentiment Analysis: Explore sentiment analysis to extract insights from textual data, shaping user sentiment understanding.\n\n- Chatbots: Engage in intelligent chatbot development, revolutionizing customer interactions and support.\n\n- Image/Audio Video Classification: Push boundaries with multimedia technology by working on image and audio video classification projects.\n\n- Text Analysis: Uncover hidden patterns in textual data through sophisticated text analysis techniques.\n\nRoles & Responsibilities:\n\n- Collaborate with our esteemed data science experts to collect, clean, and analyze extensive datasets, honing skills in data preprocessing and visualization.\n\n- Contribute to the development of predictive models and algorithms, employing cutting-edge machine learning techniques to solve real-world challenges.\n\n- Work closely with team members to design, implement, and evaluate experiments, fostering a collaborative and innovative environment.\n\n- Stay updated with the latest industry trends and best practices in data science, applying newfound knowledge to enhance project outcomes.\n\nQualifications:\n\n- Currently pursuing any degree showcasing a strong commitment to continuous learning and professional growth.\n\n- Exceptional written and verbal communication skills, vital for effective collaboration and articulation of complex ideas.\n\n- Demonstrated ability to work both independently and as part of a cohesive team, highlighting adaptability and strong teamwork capabilities.\n\nNote:\n\nThis position is unpaid. After submitting your application, our team will contact you to proceed with the application details and joining process.\n\nLocation: British Columbia, Canada",
            "job_is_remote": false,
            "job_posted_at": "23 hours ago",
            "job_posted_at_timestamp": 1732636800,
            "job_posted_at_datetime_utc": "2024-11-26T16:00:00.000Z",
            "job_location": "Canada",
            "job_city": null,
            "job_state": null,
            "job_country": "CA",
            "job_latitude": 56.130365999999995,
            "job_longitude": -106.34677099999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DsZFD-Zecgie-LmPkAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "KqIsyVPrZuo7OJGjAAAAAA==",
            "job_title": "Information Systems Intern",
            "employer_name": "Hexagon's Autonomy & Positioning division",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS-JdM0jsd_uJKHI1Ak6msJYxlA4Sh4jLhZHouh&s=0",
            "employer_website": "https://hexagon.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/information-systems-intern-at-hexagon-s-autonomy-positioning-division-4082622406?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/information-systems-intern-at-hexagon-s-autonomy-positioning-division-4082622406?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://emplois.ca.indeed.com/viewjob?jk=eaf351fbfa113bc3&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/Hexagon/Job/Information-Systems-Intern/-in-Calgary,AB?jid=cfdacb048673f3a3&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "NovAtel | Careers Center",
                    "apply_link": "https://careers-hexagonpositioning.icims.com/jobs/2701/information-systems-intern/job?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "Monster.ca",
                    "apply_link": "https://www.monster.ca/job-openings/information-systems-intern-calgary-ab--c1bc2cf2-a5ff-4953-b317-097556d0664f?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/information-systems-intern-hexagon-JV_IC2275123_KO0,26_KE27,34.htm?jl=1009541075665&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Talentify",
                    "apply_link": "https://www.talentify.io/job/information-systems-intern-calgary-alberta-ca-hexagon-autonomy-positioning-2701?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Salary.com",
                    "apply_link": "https://www.salary.com/ca-job/hexagon/information-systems-intern/j202411261855082066208?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Overview\n\nHexagon's Autonomy & Positioning division, is looking for an Information Systems Intern to join our high-tech engineering and manufacturing company for the period of January 06, 2025 to December 31 2025. To support our focus on delivering high quality products, we are looking for an enthusiastic internship student to add to our Information Services team. This role will give you an opportunity to work on exciting projects. By working with world-leading experts you will gain valuable experience working with a technology leader on some of our most exciting IT projects.\n\nThe Location: Hexagon is a global company with locations around the world. This position is based onsite in Calgary, AB.\n\nResponsibilities\n\nAs a Information Systems Intern, your responsibilities may include:\n• Working with the different Information systems teams with the focus on improving the operational efficiency of the network team.\n• Auditing and documenting existing system to help identify key areas for improvement.\n• Following the direction of the analysts, implementation of key improvements to the network, infrastructure, applications, or other services\n• Identifying improvement oppurtunities and using your skills to make a difference.\n\nLastly, as the knowledge of the Intern improves on the Hexagon systems, they will help on the day-to-day operations of the team by triaging queue tickets and where possible resolving those tickets.\n\nQualifications\n\nMust-Have:\n• Registered in an Engineering or Information technology Internship/Co-op program and have completed at least your 2 nd or 3 rd year of studies by the start of your work term\n• Available for a minimum 12 month work term\n• Strong academic credentials\n• Strong communication skills, both oral and written\n\nKey Success Factors:\n• Able to work in a collaborative team environment\n• Confident Self-starter\n• Detail oriented person able to follow complex instructions with a “first-time right” attitude\n• Motivated by challenging work\n• You are comfortable working individually but know when to ask for help\n\nNice-to-Have:\n• Networking, Server, Desktop Support, Application support practical experince\n• Server operating system experince\n• ITIL training\n\nNot sure if you meet all the qualifications for this role? Let us decide! At Hexagon, we are committed to a diverse and inclusive work environment. If you’re excited about the opportunities this role could bring, we encourage you to apply. For any questions about the role or our company, please email our team at hrrecruitingteam.ap@hexagon.com and we will be pleased to follow up with you. Please do not send cover letters or resumes to this address.\n\nThe Company: Hexagon is a global leader in digital reality solutions, combining sensor, software, and autonomous technologies. We are putting data to work to boost efficiency, productivity, quality, and safety across industrial, manufacturing, infrastructure, public sector, and mobility applications. You’ll be joining over 24,000 people in 50 countries on the leading edge of your field.\n\nThis position is with Hexagon’s Autonomy & Positioning division, a global technology leader, pioneering end-to-end solutions for assured positioning and autonomy on land, sea, and air. Our work touches every aspect of life, from sustainability on Earth to enabling autonomy. Within the Autonomy & Positioning division your work will contribute to the operation of our brands NovAtel, AutonomouStuff, Veripos, and Antcom. Come see why we are recognized as one of Alberta's Top 75 Employers!\n\nApplicants who require accommodation in the job application process may contact Human Resources at hrrecruitingteam.ap@hexagon.com .",
            "job_is_remote": false,
            "job_posted_at": "2 days ago",
            "job_posted_at_timestamp": 1732492800,
            "job_posted_at_datetime_utc": "2024-11-25T00:00:00.000Z",
            "job_location": "Calgary, AB",
            "job_city": "Calgary",
            "job_state": "Alberta",
            "job_country": "CA",
            "job_latitude": 51.044733099999995,
            "job_longitude": -114.0718831,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DKqIsyVPrZuo7OJGjAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "19309200",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "1767pvG8blAGTQ35AAAAAA==",
            "job_title": "Logistics intern",
            "employer_name": "Schneider Electric",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQejGRgi4fket7ZACb_iCoxET4yEOT3v5Vj_pYz&s=0",
            "employer_website": null,
            "job_publisher": "LinkedIn",
            "job_employment_type": null,
            "job_employment_types": [],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/logistics-intern-at-schneider-electric-4083768433?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/logistics-intern-at-schneider-electric-4083768433?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "The Muse",
                    "apply_link": "https://www.themuse.com/jobs/schneiderelectric/logistics-intern-e37668?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/logistics-intern-schneider-electric-JV_IC2274961_KO0,16_KE17,35.htm?jl=1009542463718&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "EQuest Jobs",
                    "apply_link": "https://jobs.equest.com/jobs/AB/schneider-electric/logistics-intern-372993066.html?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/XaoFYnQrzrEKqOdDDXJPX2E5rvhy-uetHK38ZBoO99UjzPau85KA2g?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "What will you do?\n\nThe primary objective of the Logistics intern is to support the transformation of warehouse operations by redefining and implementing efficient processes. Specific duties include:\n• Assisting the logistics team with daily operational requirements.\n• Designing the new racking architecture within SAP.\n• Redefining the picking roads to optimize efficiency.\n• Enhancing the Kanban parts strategy for improved inventory management.\n\nWhat qualifications will make you successful for this role?\n• Currently enrolled student or recent graduate in Supply Chain Management, Business Administration, or a related field.\n• Good understanding of inventory management principles.\n• Knowledge of logistics flow and replenishment strategies.\n• Excellent analytical and problem-solving skills.\n\nLet us learn about you! Apply today.\n\nYou must submit an online application to be considered for any position with us. This position will be posted until filled.\n\n#intern\n\nLooking to make an IMPACT with your career?\n\nWhen you are thinking about joining a new team, culture matters. At Schneider Electric, our values and behaviors are the foundation for creating a great culture to support business success. We believe that our IMPACT values - Inclusion, Mastery, Purpose, Action, Curiosity, Teamwork - starts with us.\n\nIMPACT is also your invitation to join Schneider Electric where you can contribute to turning sustainability ambition into actions, no matter what role you play. It is a call to connect your career with the ambition of achieving a more resilient, efficient, and sustainable world.\n\nWe are looking for IMPACT Makers; exceptional people who turn sustainability ambitions into actions at the intersection of automation, electrification, and digitization. We celebrate IMPACT Makers and believe everyone has the potential to be one.\n\nBecome an IMPACT Maker with Schneider Electric - apply today!\n\n€36 billion global revenue\n\n+13% organic growth\n\n150 000+ employees in 100+ countries\n\n#1 on the Global 100 World’s most sustainable corporations\n\nYou must submit an online application to be considered for any position with us. This position will be posted until filled.\n\nSchneider Electric aspires to be the most inclusive and caring company in the world, by providing equitable opportunities to everyone, everywhere, and ensuring all employees feel uniquely valued and safe to contribute their best. We mirror the diversity of the communities in which we operate, and ‘inclusion’ is one of our core values. We believe our differences make us stronger as a company and as individuals and we are committed to championing inclusivity in everything we do. This extends to our Candidates and is embedded in our Hiring Practices.\n\nYou can find out more about our commitment to Diversity, Equity and Inclusion here and our DEI Policy here\n\nAt Schneider Electric, we uphold the highest standards of ethics and compliance, and we believe that trust is a foundational value. Our Trust Charter is our Code of Conduct and demonstrates our commitment to ethics, safety, sustainability, quality and cybersecurity, underpinning every aspect of our business and our willingness to behave and respond respectfully and in good faith to all our stakeholders. You can find out more about our Trust Charter here\n\nSchneider Electric is an Equal Opportunity Employer. It is our policy to provide equal employment and advancement opportunities in the areas of recruiting, hiring, training, transferring, and promoting all qualified individuals regardless of race, religion, color, gender, disability, national origin, ancestry, age, military status, sexual orientation, marital status, or any other legally protected characteristic or conduct.",
            "job_is_remote": false,
            "job_posted_at": "19 hours ago",
            "job_posted_at_timestamp": 1732651200,
            "job_posted_at_datetime_utc": "2024-11-26T20:00:00.000Z",
            "job_location": "Edmonton, AB",
            "job_city": "Edmonton",
            "job_state": "Alberta",
            "job_country": "CA",
            "job_latitude": 53.5460983,
            "job_longitude": -113.49372659999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D1767pvG8blAGTQ35AAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13108100",
            "job_onet_job_zone": "4"
        }
    ]
}