{
    "status": "OK",
    "request_id": "f593d0ba-2a20-4ed8-b4f1-d41a8de52316",
    "parameters": {
        "query": "intern jobs canada",
        "page": 1,
        "num_pages": 3,
        "date_posted": "today",
        "country": "ca",
        "language": "en"
    },
    "data": [
        {
            "job_id": "0BcRuO1KuG7z4vgSAAAAAA==",
            "job_title": "Data Science Study and Internship",
            "employer_name": "Oeson™",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRndWARhy5pgzsFFFBtOGq2ZbEkbu2uGHJeVO2M&s=0",
            "employer_website": null,
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/data-science-study-and-internship-at-oeson%E2%84%A2-4086201123?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/data-science-study-and-internship-at-oeson%E2%84%A2-4086201123?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Adzuna",
                    "apply_link": "https://www.adzuna.ca/details/4898576733?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "About the Company: Oeson is a leading IT corporation globally recognized for its expertise in providing top-notch IT and Ed-tech services. Specializing in digital marketing, data science, data analytics, UI-UX design, web development, and app development, we are dedicated to innovation, excellence, and empowering talents worldwide.\n\nLearn More: www.oesonlearning.com\n\nJob Summary:\n\nOeson is seeking enthusiastic individuals who are looking to learn with us in the field of Data Science while working on live projects internationally. We are not just offering a flexible work environment but also offering to work with people in a global team.\n\nProjects You Will Work On:\n\n- Finance Fraud Detection: Develop advanced fraud detection algorithms leveraging financial data analysis.\n\n- Recommender System: Contribute to personalized recommendation systems, enhancing user experiences across platforms.\n\n- Sentiment Analysis: Explore sentiment analysis to extract insights from textual data, shaping user sentiment understanding.\n\n- Chatbots: Engage in intelligent chatbot development, revolutionizing customer interactions and support.\n\n- Image/Audio Video Classification: Push boundaries with multimedia technology by working on image and audio video classification projects.\n\n- Text Analysis: Uncover hidden patterns in textual data through sophisticated text analysis techniques.\n\nRoles & Responsibilities:\n\n- Collaborate with our esteemed data science experts to collect, clean, and analyze extensive datasets, honing skills in data preprocessing and visualization.\n\n- Contribute to the development of predictive models and algorithms, employing cutting-edge machine learning techniques to solve real-world challenges.\n\n- Work closely with team members to design, implement, and evaluate experiments, fostering a collaborative and innovative environment.\n\n- Stay updated with the latest industry trends and best practices in data science, applying newfound knowledge to enhance project outcomes.\n\nQualifications:\n\n- Currently pursuing any degree showcasing a strong commitment to continuous learning and professional growth.\n\n- Exceptional written and verbal communication skills, vital for effective collaboration and articulation of complex ideas.\n\n- Demonstrated ability to work both independently and as part of a cohesive team, highlighting adaptability and strong teamwork capabilities.\n\nNote:\n\nThis position is unpaid. After submitting your application, our team will contact you to proceed with the application details and joining process. You can write to us on arati.chauhan@oeson.in\n\nLocation:\n\nREMOTE, MANITOBA,CANADA",
            "job_is_remote": false,
            "job_posted_at": "7 hours ago",
            "job_posted_at_timestamp": 1732834800,
            "job_posted_at_datetime_utc": "2024-11-28T23:00:00.000Z",
            "job_location": "Canada",
            "job_city": null,
            "job_state": null,
            "job_country": "CA",
            "job_latitude": 56.130365999999995,
            "job_longitude": -106.34677099999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D0BcRuO1KuG7z4vgSAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15204100",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "oUd5r09j7RRIrUY4AAAAAA==",
            "job_title": "Experiential Education Ambassador/Coordinator (Internship/ Coop)",
            "employer_name": "Proof Experiences",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSR9SDlwKcvA8L9AinY-Zxxu6z0ghfOOtB9XJSY&s=0",
            "employer_website": "https://www.proofexperiences.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/experiential-education-ambassador-coordinator-internship-coop-at-proof-experiences-4085944830?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/experiential-education-ambassador-coordinator-internship-coop-at-proof-experiences-4085944830?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Role Overview\n\nDo you have a passion for the creation and management of stand-out events? Are you someone who would love to travel across different cities to educate the youth on important issues? Proof Experiences is looking for a co-op/intern student to join our team as an intern for our Educational Marketing department!\n\nThis position requires for you to be both on-site and in-office working, overseeing, and assisting with the successful execution of a variety of virtual and in person educational programs targeted towards the youth all over Canada. A large portion of this internship will include travelling as a Tour Leader for educational programs that may span across the country, helping lead a team of brand ambassadors successfully promote positive messages throughout schools and busy areas.\n\nWorking with Proof Experiences will provide you with a well-rounded understanding of program management and experiential event marketing in a fast-paced environment: motivated, self-starters thrive in this industry!\n\nWhat you’ll do:\n\n• Work with various in-office teams as assigned on program logistics e.g. Assisting with execution of activity, moderation of presentations, tour management, sourcing based on specified budgets\n\n• Provide onsite support for events to assist with onsite responsibilities as well as virtual tech support.\n\n• Travel as a Tour Leader to educational activations, acting as front-line program representative and liaison in-field\n\n• Assist with program set-up, event execution, tear-down and post-event reporting\n\n• General office administration such as assisting with the scheduling, note-taking, and note distribution for client planning meetings as required\n\n• Assist in program meetings, strategic planning, event execution and reporting\n\n• Collaborate with senior team members and work independently\n\n• Flexibility to travel locally as required\n\nWho you are:\n\n• Asset for you to be fluent in French and English\n\n• You are prepared for local travel and some weekend work\n\n• You are a people person!\n\n• You have great project management and relationship building skills\n\n• You are comfortable working with the youth and schools across Canada\n\n• You have an ability to manage a multitude of tasks, deadlines and clients\n\n• You are detail-oriented and take pride in the presentation and accuracy of your work\n\n• You are resourceful / problem solver\n\n• You are well organized, detail oriented and proficient in Microsoft Office (Word, Excel, Power Point & Outlook)\n\n• You are responsible for program outreach and tour management\n\n• You show strong communication skills; both oral and written\n\n• You have an ability to work in a collaborative work environment through enthusiasm, support and open communication\n\n• You embody and respect our values of excellence, collaboration, integrity, commitment, empathy and trust!\n\nWhat you’ve done:\n\nThe successful candidate will possess the following qualifications:\n\n• Currently enrolled or recently graduated hospitality, marketing, event management program or post-graduate program\n\n• Posess an Ontario G-class drivers license. Asset to be over 21 to rent vehicles\n\nSalary and Requirements:\n\nThis position runs for 4 months, from January to April (can be adjusted slightly). You are expected to work 40+ hours/ week (hours will vary dependent on program needs) and will be paid a salary of $800/week.\n\nAbout Proof Experiences:\n\nProof Experiences is committed to designing and executing insights-led and measurement-based brand experiences that deliver results. We strongly believe our people are the drivers of our success and we work hard every day to create an inspiring and engaging work culture. We have a reputation for fostering professional development, collaboration and pride in everything we do.\n\nProof Experiences is an equal opportunity employer dedicated to equity, diversity and inclusion in the workplace and encourages applications from all qualified applicants. If you require any accommodation during the recruitment process, please reach out to us.",
            "job_is_remote": false,
            "job_posted_at": "14 hours ago",
            "job_posted_at_timestamp": 1732809600,
            "job_posted_at_datetime_utc": "2024-11-28T16:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DoUd5r09j7RRIrUY4AAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "55301800",
            "job_onet_job_zone": null
        },
        {
            "job_id": "Gpnp-iyS8JaSS1WwAAAAAA==",
            "job_title": "Engineering Intern",
            "employer_name": "Rockwell Automation",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSyjq0EbVhY1Q21CI-ku8Zm2OYGp7u7Pu-JnwV2&s=0",
            "employer_website": "https://www.rockwellautomation.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/engineering-intern-at-rockwell-automation-4087531795?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/engineering-intern-at-rockwell-automation-4087531795?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Rockwell Automation is a global technology leader focused on helping the world’s manufacturers be more productive, sustainable, and agile. With more than 28,000 employees who make the world better every day, we know we have something special. Behind our customers - amazing companies that help feed the world, provide life-saving medicine on a global scale, and focus on clean water and green mobility - our people are energized problem solvers that take pride in how the work we do changes the world for the better.\n\nWe welcome all makers, forward thinkers, and problem solvers who are looking for a place to do their best work. And if that’s you we would love to have you join us!\n\nJob Description\n\nJob Description\n\nRole Intern\n\nMode of Work Hybrid\n\nWork location Noida\n\nStipend INR 30,000 only\n\nJob Description Summary\n\nCollege student performing work in project-oriented position related to your academic programme in Engineering.\n\nControl Systems Engineer Intern for industrial automation projects based on PLC, DCS and HMI design and programming. You will work under the direction of an experienced lead / senior engineer in the design, specification, programming, simulation, and testing, of control and electrical systems. The Control Systems Engineer Intern will be involved in all stages of a project, from its design and conception through its development and commissioning support.\n\nJob Assignment\n• Control system design and programming\n• Control panel design\n• Development of Bill of Material (BOM)\n• PLC / DCS programming\n• HMI programming\n• Communication network design\n• System documentation and manual creation\n• Documentation and testing new software applications.\n• Assess new application ideas\n\nSkills, Experience And Education (SKEE)\n• Pursuing Full time bachelor's degree (preferably in 7th or 8th Sem) in Core engineering branches like Electrical / Instrumentation & Control / Electronics & Communication.\n• Good knowledge of core subjects with basic knowledge of programming languages e.g. C, C++ etc.\n\nBenefits\n\nThe ability to collaborate with, learn from colleagues in a complex, global organization.\n\nWe provide a working environment with a creative company, paired with a great compensation package, great benefits, and a supportive atmosphere where you can sharpen with new challenges and development opportunities.\n\nHybrid work-from-home and at a determined Rockwell Automation facility.\n\nCorporate Social Responsibility opportunities,\n\nSupport from our 24/7 employee assistance program.\n\nReporting will to Technical Lead.\n\nPrimary work location Noida, India.\n\nWe are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender, gender identity or expression, or veteran status. We are proud to be an equal opportunity workplace.\n\nAt Rockwell Automation we are dedicated to building a diverse, inclusive and authentic workplace, so if you're excited about this role but your experience doesn't align perfectly with every qualification in the job description, we encourage you to apply anyway. You may be just the right person for this or other roles.\n\nRockwell Automation’s hybrid policy aligns that employees are expected to work at a Rockwell location at least Mondays, Tuesdays, and Thursdays unless they have a business obligation out of the office.",
            "job_is_remote": false,
            "job_posted_at": "10 hours ago",
            "job_posted_at_timestamp": 1732824000,
            "job_posted_at_datetime_utc": "2024-11-28T20:00:00.000Z",
            "job_location": "Delhi, ON",
            "job_city": "Delhi",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 42.8538534,
            "job_longitude": -80.4936577,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DGpnp-iyS8JaSS1WwAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "53601100",
            "job_onet_job_zone": "1"
        },
        {
            "job_id": "4NyYJnxWAu10VPQbAAAAAA==",
            "job_title": "Human Resources Internship",
            "employer_name": "Canyon Entertainment Group",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRx_PhL88L69Z0sa0s2yDJmPcStNsjyF3TUhVMp&s=0",
            "employer_website": "https://canyonentertainmentgroup.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/human-resources-internship-at-canyon-entertainment-group-4087599987?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/human-resources-internship-at-canyon-entertainment-group-4087599987?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Human Resources Internship\n\nDo you like to jump in and 'get the job done'? Tasks may include processing applicants, onboarding, tracking projects, processing contracts and more, all while keeping everything organized through the discipline of project management.\n\nAre you interested in turning our vision into reality? All of these projects are well-formed and just need a go-getter to 'make them happen'.\n\nGeneral Purpose: Preparation of materials and completion of specific projects while ensuring consistency with company strategy, commitments and goals. The intern will learn best practices in recruiting, human resources management, interviewing and general project management from experienced staff.\n\nOnce your application is received and reviewed, we will be in contact with you, and you may start immediately! Overall, you would get lots of experience in music industry work, e.g., performances and other promotional activity for any number of our artists. The sky's the limit -- let us know what you would like to learn -- it ALL needs to get done!\n\nREQUIREMENTS\n\nSome of the tasks that you might get to do while working on your project may include:\n• Recruiting\n• Human resources management\n• Interviewing\n• Manage projects and help coordinate staff\n• Assign and monitor work progress\n• Outreach to prospective recruits\n• Understanding all relevant guidelines and industry requirements\n• Planning group activities and/or meetings\n• Organizing deliverables and coordinating team members\n• Writing, editing, and sending out communications, project tracking sheets, etc.\n• Keeping all constituents informed and up-to-date on all activities\n• Conducting research and/or reviewing materials to understand various tools, systems and processes\n• Developing Standard Operating Procedures based on current and new methodologies\n• Database updates\n• Conduct pre- and post-evaluations and report on outcomes\n\nCandidate should possess:\n• Currently enrolled in College or University in the fields of human resources, project/product management, English or related fields\n• Strong organizational skills\n• Proficiency in Microsoft Office, basic database knowledge\n• Knowledge of project management techniques and tools\n\nCandidates should have the following key competencies:\n• Critical thinking and problem-solving skills\n• Planning and organizing\n• Attention to detail\n• Decision-making\n• Communication skills\n• Teamwork\n• Adaptability\n• Writing, proofreading and editing\n\nPlease note:\n• This training is similar to that which is provided in a vocational school\n• This training is for the benefit of you personally, to develop your skills, resume, etc.\n• Your training supervisor will ensure that the activities you work on benefit you while you are being trained\n• This position is only for learning purposes and does not displace any employees in this company; additionally, it is not an opportunity to become an employee of this company\n• This is an UNPAID internship to support the individual in obtaining a university/college credit\n\nJob Type: Internship\n\nBenefits:\n• Casual dress\n• Flexible schedule\n• Work from home\n\nCOVID-19 considerations: The majority is remote work. When in-person, it is at your option, and COVID guidelines are in place.\n\nCOVID-19 precaution(s):\n• Remote interview process\n• Virtual meetings",
            "job_is_remote": false,
            "job_posted_at": "2 hours ago",
            "job_posted_at_timestamp": 1732852800,
            "job_posted_at_datetime_utc": "2024-11-29T04:00:00.000Z",
            "job_location": "Canada",
            "job_city": null,
            "job_state": null,
            "job_country": "CA",
            "job_latitude": 56.130365999999995,
            "job_longitude": -106.34677099999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D4NyYJnxWAu10VPQbAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "43416100",
            "job_onet_job_zone": "3"
        },
        {
            "job_id": "L-b32I1Zhm5WPWjeAAAAAA==",
            "job_title": "Engineering Community Intern",
            "employer_name": "Thales",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRoAB99yuAJt2K3KXmAufbTWGafY5zDmxDlxsc-&s=0",
            "employer_website": "https://www.thalesgroup.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/engineering-community-intern-at-thales-4087525068?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/engineering-community-intern-at-thales-4087525068?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Location: Canada_Remote, Canada\n\nDans des marchés en rapide évolution, les clients à travers le monde font confiance à Thales. Thales est une entreprise où les personnes les plus brillantes du monde entier se regroupent pour mettre en commun leurs idées et ainsi s'inspirer mutuellement. Dans tous les secteurs où œuvre Thales, notamment l’aérospatiale, le transport, la défense, la sécurité et l'espace, nos équipes d’architectes conçoivent des solutions innovantes qui rendent demain possible dès aujourd’hui.\n\nIn fast changing markets, customers worldwide rely on Thales. Thales is a business where brilliant people from all over the world come together to share ideas and inspire each other. In aerospace, transportation, defence, security and space, our architects design innovative solutions that make our tomorrow's possible.\n\nThis position is Remote Canada\n\nEngineering Community Intern\n\nPosition Summary\n\nThales Corporate Engineering in the Americas is looking for an intern/apprentice to support the Engineering communities. You will support the Engineering Director to build an Engineering community across the Americas that is greater than the sum of its parts. This will be done by connecting with the broader Thales Engineering community, supporting the organization of collaborative events, expanding the use of digital and non-digital communication and helping building operational dashboards to support regional activities.\n\nKey Areas of Responsibility\n\nIf you are interested in building communities, Engineering and digital culture you can help the Americas Engineering Director by:\n• Helping with seminars and webinars to create a sense of belonging of the Engineering community;\n• Helping spread awareness about Engineering craftsmanship, digital culture, learning in Engineering by connecting to the greater Thales and through digital tools such as SharePoint;\n• Finding and helping create engaging digital content on Engineering in the Americas leveraging on what exists at group level, and also in the industry in the Americas;\n• Researching and analyzing ideas from external Digital Transformation and Engineering events and proposing ways in which Thales can benefit from them;\n• Work closely with the entire Digital Communication team to share expertise, develop joint projects, and propose the best interfacing between the Digital Communication services;\n• Support the digitization of data for Engineering and the build the dashboard that will help the decisions makers.\n\nMinimum Requirements\n• You are in your last year of study in a Business School or Engineering school with a strong interest for communication or equivalent;\n• You have a high interest in Engineering and Digital transformation;\n• You are fluent in English and have knowledge of French and Spanish;\n• You have knowledge in data analysis and visualization using tools such as PowerBI;\n\nPreferred Qualifications\n• You have a degree in Engineering\n• You are fluent in French and Spanish\n• You have knowledge of Brazilian\n\nWhat We Offer\n\nThales provides an extensive benefits program for all full-time employees working 24 or more hours per week and their eligible dependents, including the following:\n• Company paid Extended Health, Dental, HSA, Life, AD&D, Short-term Disability, Cancer Care Program, travel insurance, Employee Assistance Plan and Well-Being program.\n• Retirement Savings Plans (RRSP, DCPP, TFSA) with a company contribution and a match to a DCPP, with no vesting period.\n• Company paid holidays, vacation days, and paid sick leave.\n• Voluntary Life, AD&D, Critical Illness, Long-Term Disability.\n• Employee Discounts on home, auto, and gym membership.\n\nWhy Join Us?\n\nSa Say HI and learn more about working at Thales click here.\n\n(https://youtu.be/9aMF4NMhEJo)\n\n#hybrid\n\nThales est un employeur offrant l’égalité des chances qui valorise la diversité et l’inclusion sur le lieu de travail. Thales s’engage à mettre en place des mesures d’adaptation tout au long du processus de recrutement. Les candidats sélectionnés pour une entrevue et ayant besoin de mesures d’adaptation sont priés de le faire savoir lors de l’invitation à l’entrevue; notre équipe travaillera volontiers avec chaque candidat pour répondre à ses besoins particuliers. Tous les renseignements relatifs aux mesures d’adaptation seront traités d’une manière confidentielle et utilisés uniquement dans le but d’offrir une expérience candidat adaptée.\n\nThales is an equal opportunity employer which values diversity and inclusivity in the workplace. Thales is committed to providing accommodations in all parts of the interview process. Applicants selected for an interview who require accommodation are asked to advise accordingly upon the invitation for an interview. We will work with you to meet your needs. All accommodation information provided will be treated as confidential and used only for the purpose of providing an accessible candidate experience.",
            "job_is_remote": false,
            "job_posted_at": "10 hours ago",
            "job_posted_at_timestamp": 1732824000,
            "job_posted_at_datetime_utc": "2024-11-28T20:00:00.000Z",
            "job_location": "Ontario",
            "job_city": null,
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 51.253775,
            "job_longitude": -85.323214,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DL-b32I1Zhm5WPWjeAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "11904100",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "yFwag_gBxeDmySdVAAAAAA==",
            "job_title": "Mechanical Co-op Student",
            "employer_name": "Stantec",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSj657Qzd63fCLI8gn6U82yr0wDhAyfYuocaJbo&s=0",
            "employer_website": "https://www.stantec.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": null,
            "job_employment_types": [],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/mechanical-co-op-student-at-stantec-4087273729?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/mechanical-co-op-student-at-stantec-4087273729?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "WhatJobs",
                    "apply_link": "https://en-ca.whatjobs.com/job/Mechanical-Engineering-Student/Canada/81197797?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Mechanical Co-op Student - ( 240004BL )\n\nDescription\n\nStantec Buildings is on a mission to become the world’s leading integrated design practice. Our architects, engineers, interior designers, sustainability specialists, and technologists are passionate about the power of design. We take an innovative, collaborative approach to projects, sharing a common belief that sustainable design for the built environment can make the world a better place for future generations. Join us and design your place with Stantec.\n\nYour Opportunity\n\nWe have an opportunity for an Intern Mechanical Engineer (4 Month Term) to join our St. John’s Buildings group starting January 2024.\n\nYour Key Responsibilities\n• Prepare contract drawings, schematics, schedules, details, and sketches from conceptual design through to construction.\n• Assist in the design of building related mechanical systems including HVAC, Plumbing and Fire Protection systems across Canada using applicable codes, standards, and reference materials.\n• Review equipment selections, perform preliminary engineering calculations, and develop preliminary designs.\n• Facilitate and ensure the quality of the project deliverables.\n• Follow production guidelines and project standards.\n• Review shop drawings and other contractor submittals for compliance with construction documents.\n• Perform field surveys for drawing developments, site reviews and as recorded drawings.\n• Communicate with other team members and become familiar with Stantec standards. To complete assignments and projects in a timely manner as required by the supervisor.\n\nQualifications\n\nYour Capabilities and Credentials\n• Knowledge or familiarity using Autodesk Revit® and AutoCAD software in drafting and design of buildings related projects would be an asset.\n• Knowledge or experience with building mechanical systems would be an asset.\n• Prior experience in the construction industry would be an asset.\n• Knowledge or familiarity with National Building Codes, plumbing codes, fire codes, and energy codes would be considered an asset.\n• Knowledge or familiarity with LEED standards, ASHRAE, ASPE and NFPA would be considered an asset.\n• Excellent verbal and written skills to communicate effectively with colleagues and staff; a “team player” approach.\n• Self-motivated and self-starter with a strong work ethic.\n• Good time management skills and able to work in a fast-paced work environment.\n• Eager to learn with strong listening and critical thinking and problem-solving skills.\n\nEducation And Experience\n• Working towards a degree as a Mechanical Engineer from a reputable Canadian University and successful completion of Academic Term 5 as of January 2024 and is available for a 4-month internship.\n\nTypical office environment working with computers. Field work may include exposure to the elements including inclement weather.\n\nThis description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice.\n\nStantec is a place where the best and brightest come to build on each other’s talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best. #DesignYourPlace\n\nBenefits Summary: Regular full-time and part-time employees will have access to health, dental, and vision plans, a well-being program, health care spending account, wellness spending accounts, group registered retirement savings plan, employee stock purchase program, group tax-free savings account, life and accidental death & dismemberment (AD&D) insurance, short-term/long-term disability plans, emergency travel benefits, tuition reimbursement, professional membership fee coverage, and paid time off.\n\nTemporary/casual employees will have access to group registered retirement savings plan, employee stock purchase program, and group tax-free savings account.\n\nThe benefits information listed above may not apply to union positions because benefits for such positions are governed by applicable collective bargaining agreements.\n\nPrimary Location : Canada-Newfoundland and Labrador-St. John's\n\nOrganization : BC-1334 Buildings-CA Atlantic Canada\n\nEmployee Status : Temporary\n\nJob Level : Entry Level\n\nTravel : No\n\nSchedule : Part-time\n\nJob Posting : Nov 28, 2024, 7:32:59 AM\n\nReq ID: 240004BL\n\nStantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans",
            "job_is_remote": false,
            "job_posted_at": "13 hours ago",
            "job_posted_at_timestamp": 1732813200,
            "job_posted_at_datetime_utc": "2024-11-28T17:00:00.000Z",
            "job_location": "Canada",
            "job_city": null,
            "job_state": null,
            "job_country": "CA",
            "job_latitude": 56.130365999999995,
            "job_longitude": -106.34677099999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DyFwag_gBxeDmySdVAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17214100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "SH-eCONzGdMCWMeRAAAAAA==",
            "job_title": "Software/Data Engineering Intern (4-12 months starting Winter 2025)",
            "employer_name": "Verdi",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSeLO_GSrIjY9YURl0zMsh0xnnYc7qo6rFhivXT&s=0",
            "employer_website": "https://verdicommerce.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/software-data-engineering-intern-4-12-months-starting-winter-2025-at-verdi-4085992542?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/software-data-engineering-intern-4-12-months-starting-winter-2025-at-verdi-4085992542?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Verdi Job Board",
                    "apply_link": "https://verdiag.applytojobs.ca/software/34366?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "WhatJobs",
                    "apply_link": "https://en-ca.whatjobs.com/job/Software-Data-Engineering/vancouver-british-columbia/81518380?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Apply on the Verdi careers page: https://verdiag.applytojobs.ca/\n\nWhat we do\n\nLong term: We empower farmers to build a more resilient future for global agriculture.\n\nRight now: We build modern irrigation automation for every grower. We do that by building and deploying intelligent devices to automate farm infrastructure for irrigation, fertilization, and other operations along with the software to scalably manage it all.\n\nYou might think this is surely a solved problem. It turns out it isn’t. Especially not at the scale our customers, the world’s largest food brands, operate at. And that’s where you come in.\n\nWhere you come in\n\nAs an intern on the Software and Data team, you’ll help us work towards our mission while developing yourself technically and professionally.\n\nYou will:\n• Join a small team of passionate people enabling 21st century agriculture\n• Have an opportunity to make an impact at an early stage startup as it scales up\n• Help our growers feel confident in our systems and manage the complexities of their operations\n• Write high-quality code, develop processes, work with evolving designs, and contribute in whatever ways you can to our mission\n\nWhat your time here will look like\n\nWe approach our internships with lots of flexibility in order to adapt your relatively short time here to what you’re good at and what you’d like to get better at.\n\nBeing a fairly small team, we’ll need your help to ensure you get the most of your time here. We’ll work together to figure out what style of internship works best for you. You can spend your time working as any other member of the team within our regular development process or take ownership over a larger, more contained project.\n\nRegardless of how we structure your internship, you’ll be able to work on the following areas:\n• Front-end engineering on the Verdi Dashboard used by all our customers to control and monitor their systems\n• Back-end engineering to improve or expand APIs and system architecture\n• Device communication architecture used to handle communication with our fleet of Verdi and third-party devices\n• Cloud infrastructure and DevOps to improve how we build, deploy, and maintain our systems\n• Data Analysis and Machine Learning explorations/systems/features to help make use of our data and provide value to customers\n• Documentation and process improvements\n• Anything else you could reasonably improve during your internship\n\nYou’ll also be expected to:\n• Write code that is extensible, well-documented, and readable\n• Collaborate with people from relevant teams including Hardware, Design, and Business\n• Manage any internship requirements with your school in a timely manner\n• Participate in project management processes\n• Communicate your work with the wider team\n\nFinally, we’ll have regular check-ins to make sure you’re progressing well and have dedicated opportunities for mentorship.\n\nOur stack\n• Cloud host\n• Google Cloud Platform\n• Database\n• MongoDB\n• TimescaleDB (PostgreSQL-based)\n• Back-end\n• TypeScript\n• NodeJS\n• Mongoose/Typegoose\n• Jest\n• Prisma\n• Front-end\n• Typescript\n• PixiJS\n• Material UI\n• Leaflet\n• Device communication\n• LoRaWAN\n• The Things Industries\n• DevOps\n• Terraform\n• Docker\n\nWhat we’re looking for\n\nYou are:\n• Enthusiastic about software and data\n• Eager to learn on your own and from others\n• Able to write code in a software engineering context with some knowledge of best practices\n• Open-minded and receptive to feedback\n• Detailed and thoughtful in everything you create\n• Communicative and someone who asks questions\n\nYou must:\n• Be enrolled in a relevant technical program at a University or College\n• Graduate from your program in 1-2 years\n• Be able to work in Vancouver, BC for the duration of the internship\n• Hold Canadian citizenship, Permanent Residency or refugee status (International students are not eligible)\n\nWhat we’re excited by\n• Familiarity with our stack\n• Interest and/or experience in the agriculture/sustainability industry\n• Past internships/experience doing software/data work, especially in startups\n• Personal or school projects that demonstrate strong technical and creative abilities\n\nWhat you get\n• Flexible hybrid work style (generally in office M-W-F)\n• Flexible work hours (generally available 11am to 5pm)\n• Flexibility to work remotely as needed\n• Hourly wage of $25-40/hour paid as 8 hours/day (no time-logging)\n• Vacation pay of 4% of days worked (time off is unpaid)\n• Unlimited paid sick days\n• A pretty cool office located at 2285 Clark Dr.\n• Opportunity to work in one of the world’s most livable cities with unmatched access to nature and activities\n• Chance to make an impact on a fast-growing startup and the agriculture industry\n• Chance to travel to interesting locations to meet with growers",
            "job_is_remote": false,
            "job_posted_at": "8 hours ago",
            "job_posted_at_timestamp": 1732831200,
            "job_posted_at_datetime_utc": "2024-11-28T22:00:00.000Z",
            "job_location": "Vancouver, BC",
            "job_city": "Vancouver",
            "job_state": "British Columbia",
            "job_country": "CA",
            "job_latitude": 49.2827291,
            "job_longitude": -123.12073749999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DSH-eCONzGdMCWMeRAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15113200",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "wzvJtYV9kHva3ZvrAAAAAA==",
            "job_title": "Co-op Student, Transportation – Regional Roads",
            "employer_name": "WSP in Canada",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQdlIFurvPB4wmekXqZd2cNcRqZRLazPodXkTK5&s=0",
            "employer_website": null,
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/co-op-student-transportation-%E2%80%93-regional-roads-at-wsp-in-canada-4085987304?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/co-op-student-transportation-%E2%80%93-regional-roads-at-wsp-in-canada-4085987304?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Description\n\nThe Opportunity:\n\nWSP is currently seeking Co-op Students to join our Regional Roads team, located Red Deer or Calgary. Reporting to the Area Manager, this position will be responsible for supporting projects primarily in the field and office as well.\n• Expected start date : May 2025\n• Duration: 4-months & 8-months\n• Application Instructions: Please indicate your duration (4 months / 8 months) on your application\n\nWhy choose WSP?\n• We value and are committed to upholding a culture of inclusion and belonging\n• Our Flexible Work Policy – we recognize the importance of balance in our lives and encourage you to prioritize the balance in yours. We will support you on and off the job so you can be fully present in both your work and home lives.\n• A Canadian success story - we're proud to wear the red and white of this beautiful country and show the world what Canada has to offer.\n• Enhance the world around you - from the environment to the highways, to the buildings and the terrain, WSP is the fabric of Canada.\n• Outstanding career opportunities - we're growing and pushing ourselves every day to be greater than yesterday - we're open to your ideas and trying new things.\n• A phenomenal collaborative culture and a workforce filled with genuinely good people who are doing humbly important work. Come find out for yourself what it's like to be a part of our journey.\n\nWe offer attractive pay, flexible work options, a great corporate culture, comprehensive and employee-focused benefits including virtual healthcare and a wellness platform as well as great savings programs, and a clear vision for the future.\n\n#WeAreWSP #StudentTech-CA\n\nWhat you can expect to do here:\n• To work with Project Managers, Technicians and Surveyors on the delivery of a variety of complex transportation engineering projects;\n• Travel to various projects throughout the assigned region to ensure required tasks are completed in a timely manner and construction schedules are not compromised;\n• Perform various material testing in accordance with procedures outlined in Contract Specifications, CSA and ASTM;\n• Assist and/or perform various surveys on various projects throughout the assigned region as required and outlined in Contract Specifications;\n• Support the engineering team with onsite construction surveying using GPS, Drone and conventional survey methods;\n• Prepare laboratory test reports, and field review reports;\n• Ability and willingness to travel, work away from home for extended periods of time, and work long hours;\n• Other duties as assigned.\n\nWhat you’ll bring to WSP:\n• Have a valid Class 5 driver’s license;\n• Currently enrolled in an accredited co-op post-secondary Civil Engineering program;\n• Adaptable to a changing work environment;\n• Motivated, self-starter who can be a leader and work well independently or with a team;\n• Excellent communication, both written and verbal.\n\nAbout Us\n\nWSP is one of the world's leading professional services firms. Our purpose is to future proof our cities and environments.\n\nWe have over 65,000 team members across the globe. In Canada, our 12,000+ people are involved in everything from environmental remediation to urban planning, from engineering iconic buildings to designing sustainable transportation networks, from finding new ways to extract essential resources to developing renewable power sources for the future.\n\nAt WSP:\n• We value our people and our reputation\n• We are locally dedicated with international scale\n• We are future focused and challenge the status quo\n• We foster collaboration in everything we do\n• We have an empowering culture and hold ourselves accountable\n\nPlease Note:\n\nHealth and Safety is a core paramount value of WSP. Given the importance of keeping one another safe it is expected that you comply with our Health, Safety & Environment (HSE) policy at all times as well as client HSE policies when working at client locations.\n\nOffers of employment for safety-sensitive positions involving fieldwork are contingent upon candidates being able to perform key physical tasks of the job as described in the job posting and interview. This may include the ability to work in a variety of environmental conditions, such as remote or isolated areas, working alone, and in inclement weather (within safe and reasonable limits).\n\nWSP welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process.\n\nWSP is committed to the principles of employment equity. Only the candidates selected will be contacted.\n\nWSP does not accept unsolicited resumes from agencies. For more information please READ THE FULL POLICY.",
            "job_is_remote": false,
            "job_posted_at": "5 hours ago",
            "job_posted_at_timestamp": 1732842000,
            "job_posted_at_datetime_utc": "2024-11-29T01:00:00.000Z",
            "job_location": "Calgary, AB",
            "job_city": "Calgary",
            "job_state": "Alberta",
            "job_country": "CA",
            "job_latitude": 51.044733099999995,
            "job_longitude": -114.0718831,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DwzvJtYV9kHva3ZvrAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "53606100",
            "job_onet_job_zone": "2"
        },
        {
            "job_id": "m89Um6_VvVQuzqimAAAAAA==",
            "job_title": "OPS_Co-Op/Intern/Trainee/Apprentice (Indirect)",
            "employer_name": "Dana Incorporated",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTXjwxGitDKVx7ArMerSYsL8Sfg7wDHRRPg2WAD&s=0",
            "employer_website": "https://www.dana.com",
            "job_publisher": "Indeed",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.indeed.com/viewjob?jk=88733a91e4ca5115&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=88733a91e4ca5115&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/Dana-Incorporated/Job/OPS_Co-Op-Intern-Trainee-Apprentice-(Indirect)/-in-Boucherville,QC?jid=1e1809dbb3611b0e&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/ops-co-op-intern-trainee-apprentice-indirect-dana-incorporated-JV_IC4036620_KO0,44_KE45,62.htm?jl=1009544683027&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/ops-co-op-intern-trainee-apprentice-indirect-at-dana-incorporated-4087276258?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobs Trabajo.org",
                    "apply_link": "https://ca.trabajo.org/job-850-f3f50234e2a07701c35c114cbb0ef7ec?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "InternPlug",
                    "apply_link": "https://internplug.com/jobs/ops_co-opinterntraineeapprentice-indirect-29545/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Objectif du poste\n\nVous désirez contribuer à l’essor de l’électrification des transports?\n\nJoignez-vous à nous dans le développement et l’avancement de technologies propres, efficientes et efficaces et contribuez à la croissance de l’électrification des transports.\n\nDana TM4 est une entreprise dont la mission première est l’électrification des transports. Nous sommes reconnus dans le monde entier pour nos produits de haute technologie. Nous sommes une entreprise québécoise dynamique et en pleine croissance qui encourage la créativité et l’innovation. Nous croyons que les défis sont intéressants et constamment renouvelés et que nous pouvons tous faire une différence personnelle.\nEn tant que membre actif de l’équipe de test, de Validation et de Vérification des produits, vous travaillerez avec les équipes de développement, de validation et de mise sur le marché des produits. En tant que stagiaire en gestion de projet de Vérification et Validation, vous assisterez les gestionnaires de projet V&V et l’équipe de validation et de test pour valider nos produits qui seront installer dans les véhicules électriques de demain. Vous participerez à la définition, à l’exécution et à la mise en oeuvre des stratégies de test de nos systèmes de propulsion électrique pour les véhicules électriques de demain.\n\nTâches et responsabilités du poste\n\nVos défis\n• Être responsable de la préparation, la coordination, du suivi et de la production de rapports d’avancement de projet de validation de produit afin de respecter le calendrier des clients.\n• Suivre et assurer la livraison des intrants nécessaires à la validation.\n• Soutenir le planificateur de laboratoire pour maximiser l’efficacité du laboratoire.\n• Soutenir le coordonnateur de laboratoire pour maintenir à jour les outils de suivi du matériel de laboratoire.\n• Maintenir et mettre à jour les DVP&R (Design Validation Plan & Reports).\n• Proposer et mettre en place des initiatives d’améliorations continues visant les processus de validation et d’essais du laboratoire.\n• Participer à la mise à jour du catalogue de standard de test du laboratoire.\n\nVos forces\n• 2e ou 3e année de baccalauréat en génie mécanique, logiciel, électrique ou expérience équivalente pertinente\n• Essentiel : Proactivité et aise à travailler dans un environnement dynamique\n• Essentiel : Curieux, autonome, leadership\n• Essentiel : Expérience démontrée avec les outils MS Office\n• Atout : Expérience en gestion de projet\n• Atout : Expérience sur les outils Atlassian (Jira, Confluence)\n• Atout : Expérience en test et validation\n• Atout : connaissances en langage de programmation\n• Habileté en communication et vulgarisation\n• Habileté à documenter son travail\n• Maîtrise du français et de l’anglais (parlé et écrit)",
            "job_is_remote": false,
            "job_posted_at": "18 hours ago",
            "job_posted_at_timestamp": 1732795200,
            "job_posted_at_datetime_utc": "2024-11-28T12:00:00.000Z",
            "job_location": "Boucherville, Quebec",
            "job_city": "Boucherville",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 45.591369799999995,
            "job_longitude": -73.4364097,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dm89Um6_VvVQuzqimAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "47301300",
            "job_onet_job_zone": "2"
        },
        {
            "job_id": "i7AdXeUwh-QUE1oKAAAAAA==",
            "job_title": "Accounting Intern/Co-op - January",
            "employer_name": "Olympic Industries ULC",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTX5IgtehnclVGZtmKdVSj3ZWMTrEa4_5TvZXnS&s=0",
            "employer_website": "https://olympicind.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/accounting-intern-co-op-january-at-olympic-industries-ulc-4087536459?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/accounting-intern-co-op-january-at-olympic-industries-ulc-4087536459?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/tPzVN6ee4ee3mMp3sX8OyuaGsYHPKFX3EMRL-wSjC16AYgKgQWEY-Q?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "The Opportunity\n\nOlympic Industries is excited to offer a highly motivated and detail-orientated student the opportunity to join our growth-oriented team for a 4-month contract beginning in January 2025 as an Accounting Intern!\n\nWorking closely with the Operations Department, the Accounting Intern will gain valuable hands-on experience in various aspects of accounting including invoicing, and month-end closing procedures. This internship will also provide an opportunity to develop your administrative skills while working in a supportive and collaborative office environment.\n\nSpecific Responsibilities\n\nAs an Accounting Intern your responsibilities may include, but are not limited to, the following responsibilities:\n\nSupport the Invoicing Team in managing the creation, processing, and distribution of invoices:\n• Support the Invoicing Team in managing the creation, processing, and distribution of invoices.\n• Resolving inquiries, including issuing debits & credits to resolve discrepancies, and answering invoicing-related questions.\n• Update and adjust sales orders per approval.\n• Complete required customs paperwork.\n• Perform basic office duties such as filing, scanning, and organizing documents.\n• Assist in the month-end closing procedures.\n• Participation in ad hoc projects.\n\nWho We’re Looking For\n\nEducation and Experience\n• Working towards a Diploma or Degree in a related program such as Accounting.\n• Previous experience in a fast-paced work environment.\n• Proficient in Microsoft applications, particularly Microsoft Excel.\n• Experience with AS400 and Great Plains considered an asset.\n\nWhat We Offer\n\nSmall Company with Big Perks\n• Olympic is a mid-sized company with an open door/open concept layout where anybody you may need is easily accessible. This layout not only helps to support individuals in their career growth and development but also encourages individuals to interact and be curious about how different departments support each other in their roles.\n\nGreat Central Location\n• Located in the Lonsdale Quay, Olympic is transit accessible from any location in the lower mainland. There are many great shops, restaurants, and parks within a walking distance and the mountains are just a 10-minute drive away.\n\nAdditional Details\n• Salary range: $38,000-$45,000 per annum.\n• This position is 100% in office, located in Lower Lonsdale, North Vancouver.\n\nApply Now!\n\nFor more information on Olympic Industries, please visit our website at www.olympicind.com .\n\nWe thank all applicants for their interest! However, only those selected for an interview will be contacted. At Olympic Industries, we embrace diversity and are committed to building a team that represents a variety of backgrounds, cultures, perspectives skills, and experiences. As an equal opportunity employer, we encourage applications from all qualified individuals.",
            "job_is_remote": false,
            "job_posted_at": "9 hours ago",
            "job_posted_at_timestamp": 1732827600,
            "job_posted_at_datetime_utc": "2024-11-28T21:00:00.000Z",
            "job_location": "North Vancouver, BC",
            "job_city": "North Vancouver",
            "job_state": "British Columbia",
            "job_country": "CA",
            "job_latitude": 49.3199816,
            "job_longitude": -123.0724139,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Di7AdXeUwh-QUE1oKAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": "YEAR",
            "job_highlights": {},
            "job_onet_soc": "13201100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "IP0o_5JkUhoTi1DnAAAAAA==",
            "job_title": "Architectural Intern",
            "employer_name": "Lanescape | Architecture + Construction",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRpmdBAGaLelXmsPkyu4mVlMeOETEMLwmM0GRMY&s=0",
            "employer_website": "https://lifescapecolorado.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/architectural-intern-at-lanescape-architecture-%2B-construction-4084628446?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/architectural-intern-at-lanescape-architecture-%2B-construction-4084628446?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Lanescape is a specialized architecture practice specializing in the development of laneway and garden suites throughout Toronto. As key proponents in the development of Toronto’s Changing Lanes by-law and the recently approved garden suite policy, our office operates at the intersection of social advocacy, urban planning and contextually-sensitive design. As we continue to pioneer Toronto’s accessory dwelling unit initiatives, our work is fundamentally unique and innovative. We specialize in creative, high-performance design and construction from preliminary site planning through to a granular level of detail. Our practice is located in downtown Toronto, with projects throughout the urban core and its periphery.\n\nWith a rapidly growing project list, we are seeking a passionate and technically proficient individual to join our team. Key responsibilities include but are not limited to; preparation of drawings for permit, tender and construction in Revit, consultant coordination, development and maintenance of office standards, and assisting with product research and specifications. The successful candidate will be a well-organized, detail-oriented individual capable of working on several projects simultaneously.\n\nQualifications\n• Minimum 3 years experience in single family residential design and construction\n• Proficiency in the following software:\n• High proficiency in Autodesk Revit is essential\n• Adobe Creative Suite (InDesign, Illustrator, Photoshop)\n• Sketchup\n• Microsoft Office Suite (Word, Excel)\n• Thorough comprehension of wood-frame construction detailing, materials, and standards\n• Knowledge of the Ontario Building Code, Part 9\n• Familiarity with municipal approvals and the Toronto zoning by-law\n• Passion for sustainable, innovative urban design and construction\n• Self-sufficiency, self-motivation and a critical eye for detail\n• Excellent graphic, written and oral communication skills\n\nResponsibilities\n• Full-time work week from our office, 9am-5pm, Monday-Friday.\n• Collaborate and coordinate with teammates, clients, consultants, and vendors\n• Lead preparation of drawings for permit, tender, and construction\n• Material/specification research, detailing, and coordination\n• Monitoring of deliverables, schedules and communication with clients\n\nCompensation\n\nCommensurate with experience - $50,000 - $60,000\n\nApplication\n\nTo apply, please email the following to info@lanescape.ca in PDF format:\n• Cover Letter\n• Current Résumé/CV\n• Portfolio of relevant work",
            "job_is_remote": false,
            "job_posted_at": "15 hours ago",
            "job_posted_at_timestamp": 1732806000,
            "job_posted_at_datetime_utc": "2024-11-28T15:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DIP0o_5JkUhoTi1DnAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17101100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "EpFfDKh7x8dYFmVrAAAAAA==",
            "job_title": "Quality Co-op Student (Winter Term)",
            "employer_name": "Magna Exteriors",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTaoWGb8ylZzLw3kogA_K24UBeV73a7hqcDIq29&s=0",
            "employer_website": "https://www.magna.com",
            "job_publisher": "Indeed",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.indeed.com/viewjob?jk=20fc9a403d7f699b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=20fc9a403d7f699b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobs At Magna - Magna International",
                    "apply_link": "https://jobs.magna.com/job/Brampton-Quality-Co-op-Student-%28Winter-Term%29-ONTA-L6R-4C8/587152417/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobrapido.com",
                    "apply_link": "https://ca.jobrapido.com/jobpreview/5529588536094752768?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Number: 70488\nGroup: Magna Exteriors\nDivision: Plastcoat\nJob Type: Student\nLocation: BRAMPTON\n\nWork Style:\nAbout us\n\nWe see a future where everyone can live and move without limitations. That's why we are developing technologies, systems and concepts that make vehicles safer and cleaner, while serving our communities, the planet and, above all, people.\n\nForward. For all.\n\nGroup Summary\n\nThe Magna Exteriors portfolio of products includes access systems such as liftgates, exterior trim, modular systems, front-end modules including fascia, active aerodynamic systems and other lightweight structural components for automotive, commercial truck and other industrial markets.\n\nRecognized globally as an innovator in all aspects of vehicle exteriors, Magna provides everything needed, from materials development and design through manufacturing and assembly, to help automakers create sleek, state-of-the-art vehicles across the world.\n\nAbout the Role\n• Strong verbal and written communication skills\n• Advanced Excel skills and proficiency with Microsoft Word\n• Demonstrated ability to effectively solve problems\n• Strong interpersonal skills\n• Reliability, accuracy and thoroughness\n• Well-developed organizational and time management skills\n• Ability to establish priorities, meet deadlines and work in fast paced environment\n\nYour Responsibilities\n• Review eRFX system and supplier CQI assessments to determine which suppliers have expired CQI assessments\n• For suppliers missing a valid CQI assessment:\n• contact supplier by phone and by email to solicit CQI assessment\n• follow up frequently (daily basis) with supplier on status of CQI assessment\n• review submitted CQI assessment to confirm it is duly completed; verify assessment dates entered within eRFX and within electronic document are correct\n• As required, contact suppliers by phone and email to ensure supplier contact info within eRFX is updated and accurate\n• Consult with Plastcoat Quality Engineers and Supplier Quality Engineer for any concerns related to supplier CQI assessments\n• Update/refresh supplier CQI PowerBI dashboard on a weekly basis\n• Initiate customer satisfaction QPF complaints (as required) for those suppliers who do not submit CQI assessment\n• Follow up with the issued QPF complaints on a weekly basis\n• Digitize hardcopy PPAP records and arrange to have them",
            "job_is_remote": false,
            "job_posted_at": "10 hours ago",
            "job_posted_at_timestamp": 1732824000,
            "job_posted_at_datetime_utc": "2024-11-28T20:00:00.000Z",
            "job_location": "Brampton, ON",
            "job_city": "Brampton",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.731547899999995,
            "job_longitude": -79.7624177,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DEpFfDKh7x8dYFmVrAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17214100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "m0NbMkurIGo2jVsuAAAAAA==",
            "job_title": "Co-Op, People Team & Operations",
            "employer_name": "Hootsuite",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQukosEmIOTnh14_1hE9GF5-1DKWapFySTtrFIJ&s=0",
            "employer_website": "https://www.hootsuite.com",
            "job_publisher": "Indeed",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.indeed.com/viewjob?jk=d3783fbe32fa5eb1&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": true,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=d3783fbe32fa5eb1&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/co-op-people-team-operations-at-hootsuite-4084453968?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Talentify",
                    "apply_link": "https://www.talentify.io/job/co-op-people-team-and-operations-vancouver-british-columbia-ca-hootsuite-6438045?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Title: Co-Op, People Team & Operations (Winter 2025 Term)\n\nLocation: Vancouver, BC\n\nTerm: 4 months\n\nStart Date: January 20, 2025\n\nOpenings: 1\n\nOverview:\n\nOur People team is looking for a motivated and proactive co-op student to join us for the Winter 2025 term and assist in various functions including (but not limited to) Total Rewards, People Operations, Benefits, Talent Acquisition and Learning & Development. The successful candidate will have the opportunity to work in a fast-paced and dynamic environment, learning and contributing to various HR functions while developing their skills.\n\nResponsibilities (could include but are not limited to):\n• Providing support to the Total Rewards team in administering employee compensation and benefits programs, including data entry, record-keeping, and communication with employees and vendors.\n• Prepare employment-related documentation to support the changes that take place throughout the employee lifecycle\n• Assisting the Benefits team with employee benefits programs, including health, dental, vision, disability and life insurance.\n• Support the Talent Acquisition team with candidate sourcing, screening, scheduling and communication, as well as maintaining applicant tracking systems and candidate data.\n• Assist in the administration of various Learning & Development initiatives including coordinating training sessions, managing participant attendance and materials, and tracking participant progress.\n• Assist in the administration of various Learning & Development initiatives including administering the LMS, coordinating training sessions, managing participant attendance and materials, and tracking participant progress\n• Assist the Social Impact and Diversity, Equity and Inclusion teams in the areas of events, partnerships (internal & external) and communications.\n• Collaborate with People team members to continuously improve People team processes and procedures, including documentation, communication and reporting.\n• Participate in the facilitation, coordination & delivery of an HR centric project.\n\nRequirements:\n• Currently enrolled in a relevant post-Grad, Bachelor's or Master's program, preferably in Human Resources or a related field.\n• Strong attention to detail, organization and time management skills.\n• Excellent written and verbal communication skills.\n• Ability to work effectively in a team environment, as well as independently.\n• Proficient in Google suite, particularly Sheets and Decks.\n• Demonstrated interest in Human Resources and eagerness to learn.\n\nLearning opportunities in this role:\n• Gain hands-on experience in various People functions including Total Rewards, Benefits, Talent Acquisition and Learning & Development.\n• Develop and enhance HR knowledge and skills.\n• Opportunity to work with a dynamic and collaborative People team.\n• Potential for future employment opportunities upon completion of the co-op term.\n\nWHO YOU ARE:\n• Tenacious. You are determined to succeed, and you are motivated by the success of customers, colleagues and the community.\n• Curious. You are always learning and seeking ways to make things better.\n• Conscientious. You keep your promises, taking your commitments to others seriously, and you have strong integrity.\n• Humble. You lead with humility and empathy, respecting and learning from the perspectives of others.\n\nIn all we do, our six guiding principles light the way:\n\nStep Up: Show the world what it looks like to live and work by these guiding principles. #StepUp\n\nOne Team: Make Hootsuite a place where everyone feels safe, welcome, valued, and empowered to do their best work without compromising who they are. #OneTeam #FreeToBeMe\n\nCustomer Obsessed: Focus relentlessly on helping our customers succeed. #CustomerObsessed\n\nGo Fast, Be Agile: Widen our competitive advantage by committing to speed and simplicity over perfection and complexity. #GoFastBeAgile\n\nPlay to Win: Commit to building an incredible, profitable company for our customers, our employees, and our stakeholders. #PlayToWin #NoExcuses\n\nNeighbours & Allies: Give back to our communities and be an ally. #SocialForGood #Allies\n\nWe are an equal opportunity employer and welcome applications from all qualified candidates. If you are interested in this exciting opportunity, please submit your resume and cover letter for consideration.\n\nAccommodations will be provided as requested by candidates taking part in all aspects of the selection process.\n\n#LI-YF",
            "job_is_remote": false,
            "job_posted_at": "14 hours ago",
            "job_posted_at_timestamp": 1732809600,
            "job_posted_at_datetime_utc": "2024-11-28T16:00:00.000Z",
            "job_location": "Vancouver, BC",
            "job_city": "Vancouver",
            "job_state": "British Columbia",
            "job_country": "CA",
            "job_latitude": 49.2827291,
            "job_longitude": -123.12073749999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dm0NbMkurIGo2jVsuAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": "YEAR",
            "job_highlights": {},
            "job_onet_soc": "17214100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "sDyQS89apCErNBycAAAAAA==",
            "job_title": "Co-op Student",
            "employer_name": "Island Health - Vancouver Island Health Authority",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR9bllG5y0-A6zw91tItmwcbdMsEfQ0iuHVCYVq&s=0",
            "employer_website": null,
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/co-op-student-at-island-health-vancouver-island-health-authority-4087585906?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/co-op-student-at-island-health-vancouver-island-health-authority-4087585906?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "WhatJobs",
                    "apply_link": "https://en-ca.whatjobs.com/job/Co-op-Student/victoria-british-columbia/79678437?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Description\n\nPlease refer to hiring department\n\nQUALIFICATIONS:Education, Training And Experience\n\nPlease refer to hiring department.\n\nSkills And Abilities\n\nPlease refer to hiring department.\n\nLink To Full Job Description\n\nhttps://jd.viha.ca/JD3077.pdf",
            "job_is_remote": false,
            "job_posted_at": "3 hours ago",
            "job_posted_at_timestamp": 1732849200,
            "job_posted_at_datetime_utc": "2024-11-29T03:00:00.000Z",
            "job_location": "Victoria, BC",
            "job_city": "Victoria",
            "job_state": "British Columbia",
            "job_country": "CA",
            "job_latitude": 48.4284207,
            "job_longitude": -123.3656444,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DsDyQS89apCErNBycAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17214100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "KSOHjCrYtBoLm2DWAAAAAA==",
            "job_title": "Water / Wastewater Student Intern",
            "employer_name": "Stantec",
            "employer_logo": null,
            "employer_website": "https://www.stantec.com",
            "job_publisher": "Stantec Jobs",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://stantec.jobs/winnipeg-mb/water-wastewater-student-intern/1ACFFA6A16794B6580E1AF1E2C212002/job/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Stantec Jobs",
                    "apply_link": "https://stantec.jobs/winnipeg-mb/water-wastewater-student-intern/1ACFFA6A16794B6580E1AF1E2C212002/job/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "London Drugs Limited",
                    "apply_link": "https://london-drugs-limited-jobs.careerplug.com/jobs/2623549?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "Eluta.ca",
                    "apply_link": "https://www.eluta.ca/spl/pharmacy-student-intern-ef8d2f192fab9742f833ac0a7a9139ce?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Healthcarejobs.ca",
                    "apply_link": "https://www.healthcarejobs.ca/offer/mb/winnipeg/pharmacy-student-intern/477bf439-7cd4-422c-9261-27a50035227f_en/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobs.ca",
                    "apply_link": "https://www.jobs.ca/offer/pharmacy-student-intern/477bf439-7cd4-422c-9261-27a50035227f_en/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Pharmaceutical.ca",
                    "apply_link": "https://www.pharmaceutical.ca/offer/mb/winnipeg/pharmacy-student-intern/477bf439-7cd4-422c-9261-27a50035227f_en/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://emplois.ca.indeed.com/viewjob?jk=d007f7b9406accb9&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Monster.ca",
                    "apply_link": "https://www.monster.ca/job-openings/water-wastewater-student-intern-winnipeg-mb--9cadc472-76b5-43b1-8ee1-c7db5cbeef94?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Water / Wastewater Student Intern - ( 240004CI )\n\nDescription\n\nMany of the world’s top engineers and scientists come together in our Water business because they view a community’s interaction with water a bit differently—as a single holistic system, rather than unconnected networks divided by jurisdictional boundaries. Working throughout the hydrologic cycle, we are delivering sustainable solutions to make sure water is where it should be and available when needed. Our experts guide our work with scientific rigor, an innovative spirit, and a vision for growth. Every day, we help communities improve, reuse, and protect this precious resource for future generations. By 2025 we’re hiring 2,000 people (like you) to join our team. Grow with us, H2O+U..\n\nYour Opportunity\n\nAs a Student Intern, you will work in a team environment and have exposure to water infrastructure projects which may include water and wastewater plants, lagoons, pump stations, water supply and distribution and sewer collection systems. This is a terrific opportunity for a university or college student to support a number of exciting local and national projects. This is a contract position with a duration running from May 2025 to November 2025.\n\nYour Key Responsibilities\n\nProvide onsite contract administration including completion of the following tasks:\n• Maintain and operate survey equipment and assist on a survey field crew.\n• Attend construction sites to observe and monitor construction progress, report on deficiencies and complete construction progress reports as well as, pick up as-built information for records drawings.\n• Attend project sites for the purposes of obtaining samples, arranging sample testing and compiling and interpreting results.\n• Assisting in project administration including writing reports, gathering information, drafting correspondence, tracking project costs, and completing progress reports\n• Assisting technical staff with various project tasks, including researching, compiling and evaluating project data, preparing reports and performing calculations for water and wastewater treatment projects and/or sewer or watermain design projects.\n• Performing simple calculations, computer data entry, along with some exposure to CAD, design and cross-training.\n• Complete other engineering/administrative duties as required.\n\nQualifications\n\nYour Capabilities and Credentials\n• Proficient with Microsoft Office (Word, Excel, PowerPoint).\n• Strong interpersonal, verbal, and written communication skills.\n• Ability to multi-task, prioritize, and take direction.\n• Knowledge of state and federal regulations, policies, and programs, are a plus.\n• Proven ability to learn and take direction\n• Valid driver’s license and vehicle required\n• Physically able to work on construction sites in all types of weather conditions\n\nEducation and Experience\n• In progress toward earning a Bachelor's degree or Diploma in civil, water resources or environmental engineering from an accredited University or College.\n• Successful completion of 1 st year Civil Technology or Civil Engineering courses as a minimum.\n\nField work may include exposure to the elements including inclement weather. Limited office working environment is expected for this role, however if in the office it would include working at a desk for long periods of time.\n\nThis description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice.\n\nStantec is a place where the best and brightest come to build on each other’s talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best.\n\nBenefits Summary: Regular full-time and part-time employees will have access to health, dental, and vision plans, a well-being program, health care spending account, wellness spending accounts, group registered retirement savings plan, employee stock purchase program, group tax-free savings account, life and accidental death & dismemberment (AD&D) insurance, short-term/long-term disability plans, emergency travel benefits, tuition reimbursement, professional membership fee coverage, and paid time off.\n\nTemporary/casual employees will have access to group registered retirement savings plan, employee stock purchase program, and group tax-free savings account.\n\nThe benefits information listed above may not apply to union positions because benefits for such positions are governed by applicable collective bargaining agreements.\n\nPrimary Location : Canada-Manitoba-Winnipeg\n\nOrganization : BC-1112 Water-CA Prairies & Territories\n\nEmployee Status : Temporary\n\nJob Level : Entry Level\n\nTravel : Yes, 10 % of the Time\n\nSchedule : Full-time\n\nJob Posting : Nov 28, 2024, 7:51:23 AM\n\nReq ID: 240004CI\n\nStantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans",
            "job_is_remote": false,
            "job_posted_at": "14 hours ago",
            "job_posted_at_timestamp": 1732809600,
            "job_posted_at_datetime_utc": "2024-11-28T16:00:00.000Z",
            "job_location": "Winnipeg, MB",
            "job_city": "Winnipeg",
            "job_state": "Manitoba",
            "job_country": "CA",
            "job_latitude": 49.8954221,
            "job_longitude": -97.1385145,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DKSOHjCrYtBoLm2DWAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17208100",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "d49-A6BlW9xUY5vjAAAAAA==",
            "job_title": "STAGIAIRE, OPÉRATIONS WEB",
            "employer_name": "La Vie En Rose",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQZGlarNg43_dYi2PRgC3kj0gHP7pM_plvujRUJ&s=0",
            "employer_website": "https://www.lavieenrose.com",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/stagiaire-op%C3%A9rations-web-at-la-vie-en-rose-4087236723?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/stagiaire-op%C3%A9rations-web-at-la-vie-en-rose-4087236723?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=dde61e91e78383e1&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "Eluta.ca",
                    "apply_link": "https://www.eluta.ca/spl/stagiaire-op%C3%A9rations-web-bcfddf5cadff9741888a1d3db230e072?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/Y6VmsqKq5Q0Jce148B2ha7_3fOqA1RpJG-DzfejQqh3AjAr6gjI1mw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jooble",
                    "apply_link": "https://ca.jooble.org/jdp/6587580337599533785?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Recruit.net",
                    "apply_link": "https://www.recruit.net/job/stagiaire-operations-web-jobs/8C9BE26ECC38CA32?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Learn4Good",
                    "apply_link": "https://www.learn4good.com/jobs/montreal/canada/finance/3752583103/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobilize",
                    "apply_link": "https://www.jobilize.com/job/ca-qc-montreal-stagiaire-op-rations-web-bikini-village-hiring-now?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Une équipe aux mille et un talents unie dans sa diversité\n\nNous sommes une entreprise d’ici qui imagine de la lingerie et des maillots de bain faits pour la vraie vie depuis très longtemps. Et pourquoi? Parce qu’on veut que les femmes du monde entier se sentent bien dans leur peau. Joins-toi à notre équipe dynamique afin de débuter une carrière professionnelle stimulante dans un environnement engagé et en constante évolution.\n\nNous sommes plus de 4,600 employés et nous avons plus de 287 boutiques à l'échelle du Canada et notre marque est aussi présente dans 19 pays (100 magasins) un peu partout dans le monde.\n\nDes Extras Juste Pour Les Membres De Notre Équipe\n• Rabais de 50 % sur nos produits;\n• Horaires flexibles;\n• Possibilités d'avancement au sein de l'entreprise;\n• Entreprise familiale engagée dans la communauté;\n• Bonis de rendement (postes de gestion ou de ventes en magasin);\n• Programme de reconnaissance pour les années de service;\n• Programme d'innovation visant à encourager le partage d'idées;\n• Boni de référence;\n• Dayforce Wallet (paie sur demande : tu auras la possibilité d’avoir accès à une partie de ta paie dès la fin de ton quart de travail).\n\nPour Les Employé.e.s à Temps Plein\n• Régime d’assurance collective;\n• De trois (3) à cinq (5) jours de congé personnel (selon le poste);\n• Cotisation de l’employeur minimum de 2% versée à ton REER.\n\nRaison d’être de l’emploi\n\nLe.la stagiaire aura comme rôle de préparer une analyse comparant les différents aspects des opérations web entre les différents joueurs du marché américain. Le.la stagiaire doit travailler en étroite collaboration avec la majorité des départements de nos différentes bannières – La Vie en Rose, Bikini Village.\n\nResponsabilités principales\n• Dresser la liste des concurrents directs et indirects aux différentes bannières américaines (Bikini Village USA et La Vie en Rose USA);\n• Rechercher et compiler les options proposées par les concurrents en termes d’expérience client en ligne, processus et conditions des achats en ligne, processus de retour;\n• Apporter des suggestions pour améliorer les processus actuels pour les différentes bannières;\n• Présenter son analyse complétée avec les suggestions aux équipes des opérations web et marketing.\n\nTon profil\n• Minutie et sens de l’analyse : Ta rigueur et ton œil pour les détails te permettent de prioriser efficacement chaque tâche.\n• Esprit d’équipe et initiative : Tu es reconnu.e pour ton esprit d’équipe et ta capacité à être proactif.ve et à prendre des initiatives.\n\nExigences\n• DEC ou diplôme universitaire en cours/obtenu en gestion, administration ou dans un domaine pertinent ;\n• Connaissance d'Excel ;\n• Expérience dans le commerce de détail (un atout) ;\n• Français écrit/parlé et anglais parlé/écrit (Le.la candidat.e devra communiquer avec des magasins à l'extérieur du Québec) ;\n• Rigueur, capacité d'analyse et sens des priorités ;\n• Esprit d'équipe, proactivité et sens de l'initiative.\n\nLes informations sur ce site sont uniquement à des fins d'information et ne sont pas destinées à avoir des conséquences juridiques. La Vie en Rose s'est engagée envers l'équité en matière d'emploi. La Vie en Rose a mis en place un processus d'adaptation prévoyant des mesures d'adaptation pour les candidats sélectionnés pour une entrevue.",
            "job_is_remote": false,
            "job_posted_at": "14 hours ago",
            "job_posted_at_timestamp": 1732809600,
            "job_posted_at_datetime_utc": "2024-11-28T16:00:00.000Z",
            "job_location": "Montreal, Quebec",
            "job_city": "Montreal",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 45.501886899999995,
            "job_longitude": -73.56739189999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dd49-A6BlW9xUY5vjAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15119900",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "FmS521L8celu_QAcAAAAAA==",
            "job_title": "Technical Sales - Intern",
            "employer_name": "Panevo",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQNvi1pm8pU1T8Yg-iSLBrbc6x2TE2yu9Ywxq9q&s=0",
            "employer_website": "https://panevo.com",
            "job_publisher": "Indeed",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://emplois.ca.indeed.com/viewjob?jk=23efe0774be05804&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": true,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://emplois.ca.indeed.com/viewjob?jk=23efe0774be05804&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/technical-sales-intern-panevo-JV_IC2278756_KO0,22_KE23,29.htm?jl=1009544892918&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": true
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/o4hjIXScSxTr99Gh_30boSy0darZQng30dMhqnwrCq750ZjBC8x4HA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "About Panevo\n\nAt Panevo we combine our passion for sustainability and engineering to enable industry to optimize utility and process performance, reduce costs and ensure environmental compliance. From strategy, to site auditing, to project implementation, we deliver long-term benefit to local businesses and global brands.\n\nAbout this opportunity\n\nPanevo’s ioTORQ software platform is used by worldclass manufacturers to manage utility usage, reduce cost & emissions, support corporate sustainability reporting and improve production efficiency. Panevo are expanding into Brazil and are seeking to secure local partners, integrators and innovation partners.\n\nFor more information, please refer to:\n• www.panevo.com/emis\n• www.panevo.com/ubm\n• www.panevo.com/lean\n\nKey responsibilities include:\n• Perform Brazil market research and determine the potential for local ioTORQ software sales.\n• Perform SWOT and PEST analysis relevant to the local market.\n• Screen and interview potential Value Added Resellers (VARs).\n• Prioritize potential partners and present to internal management team.\n• Support software demonstrations, partnering negotiations and contracting.\n• Attend local tradeshows as required (expenses paid).\n• Manage sales and administrative processes in-line with Panevo’s systems.\n• Primary sector focus: Industrial, transport, large commercial, healthcare, municipalities.\n• Success metrics: Identifying and securing local partner(s).\n\nLocation\n\nWe have offices in Vancouver and Toronto, so the candidate can choose one of these two locations. We have a flexible work environment with work from home and the office.\n\nKey attributes and skills\n• Currently enrolled or recent graduate from an engineering or business program.\n• Proficient in Portuguese\n• Interested in technical sales and B2B software applications\n\nOur offer\n\nThis is a unique opportunity to play a key role in a growing, creative and results-oriented business.\n\nHow to apply\n\nPlease submit your resume and cover letter via Indeed. Candidates of interest will typically be contacted within two weeks of applying.\n\nPanevo is an Equal Opportunity Employer. Our policy is to provide a fair and equal employment opportunity to all qualified applicants regardless of factors such as race, color, age, religion, national origin, physical or mental disability, gender identity or sexual orientation.\n\nwww.panevo.com\n\nCore skills & sector focus keywords\n\nSoftware as a Service, B2B sales, marketing, business development, Industrial energy management, utility reduction, resource conservation, lean manufacturing\n\nJob Types: Full-time, Permanent\n\nPay: $3,100.00-$3,900.00 per month\n\nBenefits:\n• Casual dress\n• Company events\n• Paid time off\n• Work from home\n\nFlexible language requirement:\n• French not required\n\nSchedule:\n• Monday to Friday\n\nApplication question(s):\n• Will you be able to reliably commute or relocate to Vancouver or Toronto for this position?\n\nWork Location: Hybrid remote in Vancouver, BC V6B 3H7\n\nApplication deadline: 2024-12-08\nExpected start date: 2025-01-02",
            "job_is_remote": false,
            "job_posted_at": "13 hours ago",
            "job_posted_at_timestamp": 1732813200,
            "job_posted_at_datetime_utc": "2024-11-28T17:00:00.000Z",
            "job_location": "Vancouver, BC",
            "job_city": "Vancouver",
            "job_state": "British Columbia",
            "job_country": "CA",
            "job_latitude": 49.2827291,
            "job_longitude": -123.12073749999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DFmS521L8celu_QAcAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": "MONTH",
            "job_highlights": {},
            "job_onet_soc": "41401100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "kr1C0LNVXrYgGKr0AAAAAA==",
            "job_title": "People and Culture Analyst (Student)",
            "employer_name": "Invest Alberta",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRqHO3Mg79o4jh4W0AuRTVps59m1WUl8LygCTYY&s=0",
            "employer_website": "https://investalberta.ca",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/people-and-culture-analyst-student-at-invest-alberta-4085981539?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/people-and-culture-analyst-student-at-invest-alberta-4085981539?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/beU5Max9bPg8JYtYf_bubTcG__wdotwXmvReboCNeT7kOheW45Gffw?q=people+%26+culture+generalist&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobs Trabajo.org",
                    "apply_link": "https://ca.trabajo.org/job-2891-686dd8815ddf32121ab71efa66a7f2ef?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "People & Culture Analyst (Student)\n\nAs a member of the Invest Alberta Corporation (IAC) team, you will create connections and positively contribute to the overall employee experience at IAC by supporting the People & Culture team. Reporting to the Director of People & Culture, the People & Culture Analyst has the opportunity to explore many aspects of the human resources function, including recruitment, learning & development, and employee experience. To succeed in this role, you will bring problem-solving skills, an eye for improvement, and a growth mindset.\n\nPrimary duties will include:\n• Providing support for the People & Culture department’s various functions.\n• Engaging and collaborating with internal and external stakeholders to accomplish tasks such as recruitment and administrative support.\n• Taking ownership of processes and projects, including rolling out policies and developing programs.\n• Being a resource for employees who have questions about company policy and procedures.\n• Researching solutions and analyzing the results of various initiatives, including employee engagement surveys, compensation and benefits surveys, etc.\n• Developing, maintaining, and strengthening professional working relationships across the organization and its partner networks.\n• Discretely handling confidential information and data – adhering to privacy and confidentiality at all times.\n• Leveraging technology to improve organization, communication, and efficiency.\n• Other duties as required.\n\nQualifications:\n• Ideally, you will be a business student with a human resources or general business major, and at least second year standing in your program. Your previous experience will demonstrate your proficiency and ability in MS Office (including SharePoint, Excel, Word, etc.) and strong interpersonal communication skills.\n• You possess a strong attention to detail and excellent organization and problem-solving skills. With a proven ability to successfully prioritize and execute multiple projects, you are solution-oriented and strive for continuous improvement.\n• Experience working with stakeholders at all levels (both within and outside the organization) is considered an asset.\n• In addition to the above, you must be able to provide proof of enrollment at a post- secondary institution to qualify for this work term.\n\nAbout the Organization\n\nInvest Alberta Corporation works directly with investors to attract high-value and high- impact investments to the province. We bring industry, government partners, and economic organizations together to offer seamless services that make it easy for investment to flow into the province. With a strong entrepreneurial culture, we are taking new and innovative approaches to investment attraction.\n\nOur clients come from a wide variety of backgrounds, and so do we. Invest Alberta Corporation is proud to be an equal opportunity workplace. In recruiting for our team, we welcome the unique contributions that you can bring in terms of your education, culture, gender, race, sexual orientation, religious or ethnic backgrounds or physical abilities.\n\nHow to apply\n\nInterested in being a part of a new, dynamic organization that was designed to have a positive impact on Alberta’s future? If you are looking for an exciting and unique opportunity, to make a difference, and make connections, apply by including a cover letter, resume, and salary expectations.\n\nClosing Date: December 9\n\nAnticipated Start Date: January 2025 for an 8-month term.\n\nThank you for your interest in IAC. Only those candidates selected for interviews will be contacted. No phone calls please. To learn more about IAC & this position please visit: investalberta.ca",
            "job_is_remote": false,
            "job_posted_at": "11 hours ago",
            "job_posted_at_timestamp": 1732820400,
            "job_posted_at_datetime_utc": "2024-11-28T19:00:00.000Z",
            "job_location": "Edmonton, AB",
            "job_city": "Edmonton",
            "job_state": "Alberta",
            "job_country": "CA",
            "job_latitude": 53.5460983,
            "job_longitude": -113.49372659999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dkr1C0LNVXrYgGKr0AAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "19309400",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "lGgS3TCqt58oqgryAAAAAA==",
            "job_title": "Quality Engineering Co-op",
            "employer_name": "INNIO",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSTy_mVeOxEOilc4CN72VDmRjnuGAedRl9fNXce&s=0",
            "employer_website": null,
            "job_publisher": "Indeed",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.indeed.com/viewjob?jk=fb345815f6789096&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=fb345815f6789096&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/quality-engineering-co-op-at-innio-group-4087225536?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/cT1HyAl2LXoYusYJ6yWmWgqAadh0zarPUgY6BGwatw6tc5pwceGVhA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "What are we looking for?\n\nThe Quality Engineering Co-op will be a member of our Quality team working closing to support our production team.\n\nCo-op Term: January 2025 - April 2025\n\nEssential Responsibilities\n• Creating/Improving processes related to Return to Vendor and MRB Cage by establishing physical and systematic processes, workflows and documentation.\n• Gain Oracle knowledge to establish, improve and implement new processes related to Supplier Quality.\n• Create and support reporting and analysis in Oracle, such as daily status reports, return to vendor, inspections and inventory.\n• Support the non-conformance process through supplier and operations follow-ups.\n• Help with ad hoc incoming inspection to develop associated reporting and workflow.\n• Contributing to the development and implementation of best practice warehouse strategy, processes and procedures to aid and improve operational performance.\n• Developing action plans to optimize material storage processes and improve efficiency.\n• Conducting audits on material storage locations to determine inventory accuracy.\n• Analyzing stored data regarding material control to create both reports and spreadsheets.\n\nYour Profile\n• Experience working within a manufacturing setting would be considered.\n• Proficiency in Microsoft Programs, such as PowerPoint, Word and Excel.\n• Knowledge in Oracle, SAP or other ERP systems.\n• Ability to multi-task and deliver key objectives within established timelines.\n• Ability to work independently and within cross-functional teams.",
            "job_is_remote": false,
            "job_posted_at": "12 hours ago",
            "job_posted_at_timestamp": 1732816800,
            "job_posted_at_datetime_utc": "2024-11-28T18:00:00.000Z",
            "job_location": "Welland, ON",
            "job_city": "Welland",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 42.992157899999995,
            "job_longitude": -79.2482555,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DlGgS3TCqt58oqgryAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17214100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "MnJ7mWnyfZC5x7EHAAAAAA==",
            "job_title": "Stagiaire en génie civil",
            "employer_name": "Ministère des Transports et de la Mobilité durable du Québec (MTMD)",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRuKp0vR0uz7PnElwsl426b8fB2zpb3Pp4mDrB_&s=0",
            "employer_website": "http://www.transports.gouv.qc.ca/",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/stagiaire-en-g%C3%A9nie-civil-at-minist%C3%A8re-des-transports-et-de-la-mobilit%C3%A9-durable-du-qu%C3%A9bec-mtmd-4085124065?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/stagiaire-en-g%C3%A9nie-civil-at-minist%C3%A8re-des-transports-et-de-la-mobilit%C3%A9-durable-du-qu%C3%A9bec-mtmd-4085124065?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Joinrs",
                    "apply_link": "https://www.joinrs.com/it/job-offers/259720/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobillico",
                    "apply_link": "https://www.jobillico.com/fr/offre-d-emploi/ministere-des-transports-et-de-la-mobilite-dcpvzrg/stagiaire-en-g-eacute-nie-civil/14909441?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Signify - Talentify",
                    "apply_link": "https://signify.talentify.io/job/stagiaire-en-genie-manufacturier-montreal-quebec-signify-346099?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jobs Trabajo.org",
                    "apply_link": "https://ca.trabajo.org/job-1918-20d0f03b639b5d9a84f48f740c7ed3ed?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Comment présenter sa candidature\n\nPour cette étape vous devez communiquer avec le service de placement de votre établissement d’enseignement ou avec la personne responsable des stages de votre programme d’études ou de votre ordre professionnel.\n\nInformation sur le stage\n\nTitre Stagiaire en génie civil Employeur Ministère des Transports\n\nNuméro de référence\n\ndu stage\n\nMTQ15200 Session du stage Hiver 2025 Nombre de postes 1 Niveau de scolarité Universitaire 1er cycle Programmes d'études\n• Génie civil\n\nDate de publication de l'offre 28 novembre 2024 Date limite de réception des candidatures dans l’organisation 11 décembre 2024\n\nRenseignements généraux\n\nDescription\n\nLieu du stage (ville) Montréal Description de l’organisation La Direction de la planification et de la mobilité métropolitaine (DPMM) traite différents dossiers portant sur l’aménagement du territoire, la planification des transports et la mobilité durable sur le territoire de la Communauté métropolitaine de Montréal (CMM). Description du contexte dans lequel s'inscrit le stage Le mandat du stagiaire portera sur le potentiel d’implanter une mesure en transport collectif sur certains axes autoroutiers sous la responsabilité du ministère. Description du mandat et des tâches qui seront confiés au stagiaire Le stagiaire devra notamment :\n• Traiter des données (géométrie routière, conditions de circulation, etc.);\n• Analyser des données et représentations graphiques;\n• Effectuer des recommandations;\n• Rédiger des notes techniques et présenter des résultats;\n• Toutes autres tâches connexes.\n\nDurée souhaitée du stage en nombre de semaines 16 semaines\n\nLa durée d’un stage ne peut excéder celle qui est prévue au programme d’études. Nombre d’heures par semaine 35 heures Horaire et conditions de travail - Travail de jour du lundi au vendredi;\n• Possibilité de télétravail (présence minimale au bureau de 2 jours par semaine).\n\nProfil recherché - Étudier en génie au baccalauréat ou à la maîtrise dans un profil de transport;\n• Avoir un bon sens de l’organisation;\n• Posséder un bon degré d’autonomie;\n• Aptitude à travailler en équipe;\n• Présenter un intérêt marqué pour le transport;\n• Posséder des connaissances en transport;\n• Avoir de bonne connaissance du logiciel ArcGIS ou QGis;\n• Connaissance d'Autocad (un atout).\n\nUnité administrative où se déroule le stage (direction ou service) Direction de la planification et de la mobilité métropolitaine Début du stage 13 janvier 2025 Fin du stage 2 mai 2025\n\nLes dates peuvent être flexibles selon celles prévues par l’établissement d’enseignement.\n\nSalaire\n\nAux fins de la rémunération seulement, les tâches liées au stage sont appariées à la classe d’emplois Spécialiste en sciences physiques (124) et le taux horaire minimal est de 24.63 $. Une majoration de 6,5% s’ajoute à ce taux pour compenser certains avantages sociaux.\n\nAdresse où se déroulera le stage\n\nAdresse municipale 500, boul. René-Lévesque Ouest Ville Montréal Code Postal H2Z 1W7\n\nMentions\n\nLe stage doit être prévu au programme d’études des personnes candidates ou constituer une des conditions prescrites pour l’admission à un ordre professionnel.\n\nLe stage peut mener à un emploi dans la fonction publique, sous réserve de certaines conditions. Ces dernières peuvent être consultées sur Québec.ca\n\nPour profiter des mesures destinées aux membres de groupes cibles, il faut remplir le formulaire d’accès à l’égalité pour les stagiaires et le joindre au dossier de candidature. Ce formulaire est accessible à la section Stages du portail gouvernemental\n\nPour occuper un emploi ou réaliser un stage dans la fonction publique, toute personne doit avoir une connaissance du français appropriée au poste concerné.\n\nPour transmettre votre candidature, communiquez avec le service de placement de votre établissement d’enseignement ou avec la personne responsable des stages de votre programme d’études ou de votre ordre professionnel.",
            "job_is_remote": false,
            "job_posted_at": "19 hours ago",
            "job_posted_at_timestamp": 1732791600,
            "job_posted_at_datetime_utc": "2024-11-28T11:00:00.000Z",
            "job_location": "Montreal, Quebec",
            "job_city": "Montreal",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 45.501886899999995,
            "job_longitude": -73.56739189999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DMnJ7mWnyfZC5x7EHAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17205100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "peT5lTc_ky8OkGZBAAAAAA==",
            "job_title": "Asst. Software Engineer",
            "employer_name": "Electronic Arts (EA)",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSO0P41DXL8scyIsqlWpqW4zk1giKA_hEEXUrfY&s=0",
            "employer_website": "http://ea.com/",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/asst-software-engineer-at-electronic-arts-ea-4084712418?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/asst-software-engineer-at-electronic-arts-ea-4084712418?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "At Electronic Arts (EA), DRE (Development and Release Engineering) represents the pinnacle of continuous integration and build mastery. Composed of over 100 dedicated professionals, our global presence spans North American, European, and Asia-Pacific EA studios.\n\nOur Commitment\n\nWe take pride in delivering exceptional automation services to our diverse clientele within EA—ranging from game and engine groups to product and content teams.\n\nYour Opportunity\n\nWe are looking for a Coop for a 8-month contract to work alongside our DRE Mobile team. This position is open for candidates in Vancouver, Canada, or those preferring a remote/hybrid arrangement. As a team member, you'll report directly to the DRE Mobile Technical Director and engage closely with our internal partner development teams to enhance their engineering journey.\n\nResponsibilities\n• Implement internal CI/CD improvement initiatives\n• Maintain build automation pipeline with the team\n• Collaborate with partner teams to expand and maintain build infrastructure environments\n• Identify gaps/toil within build & automation workflows and implement automated scalable, reliable and repeatable solutions\n• Monitor and address automated systems issues\n\nQualifications\n\nEngineering skills:\n• Within a computer science or engineering post secondary program\n• Exposed to object-oriented/scripting languages (e.g C#, Java, Groovy, Python, Ruby)\n• Exposed to cloud platforms (e.g AWS, GCP, Azure)\n• Containerization technologies (e.g Docker, Kubernetes)\n• Source control management tools (e.g Perforce, Git)\n• Virtualization environments and tools (e.g VMs, vSphere)\n\nSoft Skills\n• Excellent interpersonal skills and a desire to collaborate\n• Excellent analytical skills\n• Familiar with Agile methodology\n• Manage tasks and responsibilities\n• Learn and apply new concepts, principles and solutions\n\nCOMPENSATION AND BENEFITS The base salary ranges listed below are for the defined geographic market pay zones in these states. If you reside outside of these locations, a recruiter will advise on the base salary range and benefits for your specific location. EA has listed the hourly pay ranges it in good faith expects to pay applicants for this role in the locations listed, as of the time of this posting. Salary offered will be determined based on numerous relevant business and candidate factors including, for example, degree type (e.g. Bachelor’s, Master’s, PhD), what stage you are in your degree journey (i.e. freshman, sophomore, etc.), qualifications, certifications, experience, skills, geographic location, and business or organizational needs. PAY RANGES\n• British Columbia (depending on location e.g. Vancouver vs. Victoria)\n• $65,000 - $70,000 CAD\n\nThe hourly pay is just one part of the overall compensation at EA. We also offer a package of benefits including 80 hours per year of sick time (prorated based on scheduled hours per week if less than full-time), 16 paid company holidays per year, medical insurance, and 401(k). Interns in California are also eligible for Voluntary Disability Insurance.",
            "job_is_remote": false,
            "job_posted_at": "4 hours ago",
            "job_posted_at_timestamp": 1732845600,
            "job_posted_at_datetime_utc": "2024-11-29T02:00:00.000Z",
            "job_location": "Burnaby, BC",
            "job_city": "Burnaby",
            "job_state": "British Columbia",
            "job_country": "CA",
            "job_latitude": 49.248809099999995,
            "job_longitude": -122.9805104,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DpeT5lTc_ky8OkGZBAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15113200",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "kE0XUyvK9k4j5ZnsAAAAAA==",
            "job_title": "Design Technician & Order Engineering Mechanical Co-op",
            "employer_name": "INNIO",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSTy_mVeOxEOilc4CN72VDmRjnuGAedRl9fNXce&s=0",
            "employer_website": null,
            "job_publisher": "Indeed",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.indeed.com/viewjob?jk=de462b22c303e8d1&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://ca.indeed.com/viewjob?jk=de462b22c303e8d1&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/design-technician-order-engineering-mechanical-co-op-at-innio-group-4087229041?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://fr.glassdoor.ca/job-listing/design-technician-and-order-engineering-mechanical-co-op-innio-JV_IC2281780_KO0,56_KE57,62.htm?jl=1009544950698&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/qvN-Kj_bqChBzlVuNxrowJ37bUo0VjS7SbuYlkCsY8wePVoClITQnA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "This role is a supportive one for the INNIO Order Engineering & Power Generation team, focusing on the design of reciprocating engines and packaged generator sets. The job involves collaborating with global engineering teams to provide product solutions for customers. Tasks include handling Engineering Change Requests to enhance assembly or test process flow, improving customer drawings, and fulfilling custom design requests for new sales. The position requires skills in design, CAD, Bill of Material (BOM) creation, task/project management, and familiarity with INNIO's quality system.\n\nCo-op Term: January 2025 - April 2025\n\nEssential Responsibilities\n• Create and modify parametric 3D models and drawings throughout all stages of the design and development process to communicate component design intent using CREO\n• Produce 2D drawings which include the application of dimension techniques while considering manufacturability and design intent.\n• Create and release complete technical data packages as required for production of new designs.\n• Complete all required business system transactions associated with Engineering Change releases as required · Create and release customer documentation packages to provide instruction for Installation, Operation, and Maintenance.\n• Use expertise in design/reciprocating engines/gensets to help resolve manufacturing issues\n• Participate in project teams as the mechanical Order Engineering resource and complete all design tasks required to release the product to schedule · Participate in technical design reviews\n• Provide technical support to other functional areas as required\n\nQualifications/Requirements\n• In the process of completing degree in a related discipline, such as Mechanical Engineering/Technologist.\n• Experience working within a manufacturing setting\n\nDesired Characteristics\n• Demonstrated design skills to analyze technical requirements and applying appropriate skill set to design and detail system schematics within AutoCAD or other similar 2D CAD software\n• Experience designing circuit schematics and wiring diagrams.\n• Experience with Pro/Intralink or PDMLINK/Windchill or other CAD file management system would be considered an asset.\n• Oracle/SAP Business system experience would be considered an asset.\n• Demonstrated proficiency in written, oral, and presentation skills\n• Must embrace continuous improvement and have a strong desire to learn\n• Demonstrated professional characteristics necessary for working in and leading global teams such as task definition, team building, mentoring and training both local and remote colleagues, collaborative interpersonal skills, and effective communication.",
            "job_is_remote": false,
            "job_posted_at": "12 hours ago",
            "job_posted_at_timestamp": 1732816800,
            "job_posted_at_datetime_utc": "2024-11-28T18:00:00.000Z",
            "job_location": "Welland, ON",
            "job_city": "Welland",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 42.992157899999995,
            "job_longitude": -79.2482555,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DkE0XUyvK9k4j5ZnsAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "17214100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "tj7bjvM-4ZNAHYo4AAAAAA==",
            "job_title": "Stagiaire en gestion de projets - hiver 2025",
            "employer_name": "WSP in Canada",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQdlIFurvPB4wmekXqZd2cNcRqZRLazPodXkTK5&s=0",
            "employer_website": null,
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/stagiaire-en-gestion-de-projets-hiver-2025-at-wsp-in-canada-4086206557?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/stagiaire-en-gestion-de-projets-hiver-2025-at-wsp-in-canada-4086206557?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Job Description\n\nL’opportunité d’emploi :\n\nIl s'agit d'une excellente opportunité pour un professionnel en début de carrière qui cherche à franchir une nouvelle étape et à développer davantage sa carrière dans le secteur de la gestion de projets de construction de bâtiments (institutionnels, industriels, résidentiels).\n\nVous ferez partie de notre équipe en pleine croissance et utiliserez vos compétences générales et techniques pour collaborer avec vos collègues afin de gérer d'importants projets.En tant qu'assistant de projet, vous aurez la chance de vous impliquer dans diverses tâches à différentes phases, y compris la collaboration avec des parties prenantes internes et externes.Nous recherchons des personnes dotées d’un état d’esprit innovant, capables d’accepter le changement et de collaborer avec nos clients pour parvenir à des solutions fondées sur la valeur.\n\nPourquoi choisir WSP?\n• Nous valorisons une culture d’inclusion et d’appartenance et nous nous engageons à la préserver.\n• Notre politique de travail flexible – Nous reconnaissons l’importance de l’équilibre entre nos vies professionnelles et privées et nous vous encourageons à trouver le vôtre. Nous vous soutenons dans toutes les sphères de votre vie de façon à assurer votre entière présence, au travail comme à la maison.\n• Une histoire de réussite canadienne – Chez WSP, nous sommes fiers de porter le rouge et blanc de notre magnifique pays et de montrer au monde tout ce que le Canada a à offrir.\n• Rendre le monde qui nous entoure meilleur – De l’environnement aux infrastructures routières, en passant par les bâtiments et l’aménagement des terres, WSP façonne notre pays.\n• D’excellentes perspectives de carrière – Nous sommes en pleine croissance et chaque jour, nous tâchons de nous surpasser. Nous sommes ouverts à vos idées et souhaitons tenter de nouvelles choses.\n• WSP, c’est adopter une culture de collaboration exceptionnelle avec des collègues qui se distinguent aussi bien par leurs compétences que par l’humilité dont ils font preuve dans leur travail d’une grande importance. Venez découvrir notre fantastique équipe!\n\nNous offrons à nos employés des salaires concurrentiels, des options de travail flexibles, une culture d’entreprise exceptionnelle et des avantages sociaux complets axés sur les employés, dont une plateforme en ligne de santé et de mieux-être, ainsi que des programmes d’épargne intéressants et une vision claire pour l’avenir.\n\n#NousSommesWSP\n\nCe que vous pouvez vous attendre à faire avec nous:\n\nCollaborer avec/assister le gestionnaire de projet dans les tâches suivantes :\n• Collaborer avec/assister la gestionnaire de projet afin de gérer toutes les phases de la réalisation des projets soit la phase du validation, programme fonctionnel et technique, conception et planification, appel d’offre, construction ainsi que la phase d’intégration finale des biens livrables au client et la fermeture des projets dans le cadre de projets dans le domaine de la construction de bâtiments;\n• Collaborer avec/assister la gestionnaire de projet dans différentes taches de projet y compris: Gestion de budget et contrôle des coûts / Gestion de la portée / Gestion de l’échéancier / Gestion des partie prenantes et coordination internes et externes/ Gestion de communication (avec le client, les différents intervenants contractuels et les unités fonctionnelles impliquées dans le projet)/ Gestion de la qualité / Gestion des documents / Gestion des risques / Gestion d’approvisionnement et des achats du projet et administration des contrats /Gestion des ressources du projet/ Gestion des changements/ Gestion d’approbations internes et externes\n• Effectuer toutes autres tâches connexes pouvant aider à la réalisation du projet.\n\nCe que vous apporterez à WSP :\n• Étudiantes en génie en architecture ou toute autre formation jugée équivalente ;\n• Expérience antérieure dans la construction, en génie-conseil, la vente, le militaire, considéré comme un atout;\n• Sens de l’initiative, souci du détail;\n• Capacité à travailler en équipe;\n• Capacité de communication tant à l’oral qu’à l’écrit (français et anglais);\n\nAbout Us\n\nWSP est l’une des plus importantes firmes de services professionnels à travers le monde. Notre mission est d’assurer la pérennité de nos villes et nos environnements.\n\nNotre équipe compte plus de 65 000 membres dans le monde. Au Canada uniquement, nous sommes plus de 12 000 personnes impliquées dans tous les domaines; de l'assainissement de l'environnement à la planification urbaine, de l'ingénierie de bâtiments emblématiques à la réalisation de réseaux de transport durables. Nous trouvons de nouvelles façons d'extraire des ressources essentielles et développons des sources d'énergie renouvelables pour l'avenir.\n\nChez WSP :\n• Nous accordons une grande valeur à nos employés et à notre réputation.\n• Nous œuvrons localement, mais avec une envergure internationale.\n• Nous sommes axés sur l’avenir et remettons en question le statu quo.\n• Nous favorisons la collaboration dans tout ce que nous faisons.\n• Nous soutenons une culture d’autonomie et de responsabilisation.\n\nVeuillez noter:\n\nLa santé et la sécurité sont des valeurs absolument essentielles pour WSP. Étant donné l’importance de se garder en sécurité, vous devez vous conformer à notre politique de santé, sécurité et environnement (SSE) en tout temps, ainsi qu’aux politiques SSE du client lorsque cela s’applique.\n\nLes offres d'emploi pour des postes impliquant des travaux sur le terrain et assujettis en matière de sécurité sont conditionnelles à ce que les candidats soient en mesure d'effectuer des tâches physiques clés du travail tel que décrit dans l'offre d'emploi et lors de l'entrevue. Cela peut inclure la capacité de travailler dans une variété de conditions environnementales, telles que les régions éloignées ou isolées, travailler seul, et dans des cas de mauvais temps (dans des limites sûres et raisonnables).\n\nL'usage du genre masculin inclut le féminin et n'a été utilisé que pour alléger le texte\n\nWSP accueille et encourage les personnes à mobilité réduite. Les accommodements sont disponibles sur demande pour les candidats qui participent à tous les aspects du processus de sélection.\n\nWSP souscrit au principe de l’équité en matière d’emploi. Seules les candidatures retenues seront contactées.\n\nWSP n’accepte pas les cv spontanés transmis par des agences. Pour obtenir de plus amples renseignements, veuillez lire VEUILLEZ LIRE L’INTÉGRALITÉ DE LA POLITIQUE",
            "job_is_remote": false,
            "job_posted_at": "4 hours ago",
            "job_posted_at_timestamp": 1732845600,
            "job_posted_at_datetime_utc": "2024-11-29T02:00:00.000Z",
            "job_location": "Brossard, Quebec",
            "job_city": "Brossard",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 45.4514357,
            "job_longitude": -73.4619103,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dtj7bjvM-4ZNAHYo4AAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13108200",
            "job_onet_job_zone": null
        },
        {
            "job_id": "3RpncMZRJuBubzcjAAAAAA==",
            "job_title": "R&D Pilot Operator Intern",
            "employer_name": "Veolia",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRmaNhtgo1-VcxLFBy1NAH9TVIab8p7QS7gMQ__&s=0",
            "employer_website": "http://www.veolia.com/",
            "job_publisher": "Indeed",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://emplois.ca.indeed.com/viewjob?jk=174f2cbdda665cb0&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Indeed",
                    "apply_link": "https://emplois.ca.indeed.com/viewjob?jk=174f2cbdda665cb0&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Company Description\n\nVeolia Group is a global leader in environmental services, operating across all five continents with nearly 218,000 employees. Specializing in water, energy, and waste management, Veolia Group designs and implements innovative solutions for decarbonization, depollution, and resource regeneration, supporting communities and industries in their ecological transformation. Within this framework, Veolia's Water Technology Business brings together a dedicated team of experienced professionals committed to tackling the world's most complex challenges related to water scarcity, quality, productivity, and energy. Together, we pursue a shared mission to create a more sustainable future.\n\nJob Description\n\nLocation: Guelph, ON, Canada\n\nJob Summary about the area and the role:\nVeolia Water Technologies & Solutions (VWTS) is a leader in worldwide water recovery, treatment, and reuse. We design and supply a range of water systems, from food and beverage applications to municipal water, microelectronics ultrapure water, and heavy industrial wastewater treatment. We serve over 50,000 customers worldwide and treat more than 11 million cubic meters of water daily.\nWe aim to be the benchmark company for ecological transformation worldwide.\nAt VWTS, we realize that diverse teams make smarter decisions, deliver better results, and build stronger communities. We champion diversity and inclusion at every rung of the ladder and are proud to be an equal opportunity workplace. We offer challenging and meaningful careers with competitive benefits and flexible work arrangements.\n\nSummary of the Job\nThe R&D Pilot Operator Intern will maintain process testing systems to support the Technology\nTeam's validation process for new product introductions at pilot levels and full-scale customer sites.\nKey Characteristics\nHonesty\nAccountability\nTeamwork\n\nDuties & Responsibilities:\nConduct tests for water and wastewater products and systems, including monitoring,\ndocumentation, chemical dosing, inspections, and communication with test leaders.\nPerform analytical laboratory tests and document the results accurately to characterize\nprocess water samples.\nAssist with maintaining and modifying fluid system components such as PVC piping spools, valves, pumps, blowers, and calibrating instruments.\nCollaborate closely with suppliers to source and procure fluid system components and\nconsumables, ensuring accurate and timely billing and invoicing.\nProvide on-call and weekend support for the testing facility, as needed.\nAct as backup for Oakville pilot operator, as needed.\nCollaborate with the team on health and safety, maintenance, and improvement activities to ensure safe and efficient facility operations.\n\nHard Skills:\nHand and power tools\nGoogle Workspace\nMicrosoft Excel\n\nSoft Skills:\nStrong oral and written communication skills.\nMotivated learner, willing to learn new skills and take on new tasks.\nSelf-motivated, ability to work independently and with minimal supervision.\nAbility to be flexible in managing multiple tasks with changing priorities.\n\nQualifications\n\nEducation & Experience\n\nRequired:\nPursuing a diploma or degree in Mechanical, Chemical, or Environmental\nEngineering/Technology or a related technical discipline focused on water/wastewater\ntreatment.\nValid Ontario G2 or G class driver's license.\n\nPreferred:\nKnowledge or experience in water/wastewater treatment, preferably with direct exposure\nto membrane products and processes.\nKnowledge or experience with fluid systems (piping, pumps, valves, P&ID drawings, etc.).\nKnowledge or experience with laboratory methods for water/wastewater analysis.\n\nAdditional Information\n\nWorking Conditions\nAbility to lift equipment or modules weighing up to 30 lbs. occasionally.\nExposure to municipal and industrial wastewater and cleaning chemicals.\nThe work environments consist of various settings, including office, industrial facilities, and\nlaboratories.\n\nAs an inclusive company, Veolia is committed to diversity and gives equal consideration to all applications, without discrimination.",
            "job_is_remote": false,
            "job_posted_at": "10 hours ago",
            "job_posted_at_timestamp": 1732824000,
            "job_posted_at_datetime_utc": "2024-11-28T20:00:00.000Z",
            "job_location": "Ontario",
            "job_city": null,
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 51.253775,
            "job_longitude": -85.323214,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D3RpncMZRJuBubzcjAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "19203200",
            "job_onet_job_zone": "5"
        },
        {
            "job_id": "1laiKNwqIcFwAHtVAAAAAA==",
            "job_title": "AML/ATF Compliance Associate",
            "employer_name": "National Consulting Limited",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSl98nzFtheN1Oow4zjBRWC887Xe6UwT2m_YFlX&s=0",
            "employer_website": "https://nationalconsultinglimited.com/",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/aml-atf-compliance-associate-at-national-consulting-limited-4085163982?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/aml-atf-compliance-associate-at-national-consulting-limited-4085163982?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Jooble",
                    "apply_link": "https://ca.jooble.org/rjdp/-4550206022233312911?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Learn4Good",
                    "apply_link": "https://www.learn4good.com/jobs/online_remote/finance/3764850512/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Kit Job",
                    "apply_link": "https://www.kitjob.ca/job/88166633/compliance-associate-bgw262-minesing/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "National Consulting Limited (NCL) is actively seeking an experienced professional to assist in the delivery of Anti-Money Laundering (AML) and Anti-Terrorist Financing (ATF) compliance programs requirements to meet the needs of our credit union clients. This position works in conjunction with a team of specialists who report to the VP Business Solutions and works closely with credit unions, legal counsel, and regulators.\n\nThe Job\n\nResponsibilities\n\nThe successful candidate must be able to work independently and as a team in a remote (work-from-home) position. The key responsibilities of this position include:\n• Support the senior role in the delivery of the AML/ATF compliance program to credit union clients.\n• With guidance, create and deliver training courses on various AML/ATF related topics.\n• Participate in AML/ATF related projects.\n• Application of AML/AFT legislative requirements, including record keeping, reporting, monitoring and risk assessments.\n• Work in Verafin, Adobe Acrobat, MS Office 365 applications, SharePoint.\n\nThis is a permanent, full-time position (37.5 hours per week). Occasional travel and in-person attendance may be required. Computer equipment is supplied.\n\nThe Candidate\n\nThe Ideal Candidate Will Possess\n• 1-4 years’ experience in the credit union or co-operative system providing operational support or in AML and ATF.\n• Experience with Verafin.\n• Understand regulatory and legislative AML and ATF requirements.\n• A Canadian AML, ATF or other regulatory compliance or risk management designation would be beneficial.\n• Strong communication and interpersonal skills; you will build trusting relationships with credit union management and deliver excellent client experience.\n• As this is a work-from-home position, exceptional organizational and time-management skills are required to succeed in this position.\n\nThe Compensation\n\nNCL offers a competitive compensation package. Salary will depend on qualifications and experience. Benefits include a matched superannuation pension plan; group benefits (health, dental, life and disability insurance, healthcare spending allowance and wellness program), and paid personal days off.\n\nIf being part of our team interests you, please submit a resume and cover letter, in confidence, by Monday, December 2.\n\nWe appreciate the interest of all applicants; however, only those under consideration will be contacted.\n\nNational Consulting Limited is owned by a consortium of 25 Saskatchewan credit unions and partners with credit unions across Canada to provide expertise in Risk Services such as Compliance, AML, Fraud Protection, Privacy, Procurement, Banking and Card Services.",
            "job_is_remote": false,
            "job_posted_at": "17 hours ago",
            "job_posted_at_timestamp": 1732798800,
            "job_posted_at_datetime_utc": "2024-11-28T13:00:00.000Z",
            "job_location": "Canada",
            "job_city": null,
            "job_state": null,
            "job_country": "CA",
            "job_latitude": 56.130365999999995,
            "job_longitude": -106.34677099999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D1laiKNwqIcFwAHtVAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "13206100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "2-HQ0bgzxfDA9SZkAAAAAA==",
            "job_title": "Stagiaire - Développement durable intégré aux projets d'infrastructures - 8 mois",
            "employer_name": "ADM Aéroports de Montréal",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTOkLVypBEg3rRLuxzL35oDqbXGwIHN9-Nm5nw1&s=0",
            "employer_website": "http://www.admtl.com/",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Full-time",
            "job_employment_types": [
                "FULLTIME"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/stagiaire-d%C3%A9veloppement-durable-int%C3%A9gr%C3%A9-aux-projets-d-infrastructures-8-mois-at-adm-a%C3%A9roports-de-montr%C3%A9al-4084711146?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/stagiaire-d%C3%A9veloppement-durable-int%C3%A9gr%C3%A9-aux-projets-d-infrastructures-8-mois-at-adm-a%C3%A9roports-de-montr%C3%A9al-4084711146?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "OFFRE D'EMPLOI\n\nDemande N°: 11101\n\nPROPULSE TA CARRIÈRE AVEC ADM !\n\nTu es né.e pour ADM. Et on cherche justement un.e stagiaire au sein de notre équipe de la Gestion des interfaces et de la préparation opérationnelle, tu joueras un rôle en matière de développement durable dans la vice-présidence infrastructure aéroportuaire.\n• Un décollage vers une carrière enrichissante au sein d'ADM, un employeur qui voit ton potentiel ;\n• Une occasion de développer tes compétences dans un environnement unique et fascinant ;\n• Un solide réseau de contacts au sein du milieu aéroportuaire ;\n• L’accompagnement d’une mentore ou d’un mentor chevronné.e pour te guider tout au long de ton stage ;\n• La possibilité d’évoluer au sein d’une entreprise dont la culture est axée sur la passion, l'ouverture, l’audace, la fiabilité et la collaboration ;\n• Te réaliser pleinement en faisant un stage chez ADM, une expérience qui pourrait te mener loin dans ta carrière !\n\nMANDAT DU STAGE\n\nLe but du stage consiste à assister la Conseillère, planification en Développement durable dans la vice-présidence infrastructure aéroportuaire dans divers dossiers :\n• Participer à l’intégration du développement durable dans les projets d’infrastructure\n• Participer à la collecte de données en lien avec les cibles de développement durable d’ADM qui sont sous la responsabilité de la vice-présidence infrastructure aéroportuaire\n• Réaliser des études et analyses sur divers sujets en développement durable\n• Contribuer à sensibiliser les employés de YUL et YMX au développement durable\n\nEXIGENCES\n• Être étudiant.e de 2e cycle dans une institution scolaire au Québec dans un domaine pertinent tel qu’en urbanisme, génie, géographie, développement durable ;\n• Habileté à établir une bonne communication avec des équipes multidisciplinaire ;\n• Être capable de travailler de manière autonome ;\n• Avoir le sens de l’organisation ;\n• Être proactif dans ses démarches ;\n• Bonne capacité rédactionnelle et de synthèse ;\n• Bonne connaissance dans la gestion et l’organisation de données quantitatives et qualitatives.\n\nUN DÉCOLLAGE À TON AVANTAGE\n• Période de janvier à août 2025 ;\n• Un taux horaire en fonction de niveau de scolarité dans le programme ;\n• Maitrise : 25,50 $/h\n• Un horaire de 37,5 heures semaine du lundi au vendredi ;\n• Stationnement gratuit ;\n• Une participation active à des dossiers d'envergures ;\n• Une ambiance agréable ;\n• Lieu de travail : Dorval.\n\nNous vous remercions de l'intérêt porté envers ADM. Seules les candidatures sélectionnées seront contactées.",
            "job_is_remote": false,
            "job_posted_at": "7 hours ago",
            "job_posted_at_timestamp": 1732834800,
            "job_posted_at_datetime_utc": "2024-11-28T23:00:00.000Z",
            "job_location": "Montreal, Quebec",
            "job_city": "Montreal",
            "job_state": "Quebec",
            "job_country": "CA",
            "job_latitude": 45.501886899999995,
            "job_longitude": -73.56739189999999,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D2-HQ0bgzxfDA9SZkAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "19204100",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "2aKRgMFy2dDAZDXRAAAAAA==",
            "job_title": "Software Engineer Intern (Toronto) - Spring 2025",
            "employer_name": "Snowflake",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQSpLqaY5bhser3M_0CNtOLHRqhfh6VYSZ_gF1p&s=0",
            "employer_website": "http://www.snowflake.com/",
            "job_publisher": "Snowflake Careers",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://careers.snowflake.com/us/en/job/SNCOUS02F8F978CAB8445AB01A20FC582585A6EXTERNALENUSCA0CEA544C3D4F41AE88BB92E3B7FBB6/Software-Engineer-Intern-Toronto-Spring-2025?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "Snowflake Careers",
                    "apply_link": "https://careers.snowflake.com/us/en/job/SNCOUS02F8F978CAB8445AB01A20FC582585A6EXTERNALENUSCA0CEA544C3D4F41AE88BB92E3B7FBB6/Software-Engineer-Intern-Toronto-Spring-2025?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Job Board",
                    "apply_link": "https://borderlessai.applytojobs.ca/engineering/30500?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "ZipRecruiter",
                    "apply_link": "https://www.ziprecruiter.com/c/Amazon/Job/Amazon-Robotics-Software-Development-Engineer-Co-Op-and-Intern-2025-Toronto/-in-Toronto,ON?jid=2a2615390e0c7991&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Indeed",
                    "apply_link": "https://emplois.ca.indeed.com/viewjob?jk=5d884f299cc392ed&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Itjobs.ca",
                    "apply_link": "https://www.itjobs.ca/en/offer/on/toronto/amazon-robotics-software-development-engineer-co-op-and-intern-2025-toronto/c88a18e1-3490-4c8f-82af-e7875c08918d_en/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "The Muse",
                    "apply_link": "https://www.themuse.com/jobs/snowflake/software-engineer-intern-toronto-spring-2025-b4550a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "Glassdoor",
                    "apply_link": "https://www.glassdoor.ca/job-listing/amazon-robotics-software-development-engineer-co-op-and-intern-2025-toronto-amazon-canada-fulfillment-services-ulc-JV_IC2281069_KO0,75_KE76,114.htm?jl=1009425247298&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                },
                {
                    "publisher": "SimplyHired",
                    "apply_link": "https://www.simplyhired.ca/job/9fueMlFI5ny6DswCB_39uflYD9Ijtd0fr_CkxNcY_KpCA947xkHV4A?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "Build the future of the AI Data Cloud. Join the Snowflake team.\n\nSnowflake started with a clear vision: develop a cloud data platform that is effective, affordable, and accessible to all data users. Snowflake developed an innovative new product with a built-for-the-cloud architecture that combines the power of data warehousing, the flexibility of big data platforms, and the elasticity of the cloud at a fraction of the cost of traditional solutions. We are now a global, world-class organization with offices in more than a dozen countries and serving many more.\n\nWe’re looking for dedicated students who share our passion for ground-breaking technology and want to create a lasting future for you and Snowflake.\nWHAT WE OFFER:\n• Paid, full-time internships in the heart of the software industry\n• Post-internship career opportunities (full-time and/or additional internships)\n• Exposure to a fast-paced, fun and inclusive culture\n• A chance to work with world-class experts on challenging projects\n• Opportunity to provide meaningful contributions to a real system used by customers\n• High level of access to supervisors (manager and mentor), detailed direction without micromanagement, feedback throughout your internship, and a final evaluation\n• Stuff that matters: treated as a member of the Snowflake team, included in company meetings/activities, flexible hours, casual dress code, accommodations to work from home, swag and much more\n• When return to office in effect, catered lunches, access to gaming consoles, recreational games, happy hours, company outings, and more\n\nWHAT WE EXPECT:\n• Desired class level: 3rd/4th year Undergraduates, Masters, or PhD\n• Desired majors: Computer Science, Computer Engineering, Software Engineering, or related field\n• Required coursework: algorithms, data structures, and operating systems\n• Recommended coursework: cloud computing, database systems, distributed systems, and real-time programming\n• Bonus experience: working experience, research or publications in databases or distributed systems, and contributions to open source\n• When: Spring 2025 (January - April 2025)\n• Duration: 12 week minimum, 12-16 weeks recommended\n• Excellent programming skills in C++ or Java\n• Knowledge of data structures and algorithms\n• Strong problem solving and ability to learn quickly in a dynamic environment\n• Experience with working as a part of a team\n• Dedication and passion for technology\n\nWHAT YOU WILL LEARN/GAIN:\n• How to build enterprise grade, reliable, and trustworthy software/services\n• Exposure to SQL or other database technologies\n• Understanding of database internals, large-scale data processing, transaction processing, distributed systems, and data warehouse design\n• Implementation, testing of features in query compilation, compiler design, query execution\n• Experience working with cloud infrastructure, AWS, Azure, and/or Google Cloud in particular\n• Learning about cutting edge database technology and research\n\nPOSSIBLE TEAMS/WORK FOCUS AREAS:\n• Data Applications Infrastructure, Data Marketplace, Data Privacy, Data Sharing\n• High performance large-scale data processing\n• Large-scale distributed systems\n• Software-as-a-Service platform\n• Software frameworks for stability and performance testing\n\nEvery Snowflake employee is expected to follow the company’s confidentiality and security standards for handling sensitive data. Snowflake employees must abide by the company’s data security plan as an essential part of their duties. It is every employee's duty to keep customer information secure and confidential.\n\nSnowflake is growing fast, and we’re scaling our team to help enable and accelerate our growth. We are looking for people who share our values, challenge ordinary thinking, and push the pace of innovation while building a future for themselves and Snowflake.\n\nHow do you want to make your impact?",
            "job_is_remote": false,
            "job_posted_at": "6 hours ago",
            "job_posted_at_timestamp": 1732838400,
            "job_posted_at_datetime_utc": "2024-11-29T00:00:00.000Z",
            "job_location": "Toronto, ON",
            "job_city": "Toronto",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 43.653226,
            "job_longitude": -79.3831843,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D2aKRgMFy2dDAZDXRAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "15113200",
            "job_onet_job_zone": "4"
        },
        {
            "job_id": "Op_P1Ght85JGpuvPAAAAAA==",
            "job_title": "Temporary Accounting Clerk II - Finance",
            "employer_name": "Renfrew County District School Board",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR6ijZUJYOp0wvWUbnqFFt-aSf3SYRIBxeQtnQi&s=0",
            "employer_website": "http://www.rcdsb.on.ca/",
            "job_publisher": "LinkedIn",
            "job_employment_type": "Internship",
            "job_employment_types": [
                "INTERN"
            ],
            "job_apply_link": "https://ca.linkedin.com/jobs/view/temporary-accounting-clerk-ii-finance-at-renfrew-county-district-school-board-4084479973?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
            "job_apply_is_direct": false,
            "apply_options": [
                {
                    "publisher": "LinkedIn",
                    "apply_link": "https://ca.linkedin.com/jobs/view/temporary-accounting-clerk-ii-finance-at-renfrew-county-district-school-board-4084479973?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
                    "is_direct": false
                }
            ],
            "job_description": "November 28, 2024\n\nTHE RENFREW COUNTY DISTRICT SCHOOL BOARD\n\nrequires a\n\nTEMPORARY ACCOUNTING CLERK II - FINANCE\n\nLOCATION:\n\nBoard Administration Office, Pembroke\n\nSchedule\n\n7 hours per day, 35 hours per week, 12 months per year\n\nRate Of Pay\n\n$27.72- $28.55 (Group 6)\n\nStart Date\n\nImmediately\n\nEnd Date\n\nJuly 7, 2025 (or return of incumbent)\n\nApplication Deadline\n\nDecember 4, 2024 at 12:00 p.m.\n\nQualifications\n\nTwo year post secondary diploma in business and / or finance. Minimum of 6 to 12 months experience required. The applicant must comprehensively use software including accounting software, spreadsheets, word processing and web based applications. Communicate effectively and concisely, both orally and in writing. Work effectively independently as well as in a team environment. Strong organizational and time management skills, with particular attention to detail. Handle sensitive and confidential material with discretion and ensure protection of information. Focus on providing excellent customer service by identifying and meeting customer needs, using processes and procedures that are customer oriented and seeking solutions to resolve service issues.\n\nDuties\n\nUnder the direction of the Payroll and Accounting Supervisors, supports both the Payroll and Accounting Departments (approximately 50% in each department) produces the bi-weekly and monthly payrolls including making adjustments; maintains employee records; deals with enquiries; remitting reports to outside agencies; compiling and distributing internal reports; review and code and enter invoices for payment; match invoices with approved purchase orders; enter journal entries and accounts receivable invoices; communicate with personnel and suppliers regarding payment of invoices.\n\nOnly candidates selected for interviews will be contacted. All other applicants are thanked for their interest.\n\nAll offers of employment are conditional upon receipt of a current vulnerable sector screening and educational qualifications acceptable to the District.\n\nPlease advise Human Resources (hrdept@rcdsb.on.ca) prior to the closing date if you require accommodation at any time throughout the application process so the appropriate arrangements can be made.\n\nThe Renfrew County District School Board is committed to equity, diversity and inclusion in our employment practices. For more information please visit the RCDSB Careers page.",
            "job_is_remote": false,
            "job_posted_at": "10 hours ago",
            "job_posted_at_timestamp": 1732824000,
            "job_posted_at_datetime_utc": "2024-11-28T20:00:00.000Z",
            "job_location": "Pembroke, ON",
            "job_city": "Pembroke",
            "job_state": "Ontario",
            "job_country": "CA",
            "job_latitude": 45.826651299999995,
            "job_longitude": -77.1108826,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DOp_P1Ght85JGpuvPAAAAAA%3D%3D&vssid=jobs-detail-viewer",
            "job_salary": null,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_period": null,
            "job_highlights": {},
            "job_onet_soc": "43303100",
            "job_onet_job_zone": "3"
        }
    ]
}